{
    "softwareAcknowledgments": {
        "message": "सॉफ्टवेयर स्वीकृतियाँ",
        "description": "Shown in the about box for the link to software acknowledgments"
    },
    "privacyPolicy": {
        "message": "नियम और गोपनीयता नीति",
        "description": "Shown in the about box for the link to https://signal.org/legal"
    },
    "copyErrorAndQuit": {
        "message": "त्रुटि कॉपी करें और ऐप बंद करें",
        "description": "Shown in the top-level error popup, allowing user to copy the error text and close the app"
    },
    "unknownContact": {
        "message": "अज्ञात संपर्क",
        "description": "Shown as the name of a contact if we don't have any displayable information about them"
    },
    "unknownGroup": {
        "message": "अनजान समूह",
        "description": "Shown as the name of a group if we don't have any information about it"
    },
    "databaseError": {
        "message": "डेटाबेस त्रुटि",
        "description": "Shown in a popup if the database cannot start up properly"
    },
    "deleteAndRestart": {
        "message": "सारा डाटा हटाएँ और फिर से शुरु करें।",
        "description": "Shown in a popup if the database cannot start up properly; allows user to delete database and restart"
    },
    "mainMenuFile": {
        "message": "&File",
        "description": "The label that is used for the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuCreateStickers": {
        "message": "स्टिकर पैक बनाएँ/अपलोड करें",
        "description": "The label that is used for the Create/upload sticker pack option in the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuEdit": {
        "message": "&Edit",
        "description": "The label that is used for the Edit menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuView": {
        "message": "&View",
        "description": "The label that is used for the View menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuWindow": {
        "message": "&Window",
        "description": "The label that is used for the Window menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuHelp": {
        "message": "&Help",
        "description": "The label that is used for the Help menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuSettings": {
        "message": "पसंदगी...",
        "description": "The label that is used for the Preferences menu in the program main menu. This should be consistent with the standard naming for ‘Preferences’ on the operating system."
    },
    "appMenuServices": {
        "message": "Services",
        "description": "Application menu item for macOS 'Services'"
    },
    "appMenuHide": {
        "message": "छुपा दें",
        "description": "Application menu command to hide the window"
    },
    "appMenuHideOthers": {
        "message": "अन्य को छुपा दें",
        "description": "Application menu command to hide all other windows"
    },
    "appMenuUnhide": {
        "message": "सब दिखाएँ",
        "description": "Application menu command to show all application windows"
    },
    "appMenuQuit": {
        "message": "Signal बंद करें",
        "description": "Application menu command to close the application"
    },
    "editMenuUndo": {
        "message": "पूर्ववत",
        "description": "Edit menu command to remove recently-typed text"
    },
    "editMenuRedo": {
        "message": "रीडू",
        "description": "Edit menu command to restore previously undone typed text"
    },
    "editMenuCut": {
        "message": "कट",
        "description": "Edit menu command to remove selected text and add it to clipboard"
    },
    "editMenuCopy": {
        "message": "कॉपी",
        "description": "Edit menu command to add selected text to clipboard"
    },
    "editMenuPaste": {
        "message": "पेस्ट",
        "description": "Edit menu command to insert text from clipboard at cursor location"
    },
    "editMenuPasteAndMatchStyle": {
        "message": "पेस्ट करें और स्टाइल मिलाएँ",
        "description": "Edit menu command to insert text from clipboard at cursor location, taking only text and not style information"
    },
    "editMenuDelete": {
        "message": "हटाना",
        "description": "Edit menu command to remove the selected text"
    },
    "editMenuSelectAll": {
        "message": "सब चुन लें",
        "description": "Edit menu command to select all of the text in selected text box"
    },
    "editMenuStartSpeaking": {
        "message": "बोलना शुरु करें",
        "description": "Edit menu item under 'speech' to start dictation"
    },
    "editMenuStopSpeaking": {
        "message": "बोलना बंद करें",
        "description": "Edit menu item under 'speech' to stop dictation"
    },
    "windowMenuClose": {
        "message": "विंडो बंद करें",
        "description": "Window menu command to close the current window"
    },
    "windowMenuMinimize": {
        "message": "मिनिमाइज़",
        "description": "Window menu command to minimize the current window"
    },
    "windowMenuZoom": {
        "message": "बङा करें",
        "description": "Window menu command to make the current window the size of the whole screen"
    },
    "windowMenuBringAllToFront": {
        "message": "सब आगे ले आयें",
        "description": "Window menu command to bring all windows of current application to front"
    },
    "viewMenuResetZoom": {
        "message": "असल आकार का करें",
        "description": "View menu command to go back to the default zoom"
    },
    "viewMenuZoomIn": {
        "message": "बङा करें",
        "description": "View menu command to make everything bigger"
    },
    "viewMenuZoomOut": {
        "message": "छोटा करें",
        "description": "View menu command to make everything smaller"
    },
    "viewMenuToggleFullScreen": {
        "message": "पूरी स्क्रीन करें/हटाएँ",
        "description": "View menu command to enter or leave Full Screen mode"
    },
    "viewMenuToggleDevTools": {
        "message": "डेवलपर टूल्स दिखाएँ/हटाएँ",
        "description": "View menu command to show or hide the developer tools"
    },
    "menuSetupAsNewDevice": {
        "message": "नये डिवाइस कि तरह स्थापना करें",
        "description": "When the application is not yet set up, menu option to start up the set up as fresh device"
    },
    "menuSetupAsStandalone": {
        "message": "स्टैंडअलोन डिवाइस की तरह स्थापना करें",
        "description": "Only available on development modes, menu option to open up the standalone device setup sequence"
    },
    "messageContextMenuButton": {
        "message": "अधिक कनेक्शन",
        "description": "Label for context button next to each message"
    },
    "contextMenuCopyLink": {
        "message": "लिंक कॉपी करें",
        "description": "Shown in the context menu for a link to indicate that the user can copy the link"
    },
    "contextMenuCopyImage": {
        "message": "तस्वीर को कॉपी करें",
        "description": "Shown in the context menu for an image to indicate that the user can copy the image"
    },
    "contextMenuNoSuggestions": {
        "message": "कोई सुझाव नहीं",
        "description": "Shown in the context menu for a misspelled word to indicate that there are no suggestions to replace the misspelled word"
    },
    "avatarMenuViewArchive": {
        "message": "संग्रह देखें",
        "description": "One of the menu options available in the Avatar Popup menu"
    },
    "avatarMenuChatColors": {
        "message": "चैट का रंग",
        "description": "One of the menu options available in the Avatar Popup menu"
    },
    "loading": {
        "message": "लोड हो रहा है",
        "description": "Message shown on the loading screen before we've loaded any messages"
    },
    "optimizingApplication": {
        "message": "एप्लिकेशन को बेहतर कर रहे हैं...",
        "description": "Message shown on the loading screen while we are doing application optimizations"
    },
    "migratingToSQLCipher": {
        "message": "मेसेजों को बेहतर कर रहे हैं... $status$ पूरा हुआ।",
        "description": "Message shown on the loading screen while we are doing application optimizations",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "45/200"
            }
        }
    },
    "archivedConversations": {
        "message": "संगृहीत वार्तालाप",
        "description": "Shown in place of the search box when showing archived conversation list"
    },
    "LeftPane--pinned": {
        "message": "पिन किया गया",
        "description": "Shown as a header for pinned conversations in the left pane"
    },
    "LeftPane--chats": {
        "message": "चैट",
        "description": "Shown as a header for non-pinned conversations in the left pane"
    },
    "archiveHelperText": {
        "message": "यह वार्तालाप संग्रहीत कर दिये गये हैं और इनबॉक्स में तभी दिखेंगे अगर इनमें कोई नया मेसेज प्राप्त होगा।",
        "description": "Shown at the top of the archived conversations list in the left pane"
    },
    "archiveConversation": {
        "message": "संग्रहित करें",
        "description": "Shown in menu for conversation, and moves conversation out of main conversation list"
    },
    "markUnread": {
        "message": "न पढ़ा हुआ मार्क करें",
        "description": "Shown in menu for conversation, and marks conversation as unread"
    },
    "moveConversationToInbox": {
        "message": "अनारक्षित करें",
        "description": "Undoes Archive Conversation action, and moves archived conversation back to the main conversation list"
    },
    "pinConversation": {
        "message": "संवाद को पिन करें",
        "description": "Shown in menu for conversation, and pins the conversation to the top of the conversation list"
    },
    "unpinConversation": {
        "message": "संवाद को अनपिन करें",
        "description": "Undoes Archive Conversation action, and unpins the conversation from the top of the conversation list"
    },
    "pinnedConversationsFull": {
        "message": "आप केवल 4 तक चैट को पिन कर सकते हैं",
        "description": ""
    },
    "chooseDirectory": {
        "message": "फोल्डर को चुनो",
        "description": "Button to allow the user to find a folder on disk"
    },
    "chooseFile": {
        "message": "फ़ाइल चुनें",
        "description": "Button to allow the user to find a file on disk"
    },
    "loadDataHeader": {
        "message": "अपना डाटा लोड करें",
        "description": "Header shown on the first screen in the data import process"
    },
    "loadDataDescription": {
        "message": "आप अभी निर्यात की प्रक्रिया से गुज़रें हैं और आपके संपर्क तथा मेसेज आपके कंप्यूटर में आपका इंतेज़ार कर रहे हैं। वह फोलडर चुनें जिसमें आपका Signal डाटा है।",
        "description": "Introduction to the process of importing messages and contacts from disk"
    },
    "importChooserTitle": {
        "message": "डेटा के लिए लक्ष्य निर्देशिका चुनें",
        "description": "Title of the popup window used to select data previously exported"
    },
    "importErrorHeader": {
        "message": "कुछ गलत हो गया",
        "description": "Header of the error screen after a failed import"
    },
    "importingHeader": {
        "message": "संपर्क और मेसेज लोड हो रहे हैं",
        "description": "Header of screen shown as data is import"
    },
    "importErrorFirst": {
        "message": "ध्यान रखें कि आपने सही डायरेक्ट्री चुनी है जिसमें आपका Signal डाटा है। उसका नाम 'Signal Export' से शुरु होना चाहिये। आप अपने डाटा की नयी कॉपी क्रोम ऐप से भी सहेज सकते हैं।",
        "description": "Message shown if the import went wrong; first paragraph"
    },
    "importErrorSecond": {
        "message": "अगर यह निर्देश आपके लिए काम नहीं कर रहे, तो कृपया डीबग लॉग ( व्यू -> डीबग लॉग) जमा करें ताकी हम विस्थापन में आपकी सहायता कर सकें।",
        "description": "Message shown if the import went wrong; second paragraph"
    },
    "importAgain": {
        "message": "फ़ोल्डर का चयन करें और पुनः प्रयास करें",
        "description": "Button shown if the user runs into an error during import, allowing them to start over"
    },
    "importCompleteHeader": {
        "message": "सफलता",
        "description": "Header shown on the screen at the end of a successful import process"
    },
    "importCompleteStartButton": {
        "message": "Signal Desktop इस्तेमाल करना शुुरु करें",
        "description": "Button shown at end of successful import process, nothing left but a restart"
    },
    "importCompleteLinkButton": {
        "message": "इस डिवाइस को अपने फ़ोन से लिंक करें",
        "description": "Button shown at end of successful 'light' import process, so the standard linking process still needs to happen"
    },
    "selectedLocation": {
        "message": "आपके चयनित स्थान",
        "description": "Message shown as the export location if we didn't capture the target directory"
    },
    "upgradingDatabase": {
        "message": "डेटाबेस को अपग्रेड में कुछ समय लग सकता है...",
        "description": "Message shown on the loading screen when we're changing database structure on first run of a new version"
    },
    "loadingMessages": {
        "message": "मेसेजों को लोड कर रहे हैं| $count$अब तक...",
        "description": "Message shown on the loading screen when we're catching up on the backlog of messages",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "view": {
        "message": "राय",
        "description": "Used as a label on a button allowing user to see more information"
    },
    "youLeftTheGroup": {
        "message": "आप अब ग्रुप के मेंबर नहीं हैं।",
        "description": "Displayed when a user can't send a message because they have left the group"
    },
    "invalidConversation": {
        "message": "यह ग्रुप अवैध है। कृपया एक नया ग्रुप बनाएँ।",
        "description": "Displayed when a user can't send a message because something has gone wrong in the conversation."
    },
    "scrollDown": {
        "message": "संवाद के नीचे स्क्रॉल करें",
        "description": "Alt text for button to take user down to bottom of conversation, shown when user scrolls up"
    },
    "messagesBelow": {
        "message": "नीचे नया मेसेज",
        "description": "Alt text for button to take user down to bottom of conversation with more than one message out of screen"
    },
    "unreadMessage": {
        "message": "1 अपठित मेसेज",
        "description": "Text for unread message separator, just one message"
    },
    "unreadMessages": {
        "message": "$count$ अपठित मेसेज",
        "description": "Text for unread message separator, with count",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "messageHistoryUnsynced": {
        "message": "आपकी सुरक्षा के लिए, संवाद की हिस्ट्री को लिंक किए हुए नए डिवाइसेस में ट्रांसफर नहीं किया गया है।",
        "description": "Shown in the conversation history when a user links a new device to explain what is not supported."
    },
    "youMarkedAsVerified": {
        "message": "आपने $name$ के साथ अपने सुरक्षा नंबर को सत्यापित मार्क किया है",
        "description": "Shown in the conversation history when the user marks a contact as verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerified": {
        "message": "आपने $name$ के साथ अपने सुरक्षा नंबर को असत्यापित मार्क किया है",
        "description": "Shown in the conversation history when the user marks a contact as not verified, whether on the Safety Number screen or by dismissing a banner or dialog.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsVerifiedOtherDevice": {
        "message": "आपने $name$ के साथ अपने सुरक्षा नंबर को दूसरे डिवाइस से सत्यापित मार्क किया है",
        "description": "Shown in the conversation history when we discover that the user marked a contact as verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerifiedOtherDevice": {
        "message": "आपने $name$ के साथ अपने सुरक्षा नंबर को दूसरे डिवाइस से असत्यापित मार्क किया है",
        "description": "Shown in the conversation history when we discover that the user marked a contact as not verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "membersNeedingVerification": {
        "message": "आपके द्वारा अंतिम सत्यापित होने के बाद से इन समूह सदस्यों के साथ आपके सुरक्षा नंबर बदले गए हैं। उनके साथ अपने नए सुरक्षा नंबर देखने के लिए किसी समूह के सदस्य पर क्लिक करें।",
        "description": "When there are multiple previously-verified group members with safety number changes, a banner will be shown. The list of contacts with safety number changes is shown, and this text introduces that list."
    },
    "changedRightAfterVerify": {
        "message": "आप जिस सुरक्षा नंबर को वेरिफाई करने की कोशिश कर रहे हैं, वह बदल गया है। कृपया $name1$ के साथ अपने नए सुरक्षा नंबर की समीक्षा करें। याद रखें, इस बदलाव का मतलब हो सकता है कि कोई आपके संवाद को रोकने का प्रयास कर रहा है या बस $name2$ ने Signal को री-इंस्टॉल किया है।",
        "description": "Shown on the safety number screen when the user has selected to verify/unverify a contact's safety number, and we immediately discover a safety number change",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "Bob"
            },
            "name2": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "changedVerificationWarning": {
        "message": "हो सकता है कि निम्नलिखित लोगों ने रीइंस्टॉल किया हो या डिवाइसेस को बदल लिया हो। गोपनीयता को सुनिश्चित करने के लिए उनके साथ अपने सुरक्षा नंबर को वेरिफाई करें।",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "identityKeyErrorOnSend": {
        "message": "$name1$ के साथ आपका सुरक्षा नंबर बदल गया है। इसका मतलब या तो यह हो सकता है कि कोई आपके संवाद को रोकने का प्रयास कर रहा है या बस $name2$ ने Signal को री-इंस्टॉल किया है। आप इस संपर्क के साथ अपने सुरक्षा नंबर को वेरिफाई करना चाह सकता हैं।",
        "description": "Shown when user clicks on a failed recipient in the message detail view after an identity key change",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "Bob"
            },
            "name2": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "sendAnyway": {
        "message": "वैसे भी भेजें",
        "description": "Used on a warning dialog to make it clear that it might be risky to send the message."
    },
    "callAnyway": {
        "message": "फिर भी कॉल करें",
        "description": "Used on a warning dialog to make it clear that it might be risky to call the conversation."
    },
    "continueCall": {
        "message": "कॉल जारी रखें",
        "description": "Used on a warning dialog to make it clear that it might be risky to continue the group call."
    },
    "noLongerVerified": {
        "message": "आपकी सुरक्षा नंबर के साथ$name$बदल गया है और अब सत्यापित नहीं है। दिखने के लिए क्लिक करें।",
        "description": "Shown in conversation banner when user's safety number has changed, but they were previously verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleNoLongerVerified": {
        "message": "इस समूह के कई सदस्यों के साथ आपकी सुरक्षा संख्या बदल गई हैं और अब सत्यापित नहीं हैं। दिखने के लिए क्लिक करें।",
        "description": "Shown in conversation banner when more than one group member's safety number has changed, but they were previously verified."
    },
    "debugLogExplanation": {
        "message": "यह लेख ऑनलाइन भेजा जाएगा अन्या सहयोगियो के जाँच पड़ताल के लिए| भेजने से पहेले ठीक से जांच कर ले|",
        "description": ""
    },
    "debugLogError": {
        "message": "अपलोड के साथ कुछ गलती हुई है। कृपया बग फ़ाइल में अपना लॉग खुद डालने पर विचार करें।",
        "description": ""
    },
    "debugLogCopy": {
        "message": "कॉपी",
        "description": "Shown as the text for the copy button on the debug log screen"
    },
    "debugLogCopyAlt": {
        "message": "अपने क्लिपबोर्ड में लिंक को कॉपी करें",
        "description": "Shown as the alt text for the copy button on the debug log screen"
    },
    "debugLogLinkCopied": {
        "message": "लिंक आपके क्लिपबोर्ड में कॉपी किया गया",
        "description": "Shown in a toast to let the user know that the link to the debug log has been copied to their clipboard"
    },
    "reportIssue": {
        "message": "मामले की रिपोर्ट करें",
        "description": "Link to open the issue tracker"
    },
    "gotIt": {
        "message": "समझ गया!",
        "description": "Label for a button that dismisses a dialog. The user clicks it to confirm that they understand the message in the dialog."
    },
    "submit": {
        "message": "जमा करें",
        "description": ""
    },
    "acceptNewKey": {
        "message": "स्वीकार करें",
        "description": "Label for a button to accept a new safety number"
    },
    "verify": {
        "message": "साटिपिट होने का मार्क कीजीये",
        "description": ""
    },
    "unverify": {
        "message": "सत्यापित नहीं के रूप में मार्क करें",
        "description": ""
    },
    "isVerified": {
        "message": "आपने अपनी सुरक्षा संख्या को इसके साथ सत्यापित किया $name$",
        "description": "Summary state shown at top of the safety number screen if user has verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "isNotVerified": {
        "message": "आपने अपनी सुरक्षा संख्या को इसके साथ सत्यापित नहीं किया $name$है",
        "description": "Summary state shown at top of the safety number screen if user has not verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "verified": {
        "message": "सत्यापित",
        "description": ""
    },
    "newIdentity": {
        "message": "नया सुरक्षा नंबर",
        "description": "Header for a key change dialog"
    },
    "identityChanged": {
        "message": "इस संपर्क के साथ आपकी सुरक्षा संख्या बदल गई है इसका मतलब यह हो सकता है कि कोई आपके संचार को अवरुद्ध करने का प्रयास कर रहा है, या इस संपर्क को केवल Signal को पुनः स्थापित किया गया है आप नीचे नई सुरक्षा संख्या को सत्यापित करना चाह सकते हैं।",
        "description": ""
    },
    "incomingError": {
        "message": "आने वाले मेसेज को संभालने में त्रुटि",
        "description": ""
    },
    "media": {
        "message": "मीडिया",
        "description": "Header of the default pane in the media gallery, showing images and videos"
    },
    "mediaEmptyState": {
        "message": "आपके पास इस वार्तालाप में कोई मीडिया नहीं है।",
        "description": "Message shown to user in the media gallery when there are no messages with media attachments (images or video)"
    },
    "allMedia": {
        "message": "सभी मीडिया",
        "description": "Header for the media gallery"
    },
    "documents": {
        "message": "डॉक्युमेंट्स",
        "description": "Header of the secondary pane in the media gallery, showing every non-media attachment"
    },
    "documentsEmptyState": {
        "message": "आपके पास इस वार्तालाप में कोई  डॉक्युमेंट्स नहीं है।",
        "description": "Message shown to user in the media gallery when there are no messages with document attachments (anything other than images or video)"
    },
    "today": {
        "message": "आज",
        "description": "Section header in the media gallery"
    },
    "yesterday": {
        "message": "कल",
        "description": "Section header in the media gallery"
    },
    "thisWeek": {
        "message": "इस हफ़ते",
        "description": "Section header in the media gallery"
    },
    "thisMonth": {
        "message": "इस महीने",
        "description": "Section header in the media gallery"
    },
    "unsupportedAttachment": {
        "message": "असमर्थित अनुलग्नक प्रकार सहेजने के लिए क्लिक करें",
        "description": "Displayed for incoming unsupported attachment"
    },
    "clickToSave": {
        "message": "सेव करने के लिए क्लिक करें",
        "description": "Hover text for attachment filenames"
    },
    "unnamedFile": {
        "message": "अनाम फ़ाइल",
        "description": "Hover text for attachment filenames"
    },
    "voiceMessage": {
        "message": "ऑडियो मेसेज",
        "description": "Name for a voice message attachment"
    },
    "dangerousFileType": {
        "message": "इस प्रकार के अटैचमेंट की सुरक्षा कारणों से अनुमति नहीं है",
        "description": "Shown in toast when user attempts to send .exe file, for example"
    },
    "loadingPreview": {
        "message": "पूर्वावलोकन लोड हो रहा है...",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area"
    },
    "stagedPreviewThumbnail": {
        "message": "$domain$ के लिये ड्राफ्ट थंबनेल लिंक पूर्वावलोकन",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "previewThumbnail": {
        "message": "$domain$ के लिये थंबनेल लिंक पूर्वावलोकन",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "stagedImageAttachment": {
        "message": "ड्राफ्ट तस्वीर अटैचमेंट: $path$",
        "description": "Alt text for staged attachments",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "dog.jpg"
            }
        }
    },
    "oneNonImageAtATimeToast": {
        "message": "तस्वीर से अलग सारे अटैचमेंट के लिये सीमा, एक मेसेज में एक अटैचमेंट है।",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "cannotMixImageAndNonImageAttachments": {
        "message": "आप तस्वीर और अन्य अटैचमेंट एक ही मेसेज में नहीं रख सकते।",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "maximumAttachments": {
        "message": "आप इस मेसेज में और अटैचमेंट का इस्तेमाल नहीं कर सकते",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "fileSizeWarning": {
        "message": "क्षमा करें, चयनित दस्तावेज का मेसेज माप प्रतिबंध से अधिक है।",
        "description": ""
    },
    "unableToLoadAttachment": {
        "message": "चुना हुआ अटैचमेंट लोड नहीं हो रहा।",
        "description": ""
    },
    "disconnected": {
        "message": "डिस्कनेक्ट किया गया",
        "description": "Displayed when the desktop client cannot connect to the server."
    },
    "connecting": {
        "message": "कनेक्टिंग",
        "description": "Displayed when the desktop client is currently connecting to the server."
    },
    "connect": {
        "message": "कनेक्ट करें",
        "description": "Shown to allow the user to manually attempt a reconnect."
    },
    "connectingHangOn": {
        "message": "ज़यादा समय नहीं लगेगा...",
        "description": "Subtext description for when the client is connecting to the server."
    },
    "offline": {
        "message": "ऑफ़लाइन",
        "description": "Displayed when the desktop client has no network connection."
    },
    "checkNetworkConnection": {
        "message": "अपने नेटवर्क कनेक्शन की जांच करें।",
        "description": "Obvious instructions for when a user's computer loses its network connection"
    },
    "submitDebugLog": {
        "message": "डीबग लॉग",
        "description": "Menu item and header text for debug log modal (sentence case)"
    },
    "debugLog": {
        "message": "लॉग को डीबग करें",
        "description": "View menu item to open the debug log (title case)"
    },
    "helpMenuShowKeyboardShortcuts": {
        "message": "कीबोर्ड के शॉर्टकट दिखाएं",
        "description": "Item under the help menu, pops up a screen showing the application's keyboard shortcuts"
    },
    "contactUs": {
        "message": "हमसे संपर्क करें",
        "description": "Item under the help menu, takes you to the contact us support page"
    },
    "goToReleaseNotes": {
        "message": "रिलीज़ नोट्स पर जाएँ",
        "description": "Item under the help menu, takes you to GitHub page for release notes"
    },
    "goToForums": {
        "message": "फ़ोरम पर जाएँ",
        "description": "Item under the Help menu, takes you to the forums"
    },
    "goToSupportPage": {
        "message": "समर्थन पेज पर जाएँ",
        "description": "Item under the Help menu, takes you to the support page"
    },
    "joinTheBeta": {
        "message": "बीटा के साथ जुड़ें",
        "description": "Item under the Help menu, takes you to an article describing how to install the beta release of Signal Desktop"
    },
    "signalDesktopPreferences": {
        "message": "Signal Desktop पसंदगी",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "signalDesktopStickerCreator": {
        "message": "स्टिकर पैक निर्माता",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "aboutSignalDesktop": {
        "message": "Signal डेस्कटॉप के बारे में",
        "description": "Item under the Help menu, which opens a small about window"
    },
    "screenShareWindow": {
        "message": "Sharing screen",
        "description": "Title for screen sharing window"
    },
    "speech": {
        "message": "भाषण",
        "description": "Item under the Edit menu, with 'start/stop speaking' items below it"
    },
    "show": {
        "message": "दिखाना",
        "description": "Command under Window menu, to show the window"
    },
    "hide": {
        "message": "छुपा दें",
        "description": "Command in the tray icon menu, to hide the window"
    },
    "quit": {
        "message": "बंद करें",
        "description": "Command in the tray icon menu, to quit the application"
    },
    "signalDesktop": {
        "message": "Signal Desktop",
        "description": "Tooltip for the tray icon"
    },
    "search": {
        "message": "सर्च",
        "description": "Placeholder text in the search input"
    },
    "clearSearch": {
        "message": "सर्च को साफ करें",
        "description": "Aria label for clear search button"
    },
    "searchIn": {
        "message": "$conversationName$ में खोजें",
        "description": "Shown in the search box before text is entered when searching in a specific conversation",
        "placeholders": {
            "conversationName": {
                "content": "$1",
                "example": "Friends"
            }
        }
    },
    "noSearchResults": {
        "message": "\"$searchTerm$\" के लिये कोई परिणाम नहीं मिले",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            }
        }
    },
    "noSearchResults--sms-only": {
        "message": "SMS/MMS contacts are not available on Desktop.",
        "description": "Shown in the search left pane when no results were found and primary device has SMS/MMS handling enabled"
    },
    "noSearchResultsInConversation": {
        "message": "$conversationName$ में \"$searchTerm$\" के कोई परिणाम नहीं मिले",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            },
            "conversationName": {
                "content": "$2",
                "example": "Friends"
            }
        }
    },
    "conversationsHeader": {
        "message": "संवाद",
        "description": "Shown to separate the types of search results"
    },
    "contactsHeader": {
        "message": "संपर्क",
        "description": "Shown to separate the types of search results"
    },
    "groupsHeader": {
        "message": "ग्रुप ",
        "description": "Shown to separate the types of search results"
    },
    "messagesHeader": {
        "message": "मेसेज",
        "description": "Shown to separate the types of search results"
    },
    "welcomeToSignal": {
        "message": "Signal में आपका स्वागत है ",
        "description": ""
    },
    "selectAContact": {
        "message": "चेटिंग की शुरुआत करने के लिए कॉंटॅक्ट या ग्रूप चुने ",
        "description": ""
    },
    "typingAlt": {
        "message": "इस वार्तालाप के लिये टाइपिंग एनीमेशन",
        "description": "Used as the 'title' attribute for the typing animation"
    },
    "contactInAddressBook": {
        "message": "यह व्यक्ति आपके संपर्क में है।",
        "description": "Description of icon denoting that contact is from your address book"
    },
    "contactAvatarAlt": {
        "message": "$name$ संपर्क के लिये अवतार",
        "description": "Used in the alt tag for the image avatar of a contact",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "sendMessageToContact": {
        "message": "मेसेज भेजें",
        "description": "Shown when you are sent a contact and that contact has a signal account"
    },
    "home": {
        "message": "घर",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "work": {
        "message": "दफ़तर",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "mobile": {
        "message": "मोबाइल",
        "description": "Shown on contact detail screen as a label for aa phone or email"
    },
    "email": {
        "message": "ई-मेल",
        "description": "Generic label shown if contact email has custom type but no label"
    },
    "phone": {
        "message": "फ़ोन",
        "description": "Generic label shown if contact phone has custom type but no label"
    },
    "address": {
        "message": "पता",
        "description": "Generic label shown if contact address has custom type but no label"
    },
    "poBox": {
        "message": "पी.ओ. बॉक्स",
        "description": "When rendering an address, used to provide context to a post office box"
    },
    "downloading": {
        "message": "डाउनलोड कर रहा हैं",
        "description": "Shown in the message bubble while a long message attachment is being downloaded"
    },
    "downloadAttachment": {
        "message": "अटैचमेंट डाउनलोड करें",
        "description": "Shown in a message's triple-dot menu if there isn't room for a dedicated download button"
    },
    "reactToMessage": {
        "message": "मेसेज पर प्रतिक्रिया दें",
        "description": "Shown in triple-dot menu next to message to allow user to react to the associated message"
    },
    "replyToMessage": {
        "message": "मेसेज का जवाब दें",
        "description": "Shown in triple-dot menu next to message to allow user to start crafting a message with a quotation"
    },
    "originalMessageNotFound": {
        "message": "मूल मेसेज नहीं मिला",
        "description": "Shown in quote if reference message was not found as message was initially downloaded and processed"
    },
    "originalMessageNotAvailable": {
        "message": "मूल मेसेज अब उपलब्ध नहीं है",
        "description": "Shown in toast if user clicks on quote that references message no longer in database"
    },
    "messageFoundButNotLoaded": {
        "message": "मूल मेसेज मिल गया पर लोड नहीं हुआ। लोड करने के लिये ऊपर स्क्रोल करें।",
        "description": "Shown in toast if user clicks on quote references messages not loaded in view, but in database"
    },
    "voiceRecordingInterruptedMax": {
        "message": "ऑडियो मेसेज की रिकॉर्डिंग बंद हो गई क्योंकि अधिकतम समय सीमा पूरी हो गई थी।",
        "description": "Confirmation dialog message for when the voice recording is interrupted due to max time limit"
    },
    "voiceRecordingInterruptedBlur": {
        "message": "ऑडियो मेसेज रिकॉर्डिंग बंद हो गई क्योंकि आप किसी अन्य ऐप पर चले गए।",
        "description": "Confirmation dialog message for when the voice recording is interrupted due to app losing focus"
    },
    "voiceNoteLimit": {
        "message": "ऑडियो मेसेज पाँच मिनट तक सीमित है। अगर आप किसी अन्य ऐप पर चले जाते हैं तो रिकॉर्डिंग बंद हो जाएगी।",
        "description": "Shown in toast to warn user about limited time and that window must be in focus"
    },
    "voiceNoteMustBeOnlyAttachment": {
        "message": "एक वॉयस मेसेज में एक ही अटैचमेंट हो सकता है।",
        "description": "Shown in toast if tries to record a voice note with any staged attachments"
    },
    "attachmentSaved": {
        "message": "अटैचमेंट सेव हुई। फोल्डर में दिखाने के लिए क्लिक करें।",
        "description": "Shown after user selects to save to downloads",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "proof.jpg"
            }
        }
    },
    "you": {
        "message": "आप",
        "description": "Shown when the user represented is the current user."
    },
    "replyingTo": {
        "message": "$name$ को जवाब दे रहे हैं",
        "description": "Shown in iOS theme when you or someone quotes to a message which is not from you",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "audioPermissionNeeded": {
        "message": "ऑडियो मेसेज भेजने के लिए, अपने माइक्रोफ़ोन पर Signal Desktop पहुंच की अनुमति दें।",
        "description": "Shown if the user attempts to send an audio message without audio permissions turned on"
    },
    "audioCallingPermissionNeeded": {
        "message": "कॉल करने के लिए, आपको अपने माइक्रोफोन को एक्सेस करने देने के लिए Signal Desktop को इजाज़त देनी होगी।",
        "description": "Shown if the user attempts access the microphone for calling without audio permissions turned on"
    },
    "videoCallingPermissionNeeded": {
        "message": "वीडियो कॉलिंग के लिए, आपको Signal Desktop को अपना कैमरा एक्सेस करने देने के लिए इजाज़त देनी होगी।",
        "description": "Shown if the user attempts access the camera for video calling without video permissions turned on"
    },
    "allowAccess": {
        "message": "अनुमति दें",
        "description": "Button shown in popup asking to enable microphone/video permissions to send audio messages"
    },
    "showSettings": {
        "message": "सेटिंग्स दिखाएँ",
        "description": "A button shown in dialog requesting the user to turn on audio permissions"
    },
    "audio": {
        "message": "ऑडियो",
        "description": "Shown in a quotation of a message containing an audio attachment if no text was originally provided with that attachment"
    },
    "video": {
        "message": "वीडियो",
        "description": "Shown in a quotation of a message containing a video if no text was originally provided with that video"
    },
    "photo": {
        "message": "तस्वीर",
        "description": "Shown in a quotation of a message containing a photo if no text was originally provided with that image"
    },
    "cannotUpdate": {
        "message": "अपडेट नहीं कर सकते",
        "description": "Shown as the title of our update error dialogs on windows"
    },
    "cannotUpdateDetail": {
        "message": "Signal Desktop अपडेट नहीं हो पाया, पर एक नया वर्ज़न उपलब्ध है। कृपया $url$ पर जाएँ और नया वर्ज़न डाउनलोड कर के इंस्टॉल कर लें, फिर या तो समर्थन से संपर्क करें या फिर इस परेशानी के बारे में बग फ़ाइल कर दें।",
        "description": "Shown if a general error happened while trying to install update package",
        "placeholders": {
            "url": {
                "content": "$1",
                "example": "https://signal.org/download"
            }
        }
    },
    "readOnlyVolume": {
        "message": "Signal Desktop संभव रूप से macOS क्वारंटाइन में है, और ऑटो-अपडेट होने के योग्य नहीं है। कृपया फाइंडर के साथ  को $app$से $folder$ में मूव करने का प्रयास करें।",
        "description": "Shown on MacOS if running on a read-only volume and we cannot update",
        "placeholders": {
            "app": {
                "content": "$1",
                "example": "Signal.app"
            },
            "folder": {
                "content": "$2",
                "example": "/Applications"
            }
        }
    },
    "ok": {
        "message": "ठीक",
        "description": ""
    },
    "cancel": {
        "message": "रद्द करें",
        "description": ""
    },
    "discard": {
        "message": "रद्द करें",
        "description": ""
    },
    "failedToSend": {
        "message": "कुछ प्रप्टकर्ताओ को भेजना संभव नई हो पाया. कृपया अपने इंटरनेट कनेक्षन की जाँच कीजिए ",
        "description": ""
    },
    "error": {
        "message": " त्रुटि",
        "description": ""
    },
    "messageDetail": {
        "message": "मेसेज माहिती",
        "description": ""
    },
    "delete": {
        "message": "हटाना",
        "description": ""
    },
    "accept": {
        "message": "स्वीकृत ",
        "description": ""
    },
    "on": {
        "message": "पर",
        "description": "Label for when something is turned on"
    },
    "off": {
        "message": "बंद ",
        "description": "Label for when something is turned off"
    },
    "deleteWarning": {
        "message": "This message will be deleted from this device.",
        "description": "Text shown in the confirmation dialog for deleting a message locally"
    },
    "deleteForEveryoneWarning": {
        "message": "यह मैसेज वार्तालाप में शामिल सभी के लिए मिटा दिया जाएगा यदि वे Signal के नवीनमत वर्ज़न पर हैं। वे देख सकेंगे कि आपने एक मैसेज को मिटा दिया है।",
        "description": "Text shown in the confirmation dialog for deleting a message for everyone"
    },
    "deleteThisMessage": {
        "message": "यह मेसेज हटाएं",
        "description": ""
    },
    "from": {
        "message": "द्वारा",
        "description": "Label for the sender of a message"
    },
    "to": {
        "message": "किस को",
        "description": "Label for the receiver of a message"
    },
    "toJoiner": {
        "message": "से",
        "description": "Joiner for message search results - like 'Jon' to 'Friends Group'"
    },
    "sent": {
        "message": "भेज दिया",
        "description": "Label for the time a message was sent"
    },
    "received": {
        "message": "प्राप्त किया",
        "description": "Label for the time a message was received"
    },
    "sendMessage": {
        "message": "एक मेसेज भेजें",
        "description": "Placeholder text in the message entry field"
    },
    "groupMembers": {
        "message": "समूह के सदस्य",
        "description": ""
    },
    "showMembers": {
        "message": "सदस्यों को दिखाएं",
        "description": ""
    },
    "resetSession": {
        "message": "सत्र दोबारा शुरू करे ",
        "description": "This is a menu item for resetting the session, using the imperative case, as in a command."
    },
    "showSafetyNumber": {
        "message": "सुरक्षा नंबर देखें",
        "description": ""
    },
    "viewRecentMedia": {
        "message": "हाल का मीडिया देखें",
        "description": "This is a menu item for viewing all media (images + video) in a conversation, using the imperative case, as in a command."
    },
    "verifyHelp": {
        "message": "यदि आप अपने एंड-टू-एंड एन्क्रिप्शन की सुरक्षा की पुष्टि करना चाहते हैं तो$name$ऊपर दिए गए नंबरों की संख्या उनके डिवाइस पर तुलना करें।",
        "description": "",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "theirIdentityUnknown": {
        "message": "आपने अभी तक इस संपर्क के साथ किसी भी मेसेज का आदान-प्रदान नहीं किया है। उनके साथ आपका सुरक्षा नंबर पहले मेसेज के बाद उपलब्ध होगा।",
        "description": ""
    },
    "back": {
        "message": "पीछे जाएं",
        "description": "Generic label for back"
    },
    "goBack": {
        "message": "पीछे जाएँ",
        "description": "Label for back button in a conversation"
    },
    "moreInfo": {
        "message": "औेर जानकारी",
        "description": "Shown on the drop-down menu for an individual message, takes you to message detail screen"
    },
    "retrySend": {
        "message": "फिर से भेजने की कोशिश करें",
        "description": "Shown on the drop-down menu for an individual message, but only if it is an outgoing message that failed to send"
    },
    "forwardMessage": {
        "message": "फॉर्वर्ड मेसेज",
        "description": "Shown on the drop-down menu for an individual message, forwards a message"
    },
    "deleteMessage": {
        "message": "मेरे लिए मेसेज मिटाएँ",
        "description": "Shown on the drop-down menu for an individual message, deletes single message"
    },
    "deleteMessageForEveryone": {
        "message": "सभी के लिए मेसेज मिटाएँ",
        "description": "Shown on the drop-down menu for an individual message, deletes single message for everyone"
    },
    "deleteMessages": {
        "message": "हटाए ",
        "description": "Menu item for deleting messages, title case."
    },
    "deleteConversationConfirmation": {
        "message": "इस वार्तालाप को स्थायी रूप से हटाएं?",
        "description": "Confirmation dialog text that asks the user if they really wish to delete the conversation. Answer buttons use the strings 'ok' and 'cancel'. The deletion is permanent, i.e. it cannot be undone."
    },
    "sessionEnded": {
        "message": "सुरक्षित सत्र पुनः स्थापित करे ",
        "description": "This is a past tense, informational message. In other words, your secure session has been reset."
    },
    "ChatRefresh--notification": {
        "message": "चैट सेशन रीफ्रेश हुआ",
        "description": "Shown in timeline when a error happened, and the session was automatically reset."
    },
    "ChatRefresh--learnMore": {
        "message": "और जानें",
        "description": "Shown in timeline when session is automatically reset, to provide access to a popup info dialog"
    },
    "ChatRefresh--summary": {
        "message": "Signal एंड-टू-एंड एंक्रिप्शन का इस्तेमाल करता है और इसे कभी-कभी आपके चैट सेशन को रीफ़्रेश करने की ज़रूरत हो सकती है। इससे आपकी चैट की सुरक्षा प्रभावित नहीं होती है लेकिन हो सकता है कि इस संपर्क से कोई संदेश छूट गया हो और आप उन्हें उसे दोबारा भेजने के लिए कह सकते हैं।",
        "description": "Shown on explainer dialog available from chat session refreshed timeline events"
    },
    "ChatRefresh--contactSupport": {
        "message": "समर्थन से संपर्क करें",
        "description": "Shown on explainer dialog available from chat session refreshed timeline events"
    },
    "DeliveryIssue--preview": {
        "message": "Delivery issue",
        "description": "Shown in left pane preview when message delivery issue happens"
    },
    "DeliveryIssue--notification": {
        "message": "A message from $sender$ couldn’t be delivered",
        "description": "Shown in timeline when message delivery issue happens",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "DeliveryIssue--learnMore": {
        "message": "और जानें",
        "description": "Shown in timeline when message delivery issue happens, to provide access to a popup info dialog"
    },
    "DeliveryIssue--title": {
        "message": "Delivery Issue",
        "description": "Shown on explainer dialog available from delivery issue timeline events"
    },
    "DeliveryIssue--summary": {
        "message": "A message, sticker, reaction, read receipt or media couldn’t be delivered to you from $sender$. They may have tried sending it to you directly, or in a group.",
        "description": "Shown on explainer dialog available from delivery issue timeline events",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "quoteThumbnailAlt": {
        "message": "कोटेड मेसेज में से तस्वीर का थंबनेल",
        "description": "Used in alt tag of thumbnail images inside of an embedded message quote"
    },
    "imageAttachmentAlt": {
        "message": "मेसेज के साथ तस्वीर",
        "description": "Used in alt tag of image attachment"
    },
    "videoAttachmentAlt": {
        "message": "मेसेज के साथ अटैच वीडियो का सक्रीनशौट",
        "description": "Used in alt tag of video attachment preview"
    },
    "lightboxImageAlt": {
        "message": "वार्तालाप में भेजी हुई तस्वीर",
        "description": "Used in the alt tag for the image shown in a full-screen lightbox view"
    },
    "imageCaptionIconAlt": {
        "message": "आइकॅन यह दिखा रहा है कि तस्वीर में कैप्शन है",
        "description": "Used for the icon layered on top of an image in message bubbles"
    },
    "addACaption": {
        "message": "इसके बारे में कुछ लिखें...",
        "description": "Used as the placeholder text in the caption editor text field"
    },
    "save": {
        "message": "संरक्षित करें",
        "description": "Used as a 'commit changes' button in the Caption Editor for outgoing image attachments"
    },
    "fileIconAlt": {
        "message": "फ़ाइल आइकॅन",
        "description": "Used in the media gallery documents tab to visually represent a file"
    },
    "installWelcome": {
        "message": "Signal डेस्कटॉप में आपका स्वागत है",
        "description": "Welcome title on the install page"
    },
    "installTagline": {
        "message": "गोपनीयता संभव है. Signal उसे आसान बनता है",
        "description": "Tagline displayed under 'installWelcome' string on the install page"
    },
    "linkYourPhone": {
        "message": "Signal Desktop से अपना फ़ोन लिंक करें",
        "description": "Shown on the front page when the application first starts, above the QR code"
    },
    "signalSettings": {
        "message": "Signal सेटिंग्स",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "linkedDevices": {
        "message": "लिंक की गईं डिवाइसें",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "plusButton": {
        "message": "'+' बटन",
        "description": "The button used in Signal Android to add a new linked device"
    },
    "linkNewDevice": {
        "message": "नया डिवाइस लिंक करें",
        "description": "The menu option shown in Signal iOS to add a new linked device"
    },
    "deviceName": {
        "message": "डिवाइस का नाम",
        "description": "The label in settings panel shown for the user-provided name for this desktop instance"
    },
    "chooseDeviceName": {
        "message": "डिवाइस का नाम चुनें",
        "description": "The header shown on the 'choose device name' screen in the device linking process"
    },
    "finishLinkingPhone": {
        "message": "फ़ोन लिंक करना पूरा करें",
        "description": "The text on the button to finish the linking process, after choosing the device name"
    },
    "initialSync": {
        "message": "संपर्क और समूह सिंक हो रहे हैं",
        "description": "Shown during initial link while contacts and groups are being pulled from mobile device"
    },
    "installConnectionFailed": {
        "message": "सर्वर से कनेक्ट करने में विफल",
        "description": "Displayed when we can't connect to the server."
    },
    "installTooManyDevices": {
        "message": "क्षमा करें, आपके पास बहुत से डिवाइस पहले ही लिंक किए गए हैं कुछ को निकालने का प्रयास करें",
        "description": ""
    },
    "installTooOld": {
        "message": "अपना फोन लिंक करने के लिए इस डिवाइस पर Signal को अपडेट करें।",
        "description": ""
    },
    "installErrorHeader": {
        "message": "कुछ गलत हो गया",
        "description": ""
    },
    "installTryAgain": {
        "message": "फिर से कोशिश करो",
        "description": ""
    },
    "theme": {
        "message": "विषय",
        "description": "Header for theme settings"
    },
    "calling": {
        "message": "कॉल की जा रही है",
        "description": "Header for calling options on the settings screen"
    },
    "calling__start": {
        "message": "कॉल शुरू करें",
        "description": "Button label in the call lobby for starting a call"
    },
    "calling__join": {
        "message": "कॉल से जुड़ें",
        "description": "Button label in the call lobby for joining a call"
    },
    "calling__return": {
        "message": "कॉल पर वापस जाएँ",
        "description": "Button label in the call lobby for returning to a call"
    },
    "calling__call-is-full": {
        "message": "कॉल पूर्ण है",
        "description": "Button label in the call lobby when you can't join because the call is full"
    },
    "calling__button--video-disabled": {
        "message": "कैमरा डिसेबल किया गया",
        "description": "Button tooltip label when the camera is disabled"
    },
    "calling__button--video-off": {
        "message": "कैमरा बंद करें",
        "description": "Button tooltip label for turning off the camera"
    },
    "calling__button--video-on": {
        "message": "कैमरा चालू करें",
        "description": "Button tooltip label for turning on the camera"
    },
    "calling__button--audio-disabled": {
        "message": "माइक्रोफोन डिसेबल किया गया",
        "description": "Button tooltip label when the microphone is disabled"
    },
    "calling__button--audio-off": {
        "message": "माइक को म्यूट करें",
        "description": "Button tooltip label for turning off the microphone"
    },
    "calling__button--audio-on": {
        "message": "माइक को अनम्यूट करें",
        "description": "Button tooltip label for turning on the microphone"
    },
    "calling__button--presenting-disabled": {
        "message": "Presenting disabled",
        "description": "Button tooltip label for when screen sharing is disabled"
    },
    "calling__button--presenting-on": {
        "message": "Start presenting",
        "description": "Button tooltip label for starting to share screen"
    },
    "calling__button--presenting-off": {
        "message": "Stop presenting",
        "description": "Button tooltip label for stopping screen sharing"
    },
    "calling__your-video-is-off": {
        "message": "आपका कैमरा बंद है",
        "description": "Label in the calling lobby indicating that your camera is off"
    },
    "calling__lobby-summary--zero": {
        "message": "यहाँ और कोई नहीं है",
        "description": "Shown in the calling lobby to describe who is in the call"
    },
    "calling__lobby-summary--single": {
        "message": "$first$ इस कॉल में है",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            }
        }
    },
    "calling__lobby-summary--self": {
        "message": "आपका कोई दूसरा डिवाइस इस कॉल में है",
        "description": "Shown in the calling lobby to describe when it is just you"
    },
    "calling__lobby-summary--double": {
        "message": "$first$ और $second$ इस कॉल में हैं",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            }
        }
    },
    "calling__lobby-summary--triple": {
        "message": "$first$, $second$, और $third$ इस कॉल में हैं",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            },
            "third": {
                "content": "$3",
                "example": "April"
            }
        }
    },
    "calling__lobby-summary--many": {
        "message": "$first$, $second$, और $others$ अन्य लोग इस कॉल में हैं",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            },
            "others": {
                "content": "$3",
                "example": "5"
            }
        }
    },
    "calling__in-this-call--zero": {
        "message": "यहाँ और कोई नहीं है",
        "description": "Shown in the participants list to describe how many people are in the call"
    },
    "calling__in-this-call--one": {
        "message": "इस कॉल में ·  1 व्यक्ति",
        "description": "Shown in the participants list to describe how many people are in the call"
    },
    "calling__in-this-call--many": {
        "message": "इस कॉल में · $people$ लोग",
        "description": "Shown in the participants list to describe how many people are in the call",
        "placeholders": {
            "people": {
                "content": "$1",
                "example": "15"
            }
        }
    },
    "calling__you-have-blocked": {
        "message": "आपने $name$ को ब्लॉक कर दिया है",
        "description": "when you block someone and cannot view their video",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Henry Richard"
            }
        }
    },
    "calling__block-info": {
        "message": "आपको उनके ऑडियो या वीडियो प्राप्त नहीं होंगे और उन्हें आपके नहीं।",
        "description": "Shown in the modal dialog to describe how blocking works in a gorup call"
    },
    "calling__overflow__scroll-up": {
        "message": "Scroll up",
        "description": "Label for the \"scroll up\" button in a call's overflow area"
    },
    "calling__overflow__scroll-down": {
        "message": "Scroll down",
        "description": "Label for the \"scroll down\" button in a call's overflow area"
    },
    "calling__presenting--notification-title": {
        "message": "You're presenting to everyone.",
        "description": "Title for the share screen notification"
    },
    "calling__presenting--notification-body": {
        "message": "Click here to return to the call when you're ready to stop presenting.",
        "description": "Body text for the share screen notification"
    },
    "calling__presenting--info": {
        "message": "Signal is sharing $window$.",
        "description": "Text that appears in the screen sharing controller to inform person that they are presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Application"
            }
        }
    },
    "calling__presenting--stop": {
        "message": "Stop sharing",
        "description": "Button for stopping screen sharing"
    },
    "calling__presenting--you-stopped": {
        "message": "You stopped presenting",
        "description": "Toast that appears when someone stops presenting"
    },
    "calling__presenting--person-ongoing": {
        "message": "$name$ is presenting",
        "description": "Title of call when someone is presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Maddie"
            }
        }
    },
    "calling__presenting--person-stopped": {
        "message": "$name$ stopped presenting",
        "description": "Toast that appears when someone stops presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Maddie"
            }
        }
    },
    "calling__presenting--permission-title": {
        "message": "Permission needed",
        "description": "Shown as the title for the modal that requests screen recording permissions"
    },
    "calling__presenting--macos-permission-description": {
        "message": "Signal needs permission to access your computer's screen recording.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step1": {
        "message": "Go to System Preferences.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step2": {
        "message": "Click on the lock icon on the bottom left and enter your computer’s password.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step3": {
        "message": "On the right, check the box next to Signal. If you don’t see Signal in the list, click the + to add it.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-open": {
        "message": "Open System Preferences",
        "description": "The button that opens your system preferences for the needs screen record permissions modal"
    },
    "calling__presenting--permission-cancel": {
        "message": "हटाएँ",
        "description": "The cancel button for the needs screen record permissions modal"
    },
    "alwaysRelayCallsDescription": {
        "message": "हमेशा कॉल रिले करें",
        "description": "Description of the always relay calls setting"
    },
    "alwaysRelayCallsDetail": {
        "message": "अपने संपर्क में अपने IP ऐड्रेस को प्रकट करने से बचने के लिए Signal सर्वर के माध्यम से सभी कॉल रिले करें। सक्षम करने से कॉल गुणवत्ता कम हो जाएगी।",
        "description": "Details describing the always relay calls setting"
    },
    "permissions": {
        "message": "अनुमतियाँ",
        "description": "Header for permissions section of settings"
    },
    "mediaPermissionsDescription": {
        "message": "माइक्रोफोन इस्तेमाल करने की अनुमति दें",
        "description": "Description of the media permission description"
    },
    "mediaCameraPermissionsDescription": {
        "message": "कैमरा का इस्तेमाल करने की अनुमति दें",
        "description": "Description of the media permission description"
    },
    "general": {
        "message": "सामान्य",
        "description": "Header for general options on the settings screen"
    },
    "spellCheckDescription": {
        "message": "Enable spell check",
        "description": "Description of the spell check setting"
    },
    "spellCheckWillBeEnabled": {
        "message": "स्पेल चेक अगली बार Signal के शुरू होने पर एनेबल किया जाएगा।",
        "description": "Shown when the user enables spellcheck to indicate that they must restart Signal."
    },
    "spellCheckWillBeDisabled": {
        "message": "स्पेल चेक अगली बार Signal के शुरू होने पर डिसेबल किया जाएगा।",
        "description": "Shown when the user disables spellcheck to indicate that they must restart Signal."
    },
    "autoLaunchDescription": {
        "message": "Open at computer login",
        "description": "Description for the automatic launch setting"
    },
    "clearDataHeader": {
        "message": "डाटा हटाएँ",
        "description": "Header in the settings dialog for the section dealing with data deletion"
    },
    "clearDataExplanation": {
        "message": "यह आपके एप्लिकेशन से सारा डाटा, मेसेज और ख़ाते की जानकारी सहित हटा देगा।",
        "description": "Text describing what the clear data button will do."
    },
    "clearDataButton": {
        "message": "डाटा हटाएँ",
        "description": "Button in the settings dialog starting process to delete all data"
    },
    "deleteAllDataHeader": {
        "message": "सारा डाटा हटा दें?",
        "description": "Header of the full-screen delete data confirmation screen"
    },
    "deleteAllDataBody": {
        "message": "आप इस एप्लिकेशन के सारे खाते की जानकारी, संपर्क और मेसेज सहित हटाने जा रहे हैं। आप अपना मोबाइल डिवाइस फिर से लिंक कर सकते हैं पर उससे हटे हुए मेसेज वापस नहीं आएँगे।",
        "description": "Text describing what exactly will happen if the user clicks the button to delete all data"
    },
    "deleteAllDataButton": {
        "message": "सारा डाटा हटा दें",
        "description": "Text of the button that deletes all data"
    },
    "deleteAllDataProgress": {
        "message": "डिस्कनेक्ट हो रहा है और सारा डाटा हटा रहे हैं",
        "description": "Message shown to user when app is disconnected and data deleted"
    },
    "deleteOldIndexedDBData": {
        "message": "आपके पास Signal Desktop के पिछले इंस्टॉलेशन से बेकार डेटा है। अगर आप जारी रखने का चयन करते हैं, तो इसे मिटा दिया जाएगा और आप दोबारा से शुरुआत करेंगे।",
        "description": "Shown if user last ran Signal Desktop before October 2018"
    },
    "deleteOldData": {
        "message": "पुराने डेटा को मिटाएँ",
        "description": "Button to make the delete happen"
    },
    "notifications": {
        "message": "सूचनाएं",
        "description": "Header for notification settings"
    },
    "notificationSettingsDialog": {
        "message": "जब संदेश आए, सूचना दिखाए जिस्से पता चले:",
        "description": "Explain the purpose of the notification settings"
    },
    "disableNotifications": {
        "message": "सूचनाए बंद करे ",
        "description": "Label for disabling notifications"
    },
    "nameAndMessage": {
        "message": "नाम, जानकारी, और क्रियाएँ",
        "description": "Label for setting notifications to display name and message text"
    },
    "noNameOrMessage": {
        "message": "कोई नाम या जानकारी नहीं",
        "description": "Label for setting notifications to display no name and no message text"
    },
    "nameOnly": {
        "message": "केवल नाम",
        "description": "Label for setting notifications to display sender name only"
    },
    "newMessage": {
        "message": "नया मेसेज",
        "description": "Displayed in notifications for only 1 message"
    },
    "notificationSenderInGroup": {
        "message": "$group$ में $sender$",
        "description": "Displayed in notifications for messages in a group",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "group": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            }
        }
    },
    "notificationReaction": {
        "message": "$sender$ ने आपके मेसेज पर $emoji$ प्रतिक्रिया दी",
        "description": "",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "emoji": {
                "content": "$2",
                "example": "👍"
            }
        }
    },
    "notificationReactionMessage": {
        "message": "$sender$ ने $message$ पर $emoji$ प्रतिक्रिया दी",
        "description": "",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "emoji": {
                "content": "$2",
                "example": "👍"
            },
            "message": {
                "content": "$3",
                "example": "Sounds good."
            }
        }
    },
    "sendFailed": {
        "message": "भेजना असफल रहा",
        "description": "Shown on outgoing message if it fails to send"
    },
    "sendPaused": {
        "message": "Send paused",
        "description": "Shown on outgoing message if it cannot be sent immediately"
    },
    "partiallySent": {
        "message": "आंशिक रूप से भेजा गया, विवरण के लिए क्लिक करें",
        "description": "Shown on outgoing message if it is partially sent"
    },
    "showMore": {
        "message": "माहिती",
        "description": "Displays the details of a key change"
    },
    "showLess": {
        "message": "माहिती छुपाए",
        "description": "Hides the details of a key change"
    },
    "learnMore": {
        "message": "सेफ्टी नंबर की सत्यता के बारे में अधिक जानकारी प्राप्त करे ",
        "description": "Text that links to a support article on verifying safety numbers"
    },
    "expiredWarning": {
        "message": "Signal डेस्कटॉप का यह वर्ज़न समाप्त हो गया है। संदेश जारी रखने के लिए कृपया नवीनतम वर्ज़न में नवीनीकृत करें।",
        "description": "Warning notification that this version of the app has expired"
    },
    "upgrade": {
        "message": "अपग्रेड",
        "description": "Label text for button to upgrade the app to the latest version"
    },
    "mediaMessage": {
        "message": "मीडिया मेसेज",
        "description": "Description of a message that has an attachment and no text, displayed in the conversation list as a preview."
    },
    "unregisteredUser": {
        "message": "संख्या पंजीकृत नहीं है",
        "description": "Error message displayed when sending to an unregistered user."
    },
    "sync": {
        "message": "संपर्क",
        "description": "Label for contact and group sync settings"
    },
    "syncExplanation": {
        "message": "अपने मोबाइल डिवाइस से सभी Signal समूहों और संपर्कों को आयात करें",
        "description": "Explanatory text for sync settings"
    },
    "lastSynced": {
        "message": "पिछले आयात पर",
        "description": "Label for date and time of last sync operation"
    },
    "syncNow": {
        "message": "अब आयात करें",
        "description": "Label for a button that syncs contacts and groups from your phone"
    },
    "syncing": {
        "message": "आयात करने",
        "description": "Label for a disabled sync button while sync is in progress."
    },
    "syncFailed": {
        "message": "आयात असफल रहा। सुनिश्चित करें कि आपका कंप्यूटर और आपका फ़ोन इंटरनेट से कनेक्ट है",
        "description": "Informational text displayed if a sync operation times out."
    },
    "timestamp_s": {
        "message": "अभी",
        "description": "Brief timestamp for messages sent less than a minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_m": {
        "message": "1 मी",
        "description": "Brief timestamp for messages sent about one minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_h": {
        "message": "1 घंटे",
        "description": "Brief timestamp for messages sent about one hour ago. Displayed in the conversation list and message bubble."
    },
    "hoursAgo": {
        "message": "$hours$ घंटे",
        "description": "Contracted form of 'X hours ago' which works both for singular and plural",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "minutesAgo": {
        "message": "$minutes$ मिनट",
        "description": "Contracted form of 'X minutes ago' which works both for singular and plural",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "justNow": {
        "message": "अभी",
        "description": "Shown if a message is very recent, less than 60 seconds old"
    },
    "timestampFormat_M": {
        "message": "MMM D",
        "description": "Timestamp format string for displaying month and day (but not the year) of a date within the current year, ex: use 'MMM D' for 'Aug 8', or 'D MMM' for '8 Aug'."
    },
    "messageBodyTooLong": {
        "message": "मेसेज बहुत लंबा है",
        "description": "Shown if the user tries to send more than 64kb of text"
    },
    "unblockToSend": {
        "message": "कोई मेसेज भेजने के लिए इस संपर्क को अनब्लॉक करें",
        "description": "Brief message shown when trying to message a blocked number"
    },
    "unblockGroupToSend": {
        "message": "मेसेज भेजने के लिए इस समूह को अनब्लॉक करें",
        "description": "Brief message shown when trying to message a blocked group"
    },
    "youChangedTheTimer": {
        "message": "आपने गायब होने वाले मेसेज के टाइम को $time$ पर सेट कर दिया है।",
        "description": "Message displayed when you change the message expiration timer in a conversation.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetOnSync": {
        "message": "गायब होने वाले मेसेज के टाइम को $time$ पर अपडेट कर दिया गया है।",
        "description": "Message displayed when timer is set on initial link of desktop device.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetByMember": {
        "message": "एक मेंबर ने गायब होने वाले मेसेज के टाइम को $time$ पर सेट कर दिया।",
        "description": "Message displayed when timer is by an unknown group member.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "theyChangedTheTimer": {
        "message": "$name$ ने गायब होने वाले मेसेज का टाइम $time$ पर सेट कर दिया है।",
        "description": "Message displayed when someone else changes the message expiration timer in a conversation.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            },
            "time": {
                "content": "$2",
                "example": "10m"
            }
        }
    },
    "disappearingMessages__off": {
        "message": "बंद ",
        "description": "Label for option to turn off message expiration in the timer menu"
    },
    "disappearingMessages": {
        "message": "गायब होने वाले मेसेज",
        "description": "Conversation menu option to enable disappearing messages. Title of the settings section for Disappearing Messages"
    },
    "disappearingMessagesDisabled": {
        "message": "मेसेज जो गायब हो जाते हैं अक्षम",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disappearingMessagesDisabledByMember": {
        "message": "एक मेंबर ने गायब होने वाले मेसेजेस को डिसेबल कर दिया।",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disabledDisappearingMessages": {
        "message": "$name$ ने गायब होने वाले मेसेजेस को डिसेबल कर दिया।",
        "description": "Displayed in the conversation list when the timer is turned off",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "youDisabledDisappearingMessages": {
        "message": "आपने गायब मेसेज अक्षम कर दिए हैं।",
        "description": "Displayed in the conversation list when the timer is turned off"
    },
    "timerSetTo": {
        "message": "टाइमर सेट $time$ पर ",
        "description": "Displayed in the conversation list when the timer is updated by some automatic action, or in the left pane",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "1w"
            }
        }
    },
    "audioNotificationDescription": {
        "message": "ऑडियो सूचना चलाएं",
        "description": "Description for audio notification setting"
    },
    "callRingtoneNotificationDescription": {
        "message": "कॉलिंग साउंड प्ले करें।",
        "description": "Description for call ringtone notification setting"
    },
    "callSystemNotificationDescription": {
        "message": "कॉल्स के लिए सूचनाँए दिखाएँ",
        "description": "Description for call notification setting"
    },
    "incomingCallNotificationDescription": {
        "message": "इनकमिंग कॉल्स को एनेबल करें",
        "description": "Description for incoming calls setting"
    },
    "contactChangedProfileName": {
        "message": "$sender$ ने अपना प्रोफाइल नाम $oldProfile$ से बदलकर $newProfile$ रख दिया।",
        "description": "Description for incoming calls setting",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "Bob"
            },
            "oldProfile": {
                "content": "$2",
                "example": ".x8Skillz8x."
            },
            "newProfile": {
                "content": "$3",
                "example": "Bob Smith"
            }
        }
    },
    "changedProfileName": {
        "message": "$oldProfile$ ने अपना प्रोफाइल नाम बदल कर $newProfile$ रख दिया।",
        "description": "Shown when a contact not in your address book changes their profile name",
        "placeholders": {
            "oldProfile": {
                "content": "$2",
                "example": ".x8Skillz8x."
            },
            "newProfile": {
                "content": "$3",
                "example": "Bob Smith"
            }
        }
    },
    "safetyNumberChanged": {
        "message": "सुरक्षा नंबर बदल गया है।",
        "description": "A notification shown in the conversation when a contact reinstalls"
    },
    "safetyNumberChanges": {
        "message": "सुरक्षा नंबर परिवर्तन",
        "description": "Title for safety number changed modal"
    },
    "safetyNumberChangedGroup": {
        "message": "$name$ के साथ आपका सुरक्षा नंबर बदल गया है।",
        "description": "A notification shown in a group conversation when a contact reinstalls, showing the contact name",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "verifyNewNumber": {
        "message": "सुरक्षा नंबर सत्यापित करें",
        "description": "Label on button included with safety number change notification in the conversation"
    },
    "cannotGenerateSafetyNumber": {
        "message": "जब तक आप इस उपभोगकर्ता के साथ मेसेजों का आदान-प्रदान नहीं करेंगे तब तक वह सत्यापित नहीं हो पायेगा।",
        "description": "Shown on the safety number screen if you have never exchanged messages with that contact"
    },
    "yourSafetyNumberWith": {
        "message": "$name1$ के साथ आपका सुरक्षा नंबर है:",
        "description": "Heading for safety number view",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "themeLight": {
        "message": "रोशनी ",
        "description": "Label text for light theme (normal)"
    },
    "themeDark": {
        "message": "डार्क",
        "description": "Label text for dark theme"
    },
    "themeSystem": {
        "message": "सिस्टम",
        "description": "Label text for system theme"
    },
    "noteToSelf": {
        "message": "स्वयं को लिखें",
        "description": "Name for the conversation with your own phone number"
    },
    "noteToSelfHero": {
        "message": "आप इस संवाद में अपने लिये नोट्स लिख सकते हैं। अगर आपके खाते से लिंक और डिवाइस हैं तो उनसे नयेे नोट्स सिंक हो जाएँगे।",
        "description": "Description for the Note to Self conversation"
    },
    "notificationDrawAttention": {
        "message": "कोई सूचना आने पर इस विंडो की ओर ध्यान दिलाएँ",
        "description": "Label text for the setting that controls whether new notifications draw attention to the window"
    },
    "hideMenuBar": {
        "message": "मेनू बार छुपाएं",
        "description": "Label text for menu bar visibility setting"
    },
    "startConversation": {
        "message": "नया वार्तालाप शुरु करें...",
        "description": "Label underneath number a user enters that is not an existing contact"
    },
    "newConversation": {
        "message": "नई संवाद",
        "description": "Label for header when starting a new conversation"
    },
    "contactSearchPlaceholder": {
        "message": "Search by name or phone number",
        "description": "Placeholder to use when searching for contacts in the composer"
    },
    "noContactsFound": {
        "message": "No contacts found",
        "description": "Label shown when there are no contacts to compose to"
    },
    "noConversationsFound": {
        "message": "No conversations found",
        "description": "Label shown when there are no conversations to compose to"
    },
    "chooseGroupMembers__title": {
        "message": "Choose members",
        "description": "The title for the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__back-button": {
        "message": "पीछे जाएं",
        "description": "Used as alt-text of the back button on the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__skip": {
        "message": "छोड़ दे ",
        "description": "The 'skip' button text in the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__next": {
        "message": "अगला",
        "description": "The 'next' button text in the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__maximum-group-size__title": {
        "message": "अधिकतम ग्रुप साइज़ पूरा हो गया",
        "description": "Shown in the alert when you add the maximum number of group members"
    },
    "chooseGroupMembers__maximum-group-size__body": {
        "message": "Signal groups can have a maximum of $max$ members.",
        "description": "Shown in the alert when you add the maximum number of group members",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "1000"
            }
        }
    },
    "chooseGroupMembers__maximum-recommended-group-size__title": {
        "message": "अनुशंसित मेंबर सीमा पूरी हुई",
        "description": "Shown in the alert when you add the maximum recommended number of group members"
    },
    "chooseGroupMembers__maximum-recommended-group-size__body": {
        "message": "Signal groups perform best with $max$ members or less. Adding more members will cause delays sending and receiving messages.",
        "description": "Shown in the alert when you add the maximum recommended number of group members",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "150"
            }
        }
    },
    "chooseGroupMembers__cant-add-member__title": {
        "message": "Can’t add member",
        "description": "Shown in the alert when you try to add someone who can't be added to a group"
    },
    "chooseGroupMembers__cant-add-member__body": {
        "message": "\"$name$\" can’t be added to the group because they’re using an old version of Signal. You can add them to the group after they’ve updated Signal.",
        "description": "Shown in the alert when you try to add someone who can't be added to a group",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "setGroupMetadata__title": {
        "message": "इस समूह को नाम दें",
        "description": "The title for the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__back-button": {
        "message": "Back to member selection",
        "description": "Used as alt-text of the back button on the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__group-name-placeholder": {
        "message": "ग्रुप का नाम (आवश्यक)",
        "description": "The placeholder for the group name placeholder"
    },
    "setGroupMetadata__group-description-placeholder": {
        "message": "Description",
        "description": "The placeholder for the group description"
    },
    "setGroupMetadata__create-group": {
        "message": "बनाएँ",
        "description": "The 'create group' button text in the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__members-header": {
        "message": "सदस्यों",
        "description": "The header for the members list in the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__error-message": {
        "message": "This group couldn’t be created. Check your connection and try again.",
        "description": "Shown in the modal when we can't create a group"
    },
    "updateGroupAttributes__title": {
        "message": "समूह संपादित करें",
        "description": "Shown in the modal when we want to update a group"
    },
    "updateGroupAttributes__error-message": {
        "message": "Failed to update the group. Check your connection and try again.",
        "description": "Shown in the modal when we can't update a group"
    },
    "notSupportedSMS": {
        "message": "SMS/MMS मेसेज समर्थित नहीं हैं।",
        "description": "Label underneath number informing user that SMS is not supported on desktop"
    },
    "newPhoneNumber": {
        "message": "कोई संपर्क जोड़ने के लिए एक फ़ोन नंबर दर्ज करें",
        "description": "Placeholder for adding a new number to a contact"
    },
    "invalidNumberError": {
        "message": "अमान्य संख्या",
        "description": "When a person inputs a number that is invalid"
    },
    "unlinkedWarning": {
        "message": "मेसेज जारी रखने के लिए Signal डेस्कटॉप को अपने मोबाइल डिवाइस पर लिंक करें।",
        "description": ""
    },
    "unlinked": {
        "message": "लिंक रद्द",
        "description": ""
    },
    "relink": {
        "message": "फिर से लिंक",
        "description": ""
    },
    "autoUpdateNewVersionTitle": {
        "message": "Signal अपडेट उपलब्ध है",
        "description": ""
    },
    "autoUpdateNewVersionMessage": {
        "message": "Signal का नया वर्ज़न अब उपलब्ध है।",
        "description": ""
    },
    "autoUpdateNewVersionInstructions": {
        "message": "अपडेट लागू करने के लिये Signal फिर से शुरु करें",
        "description": ""
    },
    "autoUpdateRestartButtonLabel": {
        "message": "Signal पुनः आरंभ करे ",
        "description": ""
    },
    "autoUpdateLaterButtonLabel": {
        "message": "बाद में",
        "description": ""
    },
    "leftTheGroup": {
        "message": "$name$ ने ग्रुप को छोड़ दिया।",
        "description": "Shown in the conversation history when a single person leaves the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleLeftTheGroup": {
        "message": "$name$ ने ग्रुप को छोड़ दिया।",
        "description": "Shown in the conversation history when multiple people leave the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "updatedTheGroup": {
        "message": "$name$ ने ग्रुप को अपडेट किया",
        "description": "Shown in the conversation history when someone updates the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "youUpdatedTheGroup": {
        "message": "आपने समूह को अपडेट किया है।",
        "description": "Shown in the conversation history when you update a group"
    },
    "updatedGroupAvatar": {
        "message": "ग्रुप अवतार को अपडेट किया गया था।",
        "description": "Shown in the conversation history when someone updates the group"
    },
    "titleIsNow": {
        "message": "ग्रुप का नाम अब '$name$' है।",
        "description": "Shown in the conversation history when someone changes the title of the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Book Club"
            }
        }
    },
    "youJoinedTheGroup": {
        "message": "आप ग्रुप में शामिल हो गए हैं।",
        "description": "Shown in the conversation history when you are added to a group."
    },
    "joinedTheGroup": {
        "message": "$name$ ग्रुप में शामिल हो गए।",
        "description": "Shown in the conversation history when a single person joins the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "multipleJoinedTheGroup": {
        "message": "$names$ ग्रुप में शामिल हो गए।",
        "description": "Shown in the conversation history when more than one person joins the group",
        "placeholders": {
            "names": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "ConversationListItem--message-request": {
        "message": "बाच-चीत का निवेदन",
        "description": "Preview shown for conversation if the user has not yet accepted an incoming message request"
    },
    "ConversationListItem--draft-prefix": {
        "message": "ड्राफ्ट",
        "description": "Prefix shown in italic in conversation view when a draft is saved"
    },
    "message--getNotificationText--gif": {
        "message": "GIF",
        "description": "Shown in notifications and in the left pane when a GIF is received."
    },
    "message--getNotificationText--photo": {
        "message": "तस्वीर",
        "description": "Shown in notifications and in the left pane when a photo is received."
    },
    "message--getNotificationText--video": {
        "message": "वीडियो",
        "description": "Shown in notifications and in the left pane when a video is received."
    },
    "message--getNotificationText--voice-message": {
        "message": "ऑडियो मेसेज",
        "description": "Shown in notifications and in the left pane when a voice message is received."
    },
    "message--getNotificationText--audio-message": {
        "message": "ऑडियो मेसेज",
        "description": "Shown in notifications and in the left pane when an audio message is received."
    },
    "message--getNotificationText--file": {
        "message": "फ़ाइल",
        "description": "Shown in notifications and in the left pane when a generic file is received."
    },
    "message--getNotificationText--stickers": {
        "message": "स्टिकर मेसेज",
        "description": "Shown in notifications and in the left pane instead of sticker image."
    },
    "message--getNotificationText--text-with-emoji": {
        "message": "$emoji$ $text$",
        "description": "Shown in notifications and in the left pane when text has an emoji. Probably always [emoji] [text] on LTR languages and [text] [emoji] on RTL languages.",
        "placeholders": {
            "emoji": {
                "content": "$1",
                "example": "📷"
            },
            "text": {
                "content": "$2",
                "example": "Photo"
            }
        }
    },
    "message--getDescription--unsupported-message": {
        "message": "असमर्थित मेसेज",
        "description": "Shown in notifications and in the left pane when a message has features too new for this signal install."
    },
    "message--getDescription--disappearing-media": {
        "message": "एक बार देखने योग्य मीडिया",
        "description": "Shown in notifications and in the left pane after view-once message is deleted. Also shown when quoting a view once media."
    },
    "message--getDescription--disappearing-photo": {
        "message": "एक बार देखने योग्य फ़ोटो",
        "description": "Shown in notifications and in the left pane when a message is a view once photo. Also shown when quoting a view once photo."
    },
    "message--getDescription--disappearing-video": {
        "message": "एक बार देखने योग्य वीडियो",
        "description": "Shown in notifications and in the left pane when a message is a view once video. Also shown when quoting a view once video."
    },
    "message--deletedForEveryone": {
        "message": "यह मेसेज हटा दिया गया है।",
        "description": "Shown in a message's bubble when the message has been deleted for everyone."
    },
    "stickers--toast--InstallFailed": {
        "message": "स्टीकर पैक इंस्टॉल नहीं हो पाया",
        "description": "Shown in a toast if the user attempts to install a sticker pack and it fails"
    },
    "stickers--StickerManager--InstalledPacks": {
        "message": "इंस्टॉल करे हुए स्टिकर",
        "description": "Shown in the sticker pack manager above your installed sticker packs."
    },
    "stickers--StickerManager--InstalledPacks--Empty": {
        "message": "कोई स्टीकर इंस्टॉल नहीं है",
        "description": "Shown in the sticker pack manager when you don't have any installed sticker packs."
    },
    "stickers--StickerManager--BlessedPacks": {
        "message": "Signal की कलाकार श्रृंखला से",
        "description": "Shown in the sticker pack manager above the default sticker packs."
    },
    "stickers--StickerManager--BlessedPacks--Empty": {
        "message": "Signal कलाकार स्टिकर उपलब्ध नहीं हैं",
        "description": "Shown in the sticker pack manager when there are no blessed sticker packs available."
    },
    "stickers--StickerManager--ReceivedPacks": {
        "message": "आपको प्राप्त स्टीकर ",
        "description": "Shown in the sticker pack manager above sticker packs which you have received in messages."
    },
    "stickers--StickerManager--ReceivedPacks--Empty": {
        "message": "आने वाले मेसेजों के स्टिकर यहां दिखाई देंगे",
        "description": "Shown in the sticker pack manager when you have not received any sticker packs in messages."
    },
    "stickers--StickerManager--Install": {
        "message": "इंस्टॉल करें",
        "description": "Shown in the sticker pack manager next to sticker packs which can be installed."
    },
    "stickers--StickerManager--Uninstall": {
        "message": "अनइंस्टॉल",
        "description": "Shown in the sticker pack manager next to sticker packs which are already installed."
    },
    "stickers--StickerManager--UninstallWarning": {
        "message": "अगर आपके पास मूल संदेश नहीं है तो शायद आप स्टिकर पैक पुनः स्थापित ना कर पाएँ",
        "description": "Shown in the sticker pack manager next to sticker packs which are already installed."
    },
    "stickers--StickerManager--Introduction--Image": {
        "message": "पेश करते हैं स्टिकर्स: बैंडिट दि कैट",
        "description": "Alt text on a tooltip image when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerManager--Introduction--Title": {
        "message": "पेश है स्टिकर",
        "description": "Shown as the title on a tooltip when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerManager--Introduction--Body": {
        "message": "शब्द क्युँ इस्तेमाल करने जब आप स्टिकर इस्तेमाल कर सकते हैं?",
        "description": "Shown as the body on a tooltip when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerPicker--Open": {
        "message": "स्टिकर पिकर खोलें",
        "description": "Label for the open button for the sticker picker"
    },
    "stickers--StickerPicker--AddPack": {
        "message": "एक स्टिकर पैक जोड़ें",
        "description": "Label for the add pack button in the sticker picker"
    },
    "stickers--StickerPicker--NextPage": {
        "message": "अगला पृष्ठ",
        "description": "Label for the next page button in the sticker picker"
    },
    "stickers--StickerPicker--PrevPage": {
        "message": "पिछला पृष्ठ",
        "description": "Label for the previous page button in the sticker picker"
    },
    "stickers--StickerPicker--Recents": {
        "message": "हाल का स्टिकर",
        "description": "Label for the recent stickers button in the sticker picker"
    },
    "stickers--StickerPicker--DownloadError": {
        "message": "कुछ स्टिकर डाउनलोड नहीं हो पाए",
        "description": "Shown in the sticker picker when one or more stickers could not be downloaded."
    },
    "stickers--StickerPicker--DownloadPending": {
        "message": "स्टीकर पैक स्थापित हो रहा है...",
        "description": "Shown in the sticker picker when one or more stickers are still downloading."
    },
    "stickers--StickerPicker--Empty": {
        "message": "स्टिकर नहीं मिले",
        "description": "Shown in the sticker picker when there are no stickers to show."
    },
    "stickers--StickerPicker--Hint": {
        "message": "आपके मेसेजों से आये नये स्टिकर पैक अब इंस्टॉल के लिए उपलब्ध हैं",
        "description": "Shown in the sticker picker the first time you have received new packs you can install."
    },
    "stickers--StickerPicker--NoPacks": {
        "message": "स्टिकर पैक नहीं मिले",
        "description": "Shown in the sticker picker when there are no installed sticker packs."
    },
    "stickers--StickerPicker--NoRecents": {
        "message": "हाल ही मे इस्तेमाल हुए स्टिकर यहाँ दिखेंगे",
        "description": "Shown in the sticker picker when there are no recent stickers to show."
    },
    "stickers--StickerPreview--Title": {
        "message": "स्टीकर पैक",
        "description": "The title that appears in the sticker pack preview modal."
    },
    "stickers--StickerPreview--Error": {
        "message": "स्टिकर पैक खोलने में गलती हुई है। कृपया अपना इंटरनेट कनेक्शन जांच लें और फिर कोशिश करें।",
        "description": "The message that appears in the sticker preview modal when there is an error."
    },
    "EmojiPicker--empty": {
        "message": "इमोजी नहीं मिला",
        "description": "Shown in the emoji picker when a search yields 0 results."
    },
    "EmojiPicker--search-placeholder": {
        "message": "इमोजी खोजें",
        "description": "Shown as a placeholder inside the emoji picker search field."
    },
    "EmojiPicker--skin-tone": {
        "message": "स्किन टोन $tone$",
        "description": "Shown as a tooltip over the emoji tone buttons.",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "EmojiPicker__button--recents": {
        "message": "नवीनतम",
        "description": "Label for recents emoji picker button"
    },
    "EmojiPicker__button--emoji": {
        "message": "इमोजी",
        "description": "Label for emoji emoji picker button"
    },
    "EmojiPicker__button--animal": {
        "message": "जानवर",
        "description": "Label for animal emoji picker button"
    },
    "EmojiPicker__button--food": {
        "message": "भोजन",
        "description": "Label for food emoji picker button"
    },
    "EmojiPicker__button--activity": {
        "message": "गतिविधि",
        "description": "Label for activity emoji picker button"
    },
    "EmojiPicker__button--travel": {
        "message": "सफर",
        "description": "Label for travel emoji picker button"
    },
    "EmojiPicker__button--object": {
        "message": "वस्तु",
        "description": "Label for object emoji picker button"
    },
    "EmojiPicker__button--symbol": {
        "message": "चिन्ह",
        "description": "Label for symbol emoji picker button"
    },
    "EmojiPicker__button--flag": {
        "message": "झंडा",
        "description": "Label for flag emoji picker button"
    },
    "confirmation-dialog--Cancel": {
        "message": "रद्द करें",
        "description": "Appears on the cancel button in confirmation dialogs."
    },
    "Message--unsupported-message": {
        "message": "$contact$ ने एक मेसेज भेजा है जो याहाँ दिखाया नहीं जा सकता क्योंकि वह Signal का नया फ़ीचर इस्तेमाल करता है।",
        "description": "",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "Message--unsupported-message-ask-to-resend": {
        "message": "आप Signal का नवीनतम वर्ज़न तक अपडेट हो चुके हैं, अब आप $contact$ को यह मेसेज फिर से भेजने के लिये कह सकते हैं।",
        "description": "",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "Message--from-me-unsupported-message": {
        "message": "आपके किसी डिवाइस ने एक मेसेज भेजा है जो याहाँ दिखाया नहीं जा सकता क्योंकि वह Signal का नया फ़ीचर इस्तेमाल करता है।",
        "description": ""
    },
    "Message--from-me-unsupported-message-ask-to-resend": {
        "message": "अब जब आप Signal का नवीनतम वर्ज़न तक अपडेट हो चुके हैं, आपके आगे के मेसेज सिंक्रनाइज़ कर दिये जाएँगे",
        "description": ""
    },
    "Message--update-signal": {
        "message": "Signal अपडेट करें",
        "description": "Text for a button which will take user to Signal download page"
    },
    "Message--tap-to-view-expired": {
        "message": "देखा गया",
        "description": "Text shown on messages with with individual timers, after user has viewed it"
    },
    "Message--tap-to-view--outgoing": {
        "message": "मीडिया",
        "description": "Text shown on outgoing messages with with individual timers (inaccessible)"
    },
    "Message--tap-to-view--incoming--expired-toast": {
        "message": "आपने यह मेसेज पहले ही देख लिया है",
        "description": "Shown when user clicks on an expired incoming view-once bubble"
    },
    "Message--tap-to-view--outgoing--expired-toast": {
        "message": "एक बार देखने योग्य मेसेजेस आपके संवाद इतिहास में स्टोर नहीं हैं।",
        "description": "Shown when user clicks on an expired outgoing view-once bubble"
    },
    "Message--tap-to-view--incoming": {
        "message": "फ़ोटो देखें",
        "description": "Text shown on photo messages with with individual timers, before user has viewed it"
    },
    "Message--tap-to-view--incoming-video": {
        "message": "वीडियो देखें",
        "description": "Text shown on video messages with with individual timers, before user has viewed it"
    },
    "Conversation--getDraftPreview--attachment": {
        "message": "(अटैचमेंट)",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Conversation--getDraftPreview--quote": {
        "message": "(क्वोट)",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Conversation--getDraftPreview--draft": {
        "message": "(ड्राफ्ट)",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Keyboard--navigate-by-section": {
        "message": "अनुभाग के हिसाब से नेविगेट करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--previous-conversation": {
        "message": "पिछला संवाद",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--next-conversation": {
        "message": "अगला संवाद",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--previous-unread-conversation": {
        "message": "पिछला अपठित संवाद",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--next-unread-conversation": {
        "message": "अगला अपठित संवाद",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--preferences": {
        "message": "पसंदगी",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-conversation-menu": {
        "message": "संवाद का मेन्यू खोलें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--new-conversation": {
        "message": "Start new conversation",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--archive-conversation": {
        "message": "संवाद संग्रहित करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--unarchive-conversation": {
        "message": "संवाद असंग्रहित करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--search": {
        "message": "खोजें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--search-in-conversation": {
        "message": "संंवाद में खोजें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--focus-composer": {
        "message": "कंपोज़र पर फ़ोकस करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-all-media-view": {
        "message": "सारी मीडिया व्यू खोलें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-emoji-chooser": {
        "message": "इमोजी चुनने वाला खोलें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-sticker-chooser": {
        "message": "स्टिकर चुनने वाला खोलें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--begin-recording-voice-note": {
        "message": "वॉयस मेसेज रिकॉर्ड करना शुरु करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--default-message-action": {
        "message": "चुने गये मेसेज के लिये डिफ़ॉल्ट क्रिया",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--view-details-for-selected-message": {
        "message": "चुने हुए मेसेजों की माहिती देखें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-reply": {
        "message": "चुने हुए मेसेज के जवाब को टॉगल करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-reaction-picker": {
        "message": "चुने हुए मेसेज के लिए इमोजी-प्रतिक्रिया पिकर को टॉगल करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--save-attachment": {
        "message": "चुने हुए मेसेज का अटैचमेंट सहेजें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--delete-message": {
        "message": "चुने हुए मेसेज को हटाएँ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--add-newline": {
        "message": "मेसेज में नयी पंक्ति जोङें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--expand-composer": {
        "message": "कंपोज़र विस्तृत करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--send-in-expanded-composer": {
        "message": "भेजें (विस्तृत कंपोज़र से)",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--attach-file": {
        "message": "फ़ाइल अटैच करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--remove-draft-link-preview": {
        "message": "ड्राफ्ट लिंक प्रिव्यु हटाएँ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--remove-draft-attachments": {
        "message": "सारे ड्राफ्ट अटैचमेंट हटाएँ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--conversation-by-index": {
        "message": "संवाद पर जाएँ",
        "description": "A shortcut allowing direct navigation to conversations 1 to 9 in list"
    },
    "Keyboard--Key--ctrl": {
        "message": "Ctrl",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--option": {
        "message": "विकल्प",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--alt": {
        "message": "Alt",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--shift": {
        "message": "Shift",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--enter": {
        "message": "Enter",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--tab": {
        "message": "टैब",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--one-to-nine-range": {
        "message": "1 से 9",
        "description": "Expresses that 1, 2, 3, up to 9 are available shortcut keys"
    },
    "Keyboard--header": {
        "message": "कीबोर्ड शॉर्टकट",
        "description": "Title header of the keyboard shortcuts guide"
    },
    "Keyboard--navigation-header": {
        "message": "नेविगेशन",
        "description": "Header of the keyboard shortcuts guide - navigation section"
    },
    "Keyboard--messages-header": {
        "message": "मेसेज",
        "description": "Header of the keyboard shortcuts guide - messages section"
    },
    "Keyboard--composer-header": {
        "message": "कंपोज़र",
        "description": "Header of the keyboard shortcuts guide - composer section"
    },
    "Keyboard--scroll-to-top": {
        "message": "सूची की शुरुवात पर स्क्रॉल करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--scroll-to-bottom": {
        "message": "सूची के अंत पर स्क्रॉल करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--close-curent-conversation": {
        "message": "इस संवाद को बंद करें",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--calling-header": {
        "message": "कॉल की जा रही है",
        "description": "Header of the keyboard shortcuts guide - calling section"
    },
    "Keyboard--toggle-audio": {
        "message": "टॉगल म्यूट चालू और बंद",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-video": {
        "message": "टॉगल वीडियो चालू और बंद",
        "description": "Shown in the shortcuts guide"
    },
    "close-popup": {
        "message": "पॉपअप बंद करें",
        "description": "Used as alt text for any button closing a popup"
    },
    "add-image-attachment": {
        "message": "तस्वीर अटैचमेंट जोड़ें ",
        "description": "Used in draft attachment list for the big 'add new attachment' button"
    },
    "remove-attachment": {
        "message": "अटैचमेंट हटाएँ",
        "description": "Used in draft attachment list to remove an individual attachment"
    },
    "backToInbox": {
        "message": "इनबॉक्स पर वापस जाएँ",
        "description": "Used as alt-text of button on archived conversations screen"
    },
    "conversationArchived": {
        "message": "संवाद संग्रहीत कर दिया गया है",
        "description": "A toast that shows up when user archives a conversation"
    },
    "conversationReturnedToInbox": {
        "message": "संवाद इनबॉक्स में वापस आ गया है",
        "description": "A toast that shows up when the user unarchives a conversation"
    },
    "conversationMarkedUnread": {
        "message": "संवाद को अनपढ़ा मार्क किया गया",
        "description": "A toast that shows up when user marks a conversation as unread"
    },
    "StickerCreator--title": {
        "message": "स्टिकर पैक निर्माता",
        "description": "The title of the Sticker Pack Creator window"
    },
    "StickerCreator--DropZone--staticText": {
        "message": "यहाँ तस्वीरें जोड़ने या ड्रॉप करने के लिए क्लिक करें",
        "description": "Text which appears on the Sticker Creator drop zone when there is no active drag"
    },
    "StickerCreator--DropZone--activeText": {
        "message": "यहाँ तस्वीरें ड्रॉप करें",
        "description": "Text which appears on the Sticker Creator drop zone when there is an active drag"
    },
    "StickerCreator--Preview--title": {
        "message": "स्टिकर पैक",
        "description": "The 'title' of the sticker pack preview 'modal'"
    },
    "StickerCreator--ConfirmDialog--cancel": {
        "message": "रद्द करें",
        "description": "The default text for the confirm dialog cancel button"
    },
    "StickerCreator--CopyText--button": {
        "message": "कॉपी",
        "description": "The text which appears on the copy button for the sticker creator share screen"
    },
    "StickerCreator--ShareButtons--facebook": {
        "message": "फेसबुक",
        "description": "Title for Facebook button"
    },
    "StickerCreator--ShareButtons--twitter": {
        "message": "Twitter",
        "description": "Title for Twitter button"
    },
    "StickerCreator--ShareButtons--pinterest": {
        "message": "पिंटेरेस्ट",
        "description": "Title for Pinterest button"
    },
    "StickerCreator--ShareButtons--whatsapp": {
        "message": "व्हॉट्सऐप",
        "description": "Title for WhatsApp button"
    },
    "StickerCreator--AppStage--next": {
        "message": "अगला",
        "description": "Default text for the next button on all stages of the sticker creator"
    },
    "StickerCreator--AppStage--prev": {
        "message": "पीछे जाएं",
        "description": "Default text for the previous button on all stages of the sticker creator"
    },
    "StickerCreator--DropStage--title": {
        "message": "अपने स्टिकर जोडे़ं",
        "description": "Title for the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--help": {
        "message": "स्टिकर PNG, APNG, या WebP फॉर्मैट में होने चाहिए और उनका बैकग्राउंड पारदर्शी होना चाहिए 512x512 पिक्सल के होने चाहिए। सिफारिश किया हुआ मार्जिन है 16px.",
        "description": "Help text for the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--showMargins": {
        "message": "मार्जिन दिखाएँ",
        "description": "Text for the show margins toggle on the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--addMore": {
        "message": "$count$ या अधिक जोड़ें",
        "description": "Text to show user how many more stickers they must add",
        "placeholders": {
            "hashtag": {
                "content": "$1",
                "example": "4"
            }
        }
    },
    "StickerCreator--EmojiStage--title": {
        "message": "प्रत्येक स्टिकर में एक इमोजी जोड़ें",
        "description": "Title for the drop stage of the sticker creator"
    },
    "StickerCreator--EmojiStage--help": {
        "message": "इससे हम जब आप मेसेज करते हैं, तब आपको स्टिकर का सुझाव दे सकते हैं।",
        "description": "Help text for the drop stage of the sticker creator"
    },
    "StickerCreator--MetaStage--title": {
        "message": "बस कुछ और विवरण...",
        "description": "Title for the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--title": {
        "message": "शीर्षक",
        "description": "Label for the title input of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--author": {
        "message": "लेखक",
        "description": "Label for the author input of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--cover": {
        "message": "कवर तस्वीर",
        "description": "Label for the cover image picker of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--cover--help": {
        "message": "यह वह तस्वीर है जो तब दिखाई देगी जब आप अपना स्टिकर पैक शेयर करेंगे",
        "description": "Help text for the cover image picker of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--title": {
        "message": "क्या आप वाकई में अपना स्टिकर पैक अपलोड करना चाहते हैं?",
        "description": "Title for the confirm dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--confirm": {
        "message": "अपलोड करें",
        "description": "Text for the upload button in the confirmation dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--text": {
        "message": "आप फिर स्टिकर पैक बनाने के बाद उसे एडिट या मिटा नहीं पाएँगे।",
        "description": "The text inside the confirmation dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--UploadStage--title": {
        "message": "आपका स्टिकर पैक बनाया जा रहा है",
        "description": "Title for the upload stage of the sticker creator"
    },
    "StickerCreator--UploadStage-uploaded": {
        "message": "$total$ का $count$ अपलोड हो गया",
        "description": "Title for the upload stage of the sticker creator",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            },
            "total": {
                "content": "$2",
                "example": "20"
            }
        }
    },
    "StickerCreator--ShareStage--title": {
        "message": "बधाई हो! आपने एक स्टिकर पैक बना लिया।",
        "description": "Title for the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--help": {
        "message": "स्टिकर आइकन के ज़रिए अपने नए स्टिकर्स को एक्सेस करें, या नीचे दिए लिंक का उपयोग करते हुए इसे अपने दोस्तों के साथ शेयर करें।",
        "description": "Help text for the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--callToAction": {
        "message": "अन्य लोगों को किसी भी कस्टम स्टिकर पैक के लिए URLs खोजने में मदद करने के लिए हैशटैग$hashtag$ का उपयोग करें जिसे आप सार्वजनिक रूप से सुलभ बनाना चाहते हैं।",
        "description": "Call to action text for the share stage of the sticker creator",
        "placeholders": {
            "hashtag": {
                "content": "$1",
                "example": "<strong>#makeprivacystick</strong>"
            }
        }
    },
    "StickerCreator--ShareStage--copyTitle": {
        "message": "स्टिकर पैक URL",
        "description": "Title for the copy button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--close": {
        "message": "बंद करो",
        "description": "Text for the close button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--createAnother": {
        "message": "एक और स्टिकर पैक बनाएँ",
        "description": "Text for the create another sticker pack button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--socialMessage": {
        "message": "ये नया स्टिकर पैक देखें जो मैंने Signal के लिए बनाया है। #makeprivacystick",
        "description": "Text which is shared to social media platforms for sticker packs"
    },
    "StickerCreator--Toasts--imagesAdded": {
        "message": "$count$ तस्वीर (तस्वीरें) जोड़ी गई",
        "description": "Text for the toast when images are added to the sticker creator",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "StickerCreator--Toasts--animated": {
        "message": "एनिमेटेड स्टिकर्स इस समय समर्थित नहीं हैं",
        "description": "Text for the toast when an image that is animated was dropped on the sticker creator"
    },
    "StickerCreator--Toasts--tooLarge": {
        "message": "ड्रॉप की गई तस्वीर बहुत बड़ी है",
        "description": "Text for the toast when an image that is too large was dropped on the sticker creator"
    },
    "StickerCreator--Toasts--errorProcessing": {
        "message": "तस्वीर प्रोसेस करने में त्रुटि",
        "description": "Text for the toast when an image cannot be processed was dropped on the sticker creator with a generic error"
    },
    "StickerCreator--Toasts--APNG--notSquare": {
        "message": "एनिमेटेड PNG स्टिकर चौरस होने चाहिए",
        "description": "Text for the toast when someone tries to upload a non-square APNG"
    },
    "StickerCreator--Toasts--mustLoopForever": {
        "message": "एनिमेटेड स्टिकर्स हमेशा लूप में रहने चाहिए",
        "description": "Text for the toast when an image in the sticker creator does not animate forever"
    },
    "StickerCreator--Toasts--APNG--dimensionsTooLarge": {
        "message": "एनिमेटेड PNG स्टिकर का आकार बहुत बड़ा है",
        "description": "Text for the toast when an APNG image in the sticker creator is too large"
    },
    "StickerCreator--Toasts--APNG--dimensionsTooSmall": {
        "message": "एनिमेटेड PNG स्टिकर का आकार बहुत छोटा है",
        "description": "Text for the toast when an APNG image in the sticker creator is too small"
    },
    "StickerCreator--Toasts--errorUploading": {
        "message": "स्टिकर्स अपलोड करने में त्रुटि: $message$",
        "description": "Text for the toast when a sticker pack cannot be uploaded",
        "placeholders": {
            "message": {
                "content": "$1",
                "example": "Not connected"
            }
        }
    },
    "StickerCreator--Toasts--linkedCopied": {
        "message": "लिंक कॉपी गिया",
        "description": "Text for the toast when a link for sharing is copied from the Sticker Creator"
    },
    "StickerCreator--StickerPreview--light": {
        "message": "लाइट थीम में मेरा स्टिकर",
        "description": "Text for the sticker preview for the light theme"
    },
    "StickerCreator--StickerPreview--dark": {
        "message": "डार्क थीम में मेरा स्टिकर",
        "description": "Text for the sticker preview for the dark theme"
    },
    "StickerCreator--Authentication--error": {
        "message": "स्टिकर पैक क्रिएटर का उपयोग करने के लिए कृपया अपने फोन और डेस्कटॉप पर Signal को सेट अप करें",
        "description": "The error message which appears when the user has not linked their account and attempts to use the Sticker Creator"
    },
    "Reactions--error": {
        "message": "प्रतिक्रिया भेजी नहीं जा सकी। कृपया फिर से प्रयास करें।",
        "description": "Shown when a reaction fails to send"
    },
    "ReactionsViewer--more": {
        "message": "अधिक",
        "description": "Use in the reaction picker as the alt text for the 'more' button"
    },
    "ReactionsViewer--all": {
        "message": "सब",
        "description": "Shown in reaction viewer as the title for the 'all' category"
    },
    "MessageRequests--message-direct": {
        "message": "$name$ को आपको मेसेज करने देना है और उनके साथ अपना नाम और तस्वीर शेयर करनी है? उन्हें पता नहीं चलेगा कि आपने उनका मेसेजेस को देख लिया है जब तक आप स्वीकार नहीं करते।",
        "description": "Shown as the message for a message request in a direct message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce"
            }
        }
    },
    "MessageRequests--message-direct-blocked": {
        "message": "$name$ को आपको मेसेज करने देना है और उनके साथ अपना नाम और तस्वीर शेयर करनी है? आप कोई भी मेसेज प्राप्त नहीं करेंगे जब तक आप उन्हें अनब्लॉक नहीं करते।",
        "description": "Shown as the message for a message request in a direct message with a blocked account",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce"
            }
        }
    },
    "MessageRequests--message-group": {
        "message": "इस ग्रुप में जुड़ना है और इसके मेंबर्स के साथ अपना नाम और तस्वीर शेयर करनी है? उन्हें पता नहीं चलेगा कि आपने उनके मेसेज देख लिए हैं जब तक आप स्वीकार नहीं करते।",
        "description": "Shown as the message for a message request in a group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--message-group-blocked": {
        "message": "इस ग्रुप को अनब्लॉक करना है और इसके मेंबर्स के साथ अपना नाम और तस्वीर शेयर करनी है? आप कोई भी मेसेज प्राप्त नहीं करेंगे जब तक आप उन्हें अनब्लॉक नहीं करते।",
        "description": "Shown as the message for a message request in a blocked group"
    },
    "MessageRequests--block": {
        "message": "ब्लॉक",
        "description": "Shown as a button to let the user block a message request"
    },
    "MessageRequests--unblock": {
        "message": "अनब्लॉक करें",
        "description": "Shown as a button to let the user unblock a message request"
    },
    "MessageRequests--unblock-confirm-title": {
        "message": "$name$ को अनब्लॉक करना है?",
        "description": "Shown as a button to let the user unblock a message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--unblock-direct-confirm-body": {
        "message": "आप एक दूसरे को मेसेज और काॅल कर पाएंगे|",
        "description": "Shown as the body in the confirmation modal for unblocking a private message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--unblock-group-confirm-body": {
        "message": "ग्रूप के सदस्य आपको इस ग्रूप में फ़िर शामिल कर पाएँगे।",
        "description": "Shown as the body in the confirmation modal for unblocking a group message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--block-and-report-spam": {
        "message": "Report Spam and Block",
        "description": "Shown as a button to let the user block a message request and report spam"
    },
    "MessageRequests--block-and-report-spam-success-toast": {
        "message": "Reported as spam and blocked.",
        "description": "Shown in a toast when you successfully block a user and report them as spam"
    },
    "MessageRequests--block-direct-confirm-title": {
        "message": "$name$ को ब्लॉक करना है?",
        "description": "Shown as the title in the confirmation modal for blocking a private message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--block-direct-confirm-body": {
        "message": "ब्लॉक किये गए लोग आपको कॉल नहीं कर पाएंगे या आपको संदेश नहीं भेज पाएंगे।",
        "description": "Shown as the body in the confirmation modal for blocking a private message request"
    },
    "MessageRequests--block-group-confirm-title": {
        "message": "$group$ को ब्लॉक करके छोड़ना है?",
        "description": "Shown as the title in the confirmation modal for blocking a group message request",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "Friends 🌿"
            }
        }
    },
    "MessageRequests--block-group-confirm-body": {
        "message": "फिर आपको इस ग्रुप से संदेश या अपडेट प्राप्त नहीं होंगे, और अन्य मेंबर आपको इस ग्रुप में फिर से नहीं जोड़ पाएंगे।",
        "description": "Shown as the body in the confirmation modal for blocking a group message request"
    },
    "MessageRequests--delete": {
        "message": "हटाए ",
        "description": "Shown as a button to let the user delete any message request"
    },
    "MessageRequests--delete-direct-confirm-title": {
        "message": "संवाद हटाएं?",
        "description": "Shown as the title in the confirmation modal for deleting a private message request"
    },
    "MessageRequests--delete-direct-confirm-body": {
        "message": "यह संवाद आपके सभी डिवाइस से हटा दिया जाएगा।",
        "description": "Shown as the body in the confirmation modal for deleting a private message request"
    },
    "MessageRequests--delete-group-confirm-title": {
        "message": "$group$ को मिटाना और छोड़ना है?",
        "description": "Shown as the title in the confirmation modal for deleting a group message request",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "Friends 🌿"
            }
        }
    },
    "MessageRequests--delete-direct": {
        "message": "हटाए ",
        "description": "Shown as a button to let the user delete a direct message request"
    },
    "MessageRequests--delete-group": {
        "message": "डिलीट करें और छोङ दें",
        "description": "Shown as a button to let the user delete a group message request"
    },
    "MessageRequests--delete-group-confirm-body": {
        "message": "आप इस ग्रूप को छोङ देंगे और यह ग्रूप आपके सभी डिवाइस से हटा दिया जाएगा।",
        "description": "Shown as the body in the confirmation modal for deleting a group message request"
    },
    "MessageRequests--accept": {
        "message": "स्वीकृत ",
        "description": "Shown as a button to let the user accept a message request"
    },
    "MessageRequests--continue": {
        "message": "आगे ",
        "description": "Shown as a button to share your profile, necessary to continue messaging in a conversation"
    },
    "MessageRequests--profile-sharing--group": {
        "message": "इस ग्रुप के साथ अपना संवाद जारी रखना है और इसके मेंबर्स के साथ अपना नाम और तस्वीर शेयर करनी है? $learnMore$",
        "description": "Shown when user hasn't shared their profile in a group yet",
        "placeholders": {
            "learnMore": {
                "content": "$1",
                "example": "Learn More."
            }
        }
    },
    "MessageRequests--profile-sharing--direct": {
        "message": "$firstName$ के साथ इस संवाद को जारी रखना है और अपना नाम और फ़ोटो उनके साथ शेयर करनी है? $learnMore$",
        "description": "Shown when user hasn't shared their profile in a 1:1 conversation yet",
        "placeholders": {
            "firstName": {
                "content": "$1",
                "example": "Alice"
            },
            "learnMore": {
                "content": "$2",
                "example": "Learn More."
            }
        }
    },
    "MessageRequests--learn-more": {
        "message": "अधिक जानें।",
        "description": "Shown at the end of profile sharing messages as a link."
    },
    "ConversationHero--members": {
        "message": "$count$ मेंबर्स",
        "description": "Specifies the number of members in a group conversation",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "22"
            }
        }
    },
    "ConversationHero--members-1": {
        "message": "1 सदस्य",
        "description": "Specifies the number of members in a group conversation when there is one member",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "22"
            }
        }
    },
    "member-of-1-group": {
        "message": "$group$ के मेंबर।",
        "description": "Shown in the conversation hero to indicate this user is a member of a mutual group",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            }
        }
    },
    "member-of-2-groups": {
        "message": "$group1$ और $group2$के मेंबर।",
        "description": "Shown in the conversation hero to indicate this user is a member of at least two mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            }
        }
    },
    "member-of-3-groups": {
        "message": "$group1$, $group2$, और $group3$ के मेंबर।",
        "description": "Shown in the conversation hero to indicate this user is a member of at least three mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            },
            "group3": {
                "content": "$3",
                "example": "Friends 🌿"
            }
        }
    },
    "member-of-more-than-3-groups": {
        "message": "$group1$, $group2$, $group3$ और  $remainingCount$ अधिक।",
        "description": "Shown in the conversation hero to indicate this user is a member of at least three mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            },
            "group3": {
                "content": "$3",
                "example": "Friends 🌿"
            },
            "remainingCount": {
                "content": "$4",
                "example": "3"
            }
        }
    },
    "ConversationHero--membership-added": {
        "message": "$name$ ने आपको ग्रुप में शामिल किया।",
        "description": "Shown Indicates that you were added to a group by a given individual.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jeff Smith"
            }
        }
    },
    "no-groups-in-common": {
        "message": "कोई साझा ग्रुप नहीं ",
        "description": "Shown to indicate this user is not a member of any groups"
    },
    "no-groups-in-common-warning": {
        "message": "No groups in common. Review requests carefully.",
        "description": "When a user has no common groups, show this warning"
    },
    "acceptCall": {
        "message": "उत्तर",
        "description": "Shown in tooltip for the button to accept a call (audio or video)"
    },
    "acceptCallWithoutVideo": {
        "message": "वीडियो के बिना जवाब दें",
        "description": "Shown in tooltip for the button to accept a video call without video"
    },
    "declineCall": {
        "message": "रद्द करें",
        "description": "Shown in tooltip for the button to decline a call (audio or video)"
    },
    "declinedIncomingAudioCall": {
        "message": "आपने एक ऑडियो कॉल काट दी",
        "description": "Shown in conversation history when you declined an incoming audio call"
    },
    "declinedIncomingVideoCall": {
        "message": "आपने एक वीडियो कॉल काट दी",
        "description": "Shown in conversation history when you declined an incoming video call"
    },
    "acceptedIncomingAudioCall": {
        "message": "ऑडियो कॉल आ रही है",
        "description": "Shown in conversation history when you accepted an incoming audio call"
    },
    "acceptedIncomingVideoCall": {
        "message": "वीडियो कॉल आ रही है",
        "description": "Shown in conversation history when you accepted an incoming video call"
    },
    "missedIncomingAudioCall": {
        "message": "मिस हुई ऑडियो कॉल",
        "description": "Shown in conversation history when you missed an incoming audio call"
    },
    "missedIncomingVideoCall": {
        "message": "मिस हुई वीडियो कॉल",
        "description": "Shown in conversation history when you missed an incoming video call"
    },
    "acceptedOutgoingAudioCall": {
        "message": "ऑडियो कॉल की जा रही है",
        "description": "Shown in conversation history when you made an outgoing audio call"
    },
    "acceptedOutgoingVideoCall": {
        "message": "वीडियो कॉल की जा रही है",
        "description": "Shown in conversation history when you made an outgoing video call"
    },
    "missedOrDeclinedOutgoingAudioCall": {
        "message": "ऑडियो कॉल जो उठाई नहीं गई",
        "description": "Shown in conversation history when your audio call is missed or declined"
    },
    "missedOrDeclinedOutgoingVideoCall": {
        "message": "वीडियो कॉल जो उठाई नहीं गई",
        "description": "Shown in conversation history when your video call is missed or declined"
    },
    "incomingAudioCall": {
        "message": "ऑडियो कॉल आ रही है...",
        "description": "Shown in both the incoming call bar and notification for an incoming audio call"
    },
    "incomingVideoCall": {
        "message": "वीडियो कॉल आ रही है...",
        "description": "Shown in both the incoming call bar and notification for an incoming video call"
    },
    "outgoingCallPrering": {
        "message": "कॉल की जा रही है...",
        "description": "Shown in the call screen when placing an outgoing call that isn't ringing yet"
    },
    "outgoingCallRinging": {
        "message": "रिंग बज रही है...",
        "description": "Shown in the call screen when placing an outgoing call that is now ringing"
    },
    "makeOutgoingCall": {
        "message": "कॉल शुरू करें",
        "description": "Title for the call button in a conversation"
    },
    "makeOutgoingVideoCall": {
        "message": "वीडियो कॉल शुरू करें",
        "description": "Title for the video call button in a conversation"
    },
    "joinOngoingCall": {
        "message": "जुड़ें",
        "description": "Text that appears in a group when a call is active"
    },
    "callNeedPermission": {
        "message": "$title$ को आपसे एक मेसेज रिक्वेस्ट मिलेगी। आपका मेसेज अनुरोध स्वीकार होने के बाद आप कॉल कर सकते हैं।",
        "description": "Shown when a call is rejected because the other party hasn't approved the message/call request",
        "placeholders": {
            "title": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "callReconnecting": {
        "message": "फिर से जोड़ रहे हैं...",
        "description": "Shown in the call screen when the call is reconnecting due to network issues"
    },
    "callDuration": {
        "message": "Signal $duration$",
        "description": "Shown in the call screen to indicate how long the call has been connected",
        "placeholders": {
            "duration": {
                "content": "$1",
                "example": "00:01"
            }
        }
    },
    "callingDeviceSelection__settings": {
        "message": "सेटिंग्स",
        "description": "Title for device selection settings"
    },
    "calling__participants": {
        "message": "कॉल में $people$",
        "description": "Title for participants list toggle",
        "placeholders": {
            "people": {
                "content": "$1",
                "example": "16"
            }
        }
    },
    "calling__call-notification__ended": {
        "message": "ग्रुप कॉल समाप्त हो गई है",
        "description": "Notification message when a group call has ended"
    },
    "calling__call-notification__started-by-someone": {
        "message": "एक ग्रुप कॉल शुरू की गई थी",
        "description": "Notification message when a group call has started, but we don't know who started it"
    },
    "calling__call-notification__started-by-you": {
        "message": "आपने एक ग्रुप कॉल शुरू की",
        "description": "Notification message when a group call has started by you"
    },
    "calling__call-notification__started": {
        "message": "$name$ ने एक ग्रुप कॉल शुरू की",
        "description": "Notification message when a group call has started",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "calling__call-notification__button__in-another-call-tooltip": {
        "message": "आप पहले ही एक कॉल में हैं",
        "description": "Tooltip in disabled notification button when you're on another call"
    },
    "calling__call-notification__button__call-full-tooltip": {
        "message": "कॉल $max$ भागीदारों की क्षमता पर पहुँच गई है",
        "description": "Tooltip in disabled notification button when the call is full",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "calling__pip--on": {
        "message": "कॉल को मिनिमाइज़ करें",
        "description": "Title for picture-in-picture toggle"
    },
    "calling__pip--off": {
        "message": "कॉल को फुलस्क्रीन करें",
        "description": "Title for picture-in-picture toggle"
    },
    "calling__switch-view--to-grid": {
        "message": "Switch to grid view",
        "description": "Title for grid/speaker view toggle when on a call"
    },
    "calling__switch-view--to-speaker": {
        "message": "Switch to speaker view",
        "description": "Title for grid/speaker view toggle when on a call"
    },
    "calling__hangup": {
        "message": "कॉल छोड़ें",
        "description": "Title for hang up button"
    },
    "calling__SelectPresentingSourcesModal--title": {
        "message": "Share your screen",
        "description": "Title for the select your screen sharing sources modal"
    },
    "calling__SelectPresentingSourcesModal--confirm": {
        "message": "Share screen",
        "description": "Confirm button for sharing screen modal"
    },
    "calling__SelectPresentingSourcesModal--entireScreen": {
        "message": "Entire screen",
        "description": "Title for the select your screen sharing sources modal and 'Entire Screen' source"
    },
    "calling__SelectPresentingSourcesModal--screen": {
        "message": "Screen $id$",
        "description": "Title for `Screen #N` source in screen sharing sources modal and overlay",
        "placeholders": {
            "id": {
                "content": "$1",
                "example": "1"
            }
        }
    },
    "calling__SelectPresentingSourcesModal--window": {
        "message": "A window",
        "description": "Title for the select your screen sharing sources modal"
    },
    "callingDeviceSelection__label--video": {
        "message": "वीडियो",
        "description": "Label for video input selector"
    },
    "callingDeviceSelection__label--audio-input": {
        "message": "माइक्रोफोन",
        "description": "Label for audio input selector"
    },
    "callingDeviceSelection__label--audio-output": {
        "message": "स्पीकर",
        "description": "Label for audio output selector"
    },
    "callingDeviceSelection__select--no-device": {
        "message": "कोई डिवाइस उपलब्ध नहीं हैं",
        "description": "Message for when there are no available devices to select for input/output audio or video"
    },
    "callingDeviceSelection__select--default": {
        "message": "डिफ़ॉल्ट",
        "description": "Shown when the device is the default device"
    },
    "muteNotificationsTitle": {
        "message": "नोटिफिकेशन म्यूट करें",
        "description": "Label for the mute notifications drop-down selector"
    },
    "muteHour": {
        "message": "एक घंटे के लिये म्युट करें",
        "description": "Label for muting the conversation"
    },
    "muteEightHours": {
        "message": "Mute for eight hours",
        "description": "Label for muting the conversation"
    },
    "muteDay": {
        "message": "एक दिन के लिये म्युट करें",
        "description": "Label for muting the conversation"
    },
    "muteWeek": {
        "message": "एक हफ़ते के लिये म्युट करें",
        "description": "Label for muting the conversation"
    },
    "muteAlways": {
        "message": "Mute always",
        "description": "Label for muting the conversation"
    },
    "unmute": {
        "message": "अनम्यूट",
        "description": "Label for unmuting the conversation"
    },
    "muteExpirationLabelAlways": {
        "message": "Muted always",
        "description": "Shown in the mute notifications submenu whenever a conversation has been muted"
    },
    "muteExpirationLabel": {
        "message": "$duration$ तक म्यूट किया गया",
        "description": "Shown in the mute notifications submenu whenever a conversation has been muted",
        "placeholders": {
            "duration": {
                "content": "$1",
                "example": "10/23/2023, 7:10 PM"
            }
        }
    },
    "EmojiButton__label": {
        "message": "इमोजी",
        "description": "Label for emoji button"
    },
    "ErrorModal--title": {
        "message": "कुछ गलत हो गया",
        "description": "Title of pop-up dialog when user-initiated task has gone wrong"
    },
    "ErrorModal--description": {
        "message": "कृपया फिर से प्रयास करें या समर्थन से संपर्क करें।",
        "description": "Description text in pop-up dialog when user-initiated task has gone wrong"
    },
    "Confirmation--confirm": {
        "message": "ठीक है",
        "description": "Button to dismiss pop-up dialog when user-initiated task has gone wrong"
    },
    "unknown-sgnl-link": {
        "message": "Sorry, that sgnl:// link didn't make sense!",
        "description": "Shown if you click on a sgnl:// link not currently supported by Desktop"
    },
    "GroupV2--join--invalid-link--title": {
        "message": "अवैध लिंक",
        "description": "Shown if we are unable to parse a group link"
    },
    "GroupV2--join--invalid-link": {
        "message": "यह एक वैध ग्रुप लिंक नहीं है। जॉइन करने से पहले सुनिश्चित करें कि संपूर्ण लिंक जुड़ा हुआ और सही है।",
        "description": "Shown if we are unable to parse a group link"
    },
    "GroupV2--join--prompt": {
        "message": "क्या आप इस ग्रुप में जुड़ना चाहते हैं और इसके मेंबर्स के साथ अपना नाम और फोटो शेयर करना चाहते हैं?",
        "description": "Shown when you click on a group link to confirm"
    },
    "GroupV2--join--already-in-group": {
        "message": "You're already in this group.",
        "description": "Shown if you click a group link for a group where you're already a member"
    },
    "GroupV2--join--already-awaiting-approval": {
        "message": "You have already requested approval to join this group.",
        "description": "Shown if you click a group link for a group where you've already requested approval'"
    },
    "GroupV2--join--unknown-link-version--title": {
        "message": "Unknown link version",
        "description": "This group link is no longer valid."
    },
    "GroupV2--join--unknown-link-version": {
        "message": "This link is not supported by this version of Signal Desktop.",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--link-revoked--title": {
        "message": "Can’t Join Group",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--link-revoked": {
        "message": "यह ग्रुप लिंक अब वैध नहीं रहा।",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--prompt-with-approval": {
        "message": "An admin of this group must approve your request before you can join this group. If approved, your name and photo will be shared with its members.",
        "description": "Shown when you click on a group link to confirm, if it requires admin approval"
    },
    "GroupV2--join--join-button": {
        "message": "जुड़ें",
        "description": "The button to join the group"
    },
    "GroupV2--join--request-to-join-button": {
        "message": "Request to Join",
        "description": "The button to join the group, if approval is required"
    },
    "GroupV2--join--cancel-request-to-join": {
        "message": "निवेदन रद्द करें",
        "description": "The button to cancel request to join the group"
    },
    "GroupV2--join--cancel-request-to-join--confirmation": {
        "message": "इस ग्रुप में जुड़ने का अपना निवेदन रद्द करना है?",
        "description": "A confirmation message that shows after you click the button"
    },
    "GroupV2--join--cancel-request-to-join--yes": {
        "message": "हाँ ",
        "description": "Choosing to continue in the cancel join confirmation dialog"
    },
    "GroupV2--join--cancel-request-to-join--no": {
        "message": "नहीं",
        "description": "Choosing not to continue in the cancel join confirmation dialog"
    },
    "GroupV2--join--member-count--single": {
        "message": "1 सदस्य",
        "description": "Shown in the metadata section if group has just one member"
    },
    "GroupV2--join--member-count--multiple": {
        "message": "$count$ मेंबर्स",
        "description": "Shown in the metadata section if group has more than one member",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "12"
            }
        }
    },
    "GroupV2--join--group-metadata": {
        "message": "Group · $memberCount$",
        "description": "A holder for two pieces of information - the type of conversation, and the member count",
        "placeholders": {
            "memberCount": {
                "content": "$1",
                "example": "12 members"
            }
        }
    },
    "GroupV2--join--requested": {
        "message": "आपका ग्रुप में शामिल होने का अनुरोध ग्रुप ऐडमिन को भेजा जा चुका है। जब वे उस पर अमल करेंगे तब आपको सूचित किया जाएगा।",
        "description": "Shown in composition area when you've requested to join a group"
    },
    "GroupV2--join--general-join-failure--title": {
        "message": "Link Error",
        "description": "Shown if something went wrong when you try to join via a group link"
    },
    "GroupV2--join--general-join-failure": {
        "message": "Joining via this link failed. Try joining again later.",
        "description": "Shown if something went wrong when you try to join via a group link"
    },
    "GroupV2--admin": {
        "message": "एडमिन",
        "description": "Label for a group administrator"
    },
    "GroupV2--only-admins": {
        "message": "सिर्फ़ एडमिन",
        "description": "Label for group administrators -- used in drop-downs to select permissions that apply to admins"
    },
    "GroupV2--all-members": {
        "message": "सभी सदस्य",
        "description": "Label for describing the general non-privileged members of a group"
    },
    "updating": {
        "message": "अपडेट हो रहा है...",
        "description": "Shown along with a spinner when an update operation takes longer than one second"
    },
    "GroupV2--create--you": {
        "message": "यह ग्रूप आपने बनाया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--create--other": {
        "message": "$memberName$ ने ग्रुप बनाया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--create--unknown": {
        "message": "ग्रुप बन गया था।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--title--change--other": {
        "message": "$memberName$ ने ग्रुप का नाम बदल कर \"$newTitle$\" रख दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            },
            "newTitle": {
                "content": "$2",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--change--you": {
        "message": "आपने ग्रुप का नाम बदल कर \"$newTitle$\" रख दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "newTitle": {
                "content": "$1",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--change--unknown": {
        "message": "एक मेंबर ने ग्रुप का नाम बदल कर \"$newTitle$\" रख दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "newTitle": {
                "content": "$1",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--remove--other": {
        "message": "$memberName$ ने ग्रुप का नाम हटा दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--title--remove--you": {
        "message": "आपने ग्रूप का नाम हटा दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--title--remove--unknown": {
        "message": "एक मेंबर ने ग्रुप का नाम हटा दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--change--other": {
        "message": "$memberName$ ने ग्रुप का अवतार बदल दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--avatar--change--you": {
        "message": "आपने ग्रुप का अवतार बदल दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--change--unknown": {
        "message": "एक मेंबर ने ग्रुप का अवतार बदल दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--remove--other": {
        "message": "$memberName$ ने ग्रुप का अवतार हटा दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--avatar--remove--you": {
        "message": "आपने ग्रुप का अवतार हटा दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--remove--unknown": {
        "message": "एक मेंबर ने ग्रुप का अवतार हटा दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--admins--other": {
        "message": "$adminName$ ने ग्रुप की जानकारी बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-attributes--admins--you": {
        "message": "आपने ग्रुप की जानकारी बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--admins--unknown": {
        "message": "एक एडमिन ने ग्रुप की जानकारी बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--all--other": {
        "message": "$adminName$ ने ग्रुप की जानकारी बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-attributes--all--you": {
        "message": "आपने ग्रुप की जानकारी बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--all--unknown": {
        "message": "एक एडमिन ने ग्रुप की जानकारी बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--admins--other": {
        "message": "$adminName$ ने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-members--admins--you": {
        "message": "आपने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--admins--unknown": {
        "message": "एक एडमिन ने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"केवल एडमिन्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--all--other": {
        "message": "$adminName$ ने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-members--all--you": {
        "message": "आपने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--all--unknown": {
        "message": "एक एडमिन ने ग्रुप की मेंबरशिप बदल पाने का अधिकार \"सभी मेंबर्स\" को दे दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--disabled--you": {
        "message": "You disabled admin approval for the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--disabled--other": {
        "message": "$adminName$ disabled admin approval for the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--access-invite-link--disabled--unknown": {
        "message": "Admin approval for the group link has been disabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--enabled--you": {
        "message": "You enabled admin approval for the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--enabled--other": {
        "message": "$adminName$ enabled admin approval for the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--access-invite-link--enabled--unknown": {
        "message": "Admin approval for the group link has been enabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--invited--you": {
        "message": "आपने आमंत्रित मेंबर $inviteeName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--invited--other": {
        "message": "$memberName$ ने आमंत्रित मेंबर $inviteeName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Alice"
            },
            "inviteeName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--invited--unknown": {
        "message": "एक मेंबर ने आमंत्रित मेंबर $inviteeName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--from-invite--other": {
        "message": "$inviteeName$ ने $inviterName$ का ग्रुप से जुड़ने का आमंत्रण स्वीकार कर लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            },
            "inviterName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--from-invite--other-no-from": {
        "message": "$inviteeName$ ने ग्रुप से जुड़ने का आमंत्रण स्वीकार कर लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--from-invite--you": {
        "message": "आपने $inviterName$ का ग्रुप से जुड़ने का आमंत्रण स्वीकार कर लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--from-invite--you-no-from": {
        "message": "आपने ग्रूप से जुङने का आमंत्रण स्वीकार किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--from-invite--from-you": {
        "message": "$inviteeName$ ने ग्रुप से जुड़ने का आपका आमंत्रण स्वीकार कर लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--other--other": {
        "message": "$adderName$ ने $addeeName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adderName": {
                "content": "$1",
                "example": "Bob"
            },
            "addeeName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--other--you": {
        "message": "आपने $memberName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--other--unknown": {
        "message": "एक मेंबर ने $memberName$ को शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--you--other": {
        "message": "$memberName$ ने आपको ग्रुप में शामिल किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--you--you": {
        "message": "आप ग्रुप में शामिल हो गए हैं।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--you--unknown": {
        "message": "आपको ग्रुप में शामिल किया गया था।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-link--you--you": {
        "message": "आप ग्रुप लिंक के माध्यम से ग्रुप में जुड़े।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-link--other": {
        "message": "$memberName$ joined the group via the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--you--other": {
        "message": "$adminName$ approved your request to join the group.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--you--unknown": {
        "message": "आपका ग्रुप से जुड़ने का निवेदन स्वीकारा जा चूका है। ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-admin-approval--other--you": {
        "message": "You approved a request to join the group from $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--other--other": {
        "message": "$adminName$ approved a request to join the group from $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--other--unknown": {
        "message": "A request to join the group from $joinerName$ has been approved.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-remove--other--other": {
        "message": "$adminName$ ने $memberName$ को निकाल दिया। ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-remove--other--self": {
        "message": "$memberName$ ने ग्रुप छोड़ दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--other--you": {
        "message": "आपने $memberName$ को निकाल दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--other--unknown": {
        "message": "एक मेंबर ने $memberName$ को निकाल दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--you--other": {
        "message": "$adminName$ ने आपको निकाल दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--you--you": {
        "message": "आपने ग्रुप को छोड़ दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-remove--you--unknown": {
        "message": "आप ग्रूप से हटाए गये थे।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--promote--other--other": {
        "message": "$adminName$ ने $memberName$ को एक एडमिन बना दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-privilege--promote--other--you": {
        "message": "आपने $memberName$ को एक एडमिन बना दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--other--unknown": {
        "message": "एक एडमिन ने $memberName$ को एडमिन बना दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--you--other": {
        "message": "$adminName$ ने आपको एक एडमिन बना दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--you--unknown": {
        "message": "एक एडमिन ने आपको एडमिन बना दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--demote--other--other": {
        "message": "$adminName$ ने $memberName$ के एडमिन अधिकार वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-privilege--demote--other--you": {
        "message": "आपने $memberName$ के एडमिन अधिकार वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--demote--other--unknown": {
        "message": "एक एडमिन ने $memberName$के एडमिन अधिकार वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--demote--you--other": {
        "message": "$adminName$ ने आपके एडमिन अधिकार वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--demote--you--unknown": {
        "message": "एक एडमिन ने आपके एडमिन अधिकार वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-add--one--other--other": {
        "message": "$memberName$ ने 1 व्यक्ति को ग्रुप में आमंत्रित किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--other--you": {
        "message": "आपने $inviteeName$ को ग्रुप में आंमत्रित किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--other--unknown": {
        "message": "एक व्यक्ति को ग्रुप में आमंत्रित किया गया था।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--you--other": {
        "message": "$memberName$ ने आपको ग्रुप में आमंत्रित किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--you--unknown": {
        "message": "आपको ग्रूप से जुङने के लिये आमंत्रित किया गया था।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-add--many--other": {
        "message": "$memberName$ ने $count$ लोगों को ग्रुप में आमंत्रित किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-add--many--you": {
        "message": "आपने $count$ लोगों को ग्रुप में आमंत्रित किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-add--many--unknown": {
        "message": "$count$ लोगों को ग्रुप में आमंत्रित किया गया था।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--decline--other": {
        "message": "$memberName$ द्वारा आमंत्रित 1 व्यक्ति ने ग्रूप से जुङना अस्वीकार किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--decline--you": {
        "message": "$inviteeName$ ने ग्रुप से जुड़ने का आपका आमंत्रण अस्वीकार कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--decline--from-you": {
        "message": "आपने ग्रुप के आमंत्रण को अस्वीकार कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-remove--decline--unknown": {
        "message": "1 व्यक्ति ने ग्रुप से जुड़ने का आमंत्रण अस्वीकार कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-remove--revoke--one--other": {
        "message": "$memberName$ ने 1 व्यक्ति का ग्रुप से जुड़ने का आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--one--you": {
        "message": "आपने 1 व्यक्ति का ग्रूप से जुङने का आमंत्रण वापस लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-own--to-you": {
        "message": "$inviterName$ ने आपको भेजना अपना आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-own--unknown": {
        "message": "$inviterName$ ने 1 व्यक्ति को भेजा अपना आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--one--unknown": {
        "message": "एक एडमिन ने 1  व्यक्ति को ग्रुप के लिए भेजा आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--other": {
        "message": "$memberName$ व्यक्ति ने $count$ लोगों को ग्रुप के लिए भेजा आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--you": {
        "message": "आपने $count$ लोगों को ग्रुप के लिए भेजा आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--unknown": {
        "message": "एक एडमिन ने $count$ लोगों को ग्रुप के लिए भेजा आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--other": {
        "message": "$adminName$ ने $memberName$ द्वारा ग्रुप के लिए आमंत्रित 1 व्यक्ति का आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--you": {
        "message": "आपने $memberName$ द्वारा आमंत्रित 1 व्यक्ति का ग्रुप से जुड़ने का आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--unknown": {
        "message": "एक एडमिन ने $memberName$ द्वारा ग्रुप के लिए आमंत्रित 1 व्यक्ति का आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--other": {
        "message": "$adminName$ ने आपके द्वारा $inviteeName$ को भेजे ग्रुप के आमंत्रण को वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--you": {
        "message": "आपने $inviteeName$ को भेजा अपना आमंत्रण रद्द किया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--unknown": {
        "message": "एक एडमिन ने आपके द्वारा $inviteeName$ को ग्रुप के लिए भेजा अपना आमंत्रण वापस ले लिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--other": {
        "message": "$adminName$ ने $memberName$ द्वारा ग्रुप के लिए आमंत्रित $count$ लोगों के आमंत्रण वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--you": {
        "message": "आपने $memberName$ द्वारा ग्रुप के लिए आमंत्रित $count$ लोगों के आमंत्रण वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "memberName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--unknown": {
        "message": "एक एडमिन ने $memberName$ द्वारा ग्रुप के लिए आमंत्रित $count$ लोगों के आमंत्रण वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "memberName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--other": {
        "message": "$adminName$ ने आपके द्वारा ग्रुप के लिए $count$ लोगों को भेजे आमंत्रण वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--you": {
        "message": "आपने अपना $count$ लोगों को भेजा आमंत्रण रद्द कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--unknown": {
        "message": "एक एडमिन ने आपके द्वारा ग्रुप के लिए $count$ लोगों को भेजे आमंत्रण वापस ले लिए।",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--admin-approval-add-one--you": {
        "message": "आपने ग्रुप में जुड़ने के लिए अनुरोध भेजा।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-add-one--other": {
        "message": "$joinerName$ requested to join via the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--you--you": {
        "message": "आपने ग्रुप में जुड़ने के अपने अनुरोध को रद्द कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-remove-one--you--unknown": {
        "message": "एडमिन ने आपका इस ग्रुप से जुड़ने का निवेदन खरिज कर दिया है। ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-remove-one--other--you": {
        "message": "You denied a request to join the group from $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--other--own": {
        "message": "$joinerName$ canceled their request to join the group.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--other--other": {
        "message": "$adminName$ denied a request to join the group from $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "joinerName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--disabled--you": {
        "message": "You turned on the group link with admin approval disabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--disabled--other": {
        "message": "$adminName$ turned on the group link with admin approval disabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--disabled--unknown": {
        "message": "The group link has been turned on with admin approval disabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--enabled--you": {
        "message": "You turned on the group link with admin approval enabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--enabled--other": {
        "message": "$adminName$ turned on the group link with admin approval enabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--enabled--unknown": {
        "message": "The group link has been turned on with admin approval enabled.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-remove--you": {
        "message": "आपने ग्रुप लिंक को बंद कर दिया।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-remove--other": {
        "message": "$adminName$ turned off the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-remove--unknown": {
        "message": "इस ग्रुप कि लिंक बंद कर दी गयी है ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-reset--you": {
        "message": "आपने ग्रुप लिंक को रीसेट कर दिया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-reset--other": {
        "message": "$adminName$ reset the group link.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-reset--unknown": {
        "message": "ग्रुप लिंक को रीसेट कर दिया गया है।",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--remove--you": {
        "message": "You removed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--remove--other": {
        "message": "$memberName$ removed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--description--remove--unknown": {
        "message": "The group description was removed.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--change--you": {
        "message": "You changed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--change--other": {
        "message": "$memberName$ changed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--description--change--unknown": {
        "message": "The group description was changed.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV1--Migration--disabled": {
        "message": "नए फ़ीचर्स जैसे कि @mentions और एडमिन को एक्टिवेट करने के लिए इस ग्रुप को अपग्रेड करें। वे मेंबर जिन्होंने इस ग्रुप में अपना नाम और तस्वीर शेयर नहीं की है, उन्हें शामिल होने के लिए आमंत्रित किया जाएगा। $learnMore$",
        "description": "Shown instead of composition area when user is forced to migrate a legacy group (GV1).",
        "placeholders": {
            "learnMore": {
                "content": "$1",
                "example": "Learn more."
            }
        }
    },
    "GroupV1--Migration--was-upgraded": {
        "message": "इस ग्रुप को एक नए ग्रुप में अपग्रेड किया गया था।",
        "description": "Shown in timeline when a legacy group (GV1) is upgraded to a new group (GV2)"
    },
    "GroupV1--Migration--learn-more": {
        "message": "और जानें",
        "description": "Shown on a bubble below a 'group was migrated' timeline notification, or as button on Migrate dialog"
    },
    "GroupV1--Migration--migrate": {
        "message": "अपग्रेड",
        "description": "Shown on Migrate dialog to kick off the process"
    },
    "GroupV1--Migration--info--title": {
        "message": "नए समूह क्या हैं?",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--migrate--title": {
        "message": "नए समूह में अपग्रेड करें",
        "description": "Shown on Migration popup after choosing to migrate group"
    },
    "GroupV1--Migration--info--summary": {
        "message": "नए ग्रुप्स में कई फीचर्स हैं जैसे कि @mentions और ग्रुप एडमिन, और भविष्य में और भी कई फीचर शामिल किए जाएँगे।",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--keep-history": {
        "message": "अपग्रेड करने से पहले के सभी मेसेज इतिहास और मीडिया को रख लिया गया है।",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--migrate--keep-history": {
        "message": "अपग्रेड करने से पहले के सभी मेसेज इतिहास और मीडिया को रख लिया जाएगा।",
        "description": "Shown on Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--invited--you": {
        "message": "इस ग्रुप में दोबारा जुड़ने के लिए बस आपको आमंत्रण को स्वीकार करना होगा, और जब तक आप स्वीकार नहीं कर लेते, आपको ग्रुप के मेसेज प्राप्त नहीं होंगे।",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--info--invited--many": {
        "message": "इस ग्रुप में दोबारा जुड़ने के लिए इन मेंबर्स को आमंत्रण को स्वीकार करना होगा, और जब तक वे स्वीकार नहीं कर लेते, उन्हें ग्रुप के मेसेज प्राप्त नहीं होंगे:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--invited--one": {
        "message": "इस ग्रुप में दोबारा जुड़ने के लिए इस मेंबर को आमंत्रण को स्वीकार करना होगा, और जब तक वे स्वीकार नहीं कर लेते, उन्हें ग्रुप के मेसेज प्राप्त नहीं होंगे:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--before--many": {
        "message": "ये मेंबर नए ग्रुपस में शामिल होने के योग्य नहीं हैं, और इन्हें ग्रुप में से निकाल दिया जाएगा:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--before--one": {
        "message": "यह मेंबर नए ग्रुपस में शामिल होने के योग्य नहीं है, और इन्हें ग्रुप में से निकाल दिया जाएगा:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--after--many": {
        "message": "ये मेंबर नए ग्रुप्स में शामिल होने के योग्य नहीं थे, और इन्हें ग्रुप में से निकाल दिया गया था:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--after--one": {
        "message": "यह मेंबर नए ग्रुप्स में शामिल होने के योग्य नहीं था, और इन्हें ग्रुप में से निकाल दिया गया था:",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--invited--you": {
        "message": "आपको नए ग्रुप में शमिल नहीं किया जा सका और आपको शामिल होने के लिए आमंत्रित किया गया है।",
        "description": "Shown in timeline when a group is upgraded and you were invited instead of added"
    },
    "GroupV1--Migration--invited--one": {
        "message": "$contact$ को नए ग्रुप में शमिल नहीं किया जा सका और उन्हें शामिल होने के लिए आमंत्रित किया गया है।",
        "description": "Shown in timeline when a group is upgraded and one person was invited, instead of added",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--invited--many": {
        "message": "$count$ मेंबर्स को नए ग्रुप में शमिल नहीं किया जा सका और उन्हें शामिल होने के लिए आमंत्रित किया गया है।",
        "description": "Shown in timeline when a group is upgraded and some people were invited, instead of added",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--removed--one": {
        "message": "$contact$ को ग्रुप में से निकाल दिया गया था।",
        "description": "Shown in timeline when a group is upgraded and one person was removed entirely during the upgrade",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--removed--many": {
        "message": "$count$ मेंबर्स को ग्रुप में से निकाल दिया गया था।",
        "description": "Shown in timeline when a group is upgraded and some people were removed entirely during the upgrade",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "close": {
        "message": "बंद करो",
        "description": "Generic close label"
    },
    "previous": {
        "message": "पिछला",
        "description": "Generic previous label"
    },
    "next": {
        "message": "अगला",
        "description": "Generic next label"
    },
    "CompositionArea--expand": {
        "message": "बड़ा करें",
        "description": "Aria label for expanding composition area"
    },
    "CompositionArea--attach-file": {
        "message": "फ़ाइल अटैच करें",
        "description": "Aria label for file attachment button in composition area"
    },
    "CompositionArea--sms-only__title": {
        "message": "This person isn’t using Signal",
        "description": "Title for the composition area for the SMS-only contact"
    },
    "CompositionArea--sms-only__body": {
        "message": "Signal Desktop does not support messaging non-Signal contacts. Ask this person to install Signal for a more secure messaging experience.",
        "description": "Body for the composition area for the SMS-only contact"
    },
    "CompositionArea--sms-only__spinner-label": {
        "message": "Checking contact's registration status",
        "description": "Displayed while checking if the contact is SMS-only"
    },
    "countMutedConversationsDescription": {
        "message": "बैज काउंट में म्यूट किए हुए संवाद गिनें",
        "description": "Description for counting muted conversations in badge setting"
    },
    "ContactModal--message": {
        "message": "मेसेज",
        "description": "Button text for send message button in Group Contact Details modal"
    },
    "ContactModal--rm-admin": {
        "message": "संचालक के रूप में हटाएँ ",
        "description": "Button text for removing as admin button in Group Contact Details modal"
    },
    "ContactModal--make-admin": {
        "message": "एडमिन बनाएँ",
        "description": "Button text for make admin button in Group Contact Details modal"
    },
    "ContactModal--make-admin-info": {
        "message": "$contact$ will be able to edit this group and its members.",
        "description": "Shown in a confirmation dialog when you are about to grant admin privileges to someone",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Homer"
            }
        }
    },
    "ContactModal--rm-admin-info": {
        "message": "Remove $contact$ as group admin",
        "description": "Shown in a confirmation dialog when you are about to remove admin privileges from someone",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Homer"
            }
        }
    },
    "ContactModal--remove-from-group": {
        "message": "ग्रूप से हटाएँ",
        "description": "Button text for remove from group button in Group Contact Details modal"
    },
    "showChatColorEditor": {
        "message": "चैट का रंग",
        "description": "This is a button in the conversation context menu to show the chat color editor"
    },
    "showConversationDetails": {
        "message": "ग्रुप सेटिंग्स",
        "description": "This is a button in the conversation context menu to show group settings"
    },
    "ConversationDetails--group-link": {
        "message": "समूह लिंक",
        "description": "This is the label for the group link management panel"
    },
    "ConversationDetails--disappearing-messages-label": {
        "message": "गायब होने वाले मेसेज",
        "description": "This is the label for the disappearing messages setting panel"
    },
    "ConversationDetails--disappearing-messages-info": {
        "message": "When enabled, messages sent and received in this group will disappear after they've been seen.",
        "description": "This is the info about the disappearing messages setting"
    },
    "ConversationDetails--group-info-label": {
        "message": "Who can edit group info",
        "description": "This is the label for the 'who can edit the group' panel"
    },
    "ConversationDetails--group-info-info": {
        "message": "Choose who can edit group name, photo, description, and disappearing messages timer.",
        "description": "This is the additional info for the 'who can edit the group' panel"
    },
    "ConversationDetails--add-members-label": {
        "message": "Who can add members",
        "description": "This is the label for the 'who can add members' panel"
    },
    "ConversationDetails--add-members-info": {
        "message": "Choose who can add members to this group.",
        "description": "This is the additional info for the 'who can add members' panel"
    },
    "ConversationDetails--requests-and-invites": {
        "message": "Requests & Invites",
        "description": "This is a button to display which members have been invited but have not joined yet"
    },
    "ConversationDetailsActions--leave-group": {
        "message": "समूह छोड़ दें",
        "description": "This is a button to leave a group"
    },
    "ConversationDetailsActions--block-group": {
        "message": "समूह को ब्लाॅक करें",
        "description": "This is a button to block a group"
    },
    "ConversationDetailsActions--leave-group-must-choose-new-admin": {
        "message": "इससे पहले कि आप छोड़ें, आपको इस ग्रुप के लिए कम से कम एक नया एडमिन चुनना होगा।",
        "description": "Shown if, before leaving a group, you need to choose an admin"
    },
    "ConversationDetailsActions--leave-group-modal-title": {
        "message": "क्या आपको यकीन है आप यह समूर छोङना चाहते हैं? ",
        "description": "This is the modal title for confirming leaving a group"
    },
    "ConversationDetailsActions--leave-group-modal-content": {
        "message": "अब आप इस ग्रुप मे कोई मेसेज भेज या प्राप्त नहीं कर पाऐंगे। ",
        "description": "This is the modal content for confirming leaving a group"
    },
    "ConversationDetailsActions--leave-group-modal-confirm": {
        "message": "छोङें",
        "description": "This is the modal button to confirm leaving a group"
    },
    "ConversationDetailsActions--block-group-modal-title": {
        "message": "Block and Leave the \"$groupName$\" Group?",
        "description": "This is the modal title for confirming blocking a group",
        "placeholders": {
            "groupName": {
                "content": "$1",
                "example": "Our Conversation"
            }
        }
    },
    "ConversationDetailsActions--block-group-modal-content": {
        "message": "अब आपको इस ग्रुप से कोई संदेश या अपडेट नहीं मिलेंगे।",
        "description": "This is the modal content for confirming blocking a group"
    },
    "ConversationDetailsActions--block-group-modal-confirm": {
        "message": "ब्लॉक",
        "description": "This is the modal button to confirm blocking a group"
    },
    "ConversationDetailsHeader--members": {
        "message": "$number$ members",
        "description": "This is the number of members in a group",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "ConversationDetailsMediaList--shared-media": {
        "message": "शेयर किया गया मीडिया",
        "description": "Title for the media thumbnails in the conversation details screen"
    },
    "ConversationDetailsMediaList--show-all": {
        "message": "सभी देखें",
        "description": "This is a button on the conversation details to show all media"
    },
    "ConversationDetailsMembershipList--title": {
        "message": "$number$ members",
        "description": "The title of the membership list panel",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "ConversationDetailsMembershipList--add-members": {
        "message": "मेंबर्स जोड़ें",
        "description": "The button that you can click to add new members"
    },
    "ConversationDetailsMembershipList--show-all": {
        "message": "सभी देखें",
        "description": "This is a button on the conversation details to show all members"
    },
    "GroupLinkManagement--clipboard": {
        "message": "Group link copied.",
        "description": "Shown in a toast when a user selects to copy group link"
    },
    "GroupLinkManagement--share": {
        "message": "Copy link",
        "description": "This lets users share their group link"
    },
    "GroupLinkManagement--confirm-reset": {
        "message": "क्या आप वाक़ई ग्रुप लिंक को रीसेट करना चाहते हैं? लोग वर्तमान लिंक का इस्तेमाल करके ग्रुप में शामिल नहीं हो सकेंगे।",
        "description": "Shown in the confirmation dialog when an admin is about to reset the group link"
    },
    "GroupLinkManagement--reset": {
        "message": "रीसेट लिंक",
        "description": "This lets users generate a new group link"
    },
    "GroupLinkManagement--approve-label": {
        "message": "नए सदस्यों का अनुमोदन करें",
        "description": "Title for the approve new members select area"
    },
    "GroupLinkManagement--approve-info": {
        "message": "Require an admin to approve new members joining via the group link",
        "description": "Description for the approve new members select area"
    },
    "PendingInvites--tab-requests": {
        "message": "Requests ($count$)",
        "description": "Label for the tab to view pending requests",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "4"
            }
        }
    },
    "PendingInvites--tab-invites": {
        "message": "Invites ($count$)",
        "description": "Label for the tab to view pending invites",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "PendingRequests--approve-for": {
        "message": "Approve request from \"$name$\"?",
        "description": "This is the modal content when confirming approving a group request to join",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Meowsy Purrington"
            }
        }
    },
    "PendingRequests--deny-for": {
        "message": "Deny request from \"$name$\"?",
        "description": "This is the modal content when confirming denying a group request to join",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Meowsy Purrington"
            }
        }
    },
    "PendingInvites--invites": {
        "message": "Invited by you",
        "description": "This is the title list of all invites"
    },
    "PendingInvites--invited-by-you": {
        "message": "Invited by you",
        "description": "This is the title for the list of members you have invited"
    },
    "PendingInvites--invited-by-others": {
        "message": "Invited by others",
        "description": "This is the title for the list of members who have invited other people"
    },
    "PendingInvites--invited-count": {
        "message": "Invited $number$",
        "description": "This is the label for the number of members someone has invited",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "PendingInvites--revoke-for-label": {
        "message": "Revoke group invite",
        "description": "This is aria label for revoking a group invite icon"
    },
    "PendingInvites--revoke-for": {
        "message": "Revoke group invite for \"$name$\"?",
        "description": "This is the modal content when confirming revoking a single invite",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            },
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke-from-singular": {
        "message": "Revoke 1 invite sent by \"$name$\"?",
        "description": "This is the modal content when confirming revoking a single invite",
        "placeholders": {
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke-from-plural": {
        "message": "Revoke $number$ invites sent by \"$name$\"",
        "description": "This is the modal content when confirming revoking multiple invites",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            },
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke": {
        "message": "Revoke",
        "description": "This is the modal button to confirm revoking invites"
    },
    "PendingRequests--approve": {
        "message": "Approve Request",
        "description": "This is the modal button to approve group request to join"
    },
    "PendingRequests--deny": {
        "message": "निवेदन को अस्वीकार करें",
        "description": "This is the modal button to deny group request to join"
    },
    "PendingRequests--info": {
        "message": "People on this list are attempting to join \"$name$\" via the group link.",
        "description": "Inforamtion shown below the pending admin approval list",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Tahoe List"
            }
        }
    },
    "PendingInvites--info": {
        "message": "Details about people invited to this group aren’t shown until they join. Invitees will only see messages after they join the group.",
        "description": "Information shown below the invite list"
    },
    "AvatarInput--no-photo-label--group": {
        "message": "Add a group photo",
        "description": "The label for the avatar uploader when no group photo is selected"
    },
    "AvatarInput--change-photo-label": {
        "message": "Change photo",
        "description": "The label for the avatar uploader when a photo is selected"
    },
    "AvatarInput--upload-photo-choice": {
        "message": "Upload photo",
        "description": "The button text when you click on an uploaded avatar and want to upload a new one"
    },
    "AvatarInput--remove-photo-choice": {
        "message": "तस्वीर हटाओ",
        "description": "The button text when you click on an uploaded avatar and want to remove it"
    },
    "ContactPill--remove": {
        "message": "Remove contact",
        "description": "The label for the 'remove' button on the contact pill"
    },
    "ComposeErrorDialog--close": {
        "message": "ठीक है",
        "description": "The text on the button when there's an error in the composer"
    },
    "NewlyCreatedGroupInvitedContactsDialog--title--one": {
        "message": "Invitation sent",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--title--many": {
        "message": "$count$ invitations sent",
        "description": "When creating a new group and inviting users, this is shown in the dialog",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--user-paragraph--one": {
        "message": "$name$ can’t be automatically added to this group by you.",
        "description": "When creating a new group and inviting users, this is shown in the dialog",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--user-paragraph--many": {
        "message": "These users can’t be automatically added to this group by you.",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--info-paragraph": {
        "message": "They’ve been invited to join, and won’t see any group messages until they accept.",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--learn-more": {
        "message": "अधिक जानें",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "AddGroupMembersModal--title": {
        "message": "मेंबर्स जोड़ें",
        "description": "When adding new members to an existing group, this is shown in the dialog"
    },
    "AddGroupMembersModal--continue-to-confirm": {
        "message": "अपडेट",
        "description": "When adding new members to an existing group, this is shown in the dialog"
    },
    "AddGroupMembersModal--confirm-title--one": {
        "message": "Add $person$ to \"$group$\"?",
        "description": "When adding new members to an existing group, this is shown in the confirmation dialog",
        "placeholders": {
            "person": {
                "content": "$1",
                "example": "Jane Doe"
            },
            "group": {
                "content": "$2",
                "example": "Tahoe Trip"
            }
        }
    },
    "AddGroupMembersModal--confirm-title--many": {
        "message": "Add $count$ members to \"$group$\"?",
        "description": "When adding new members to an existing group, this is shown in the confirmation dialog",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "group": {
                "content": "$2",
                "example": "Tahoe Trip"
            }
        }
    },
    "AddGroupMembersModal--confirm-button--one": {
        "message": "Add member",
        "description": "When adding new members to an existing group, this is shown on the confirmation dialog button"
    },
    "AddGroupMembersModal--confirm-button--many": {
        "message": "मेंबर्स जोड़ें",
        "description": "When adding new members to an existing group, this is shown on the confirmation dialog button"
    },
    "createNewGroupButton": {
        "message": "नया ग्रुप",
        "description": "The text of the button to create new groups"
    },
    "selectContact": {
        "message": "Select contact",
        "description": "The label for contact checkboxes that are non-selected (clicking them should select the contact)"
    },
    "deselectContact": {
        "message": "De-select contact",
        "description": "The label for contact checkboxes that are selected (clicking them should de-select the contact)"
    },
    "cannotSelectContact": {
        "message": "Cannot select contact",
        "description": "The label for contact checkboxes that are disabled"
    },
    "alreadyAMember": {
        "message": "Already a member",
        "description": "The label for contact checkboxes that are disabled because they're already a member"
    },
    "MessageAudio--play": {
        "message": "Play audio attachment",
        "description": "Aria label for audio attachment's Play button"
    },
    "MessageAudio--pause": {
        "message": "Pause audio attachment",
        "description": "Aria label for audio attachment's Pause button"
    },
    "MessageAudio--download": {
        "message": "Download audio attachment",
        "description": "Aria label for audio attachment's Download button"
    },
    "MessageAudio--pending": {
        "message": "Downloading audio attachment...",
        "description": "Aria label for pending audio attachment spinner"
    },
    "MessageAudio--slider": {
        "message": "Playback time of audio attachment",
        "description": "Aria label for audio attachment's playback time slider"
    },
    "emptyInboxMessage": {
        "message": "Click the $composeIcon$ above and search for your contacts or groups to message.",
        "description": "Shown in the left-pane when the inbox is empty",
        "placeholders": {
            "composeIcon": {
                "content": "$1",
                "example": "compose button"
            }
        }
    },
    "composeIcon": {
        "message": "compose button",
        "description": "Shown in the left-pane when the inbox is empty. Describes the button that composes a new message."
    },
    "ForwardMessageModal--continue": {
        "message": "आगे ",
        "description": "aria-label for the 'next' button in the forward a message modal dialog"
    },
    "MessageRequestWarning__learn-more": {
        "message": "अधिक जानें",
        "description": "Shown on the message request warning. Clicking this button will open a dialog with more information"
    },
    "MessageRequestWarning__dialog__details": {
        "message": "You have no groups in common with this person. Review requests carefully before accepting to avoid unwanted messages.",
        "description": "Shown in the message request warning dialog. Gives more information about message requests"
    },
    "MessageRequestWarning__dialog__learn-even-more": {
        "message": "About Message Requests",
        "description": "Shown in the message request warning dialog. Clicking this button will open a page on Signal's support site"
    },
    "ContactSpoofing__same-name": {
        "message": "Review requests carefully. Signal found another contact with the same name. $link$",
        "description": "Shown in the timeline warning when you have a message request from someone with the same name as someone else",
        "placeholders": {
            "link": {
                "content": "$1",
                "example": "Review request"
            }
        }
    },
    "ContactSpoofing__same-name-in-group": {
        "message": "$count$ group members have the same name. $link$",
        "description": "Shown in the timeline warning when you multiple group members have the same name",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            },
            "link": {
                "content": "$2",
                "example": "Tap to review"
            }
        }
    },
    "ContactSpoofing__same-name__link": {
        "message": "Review request",
        "description": "Shown in the timeline warning when you have a message request from someone with the same name as someone else"
    },
    "ContactSpoofing__same-name-in-group__link": {
        "message": "Click to review",
        "description": "Shown in the timeline warning when you multiple group members have the same name"
    },
    "ContactSpoofingReviewDialog__title": {
        "message": "Review request",
        "description": "Title for the contact name spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__description": {
        "message": "अगर आप इस निवेदन को भेजने वाले के बारे में निश्चित नहीं हों, तो निचे दिए गए संपर्कों की समीक्षा करें और कार्रवाई करें।",
        "description": "Description for the contact spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__possibly-unsafe-title": {
        "message": "निवेदन ",
        "description": "Header in the contact spoofing review dialog, shown above the potentially-unsafe user"
    },
    "ContactSpoofingReviewDialog__safe-title": {
        "message": "आपकी संपर्क जानकारी ",
        "description": "Header in the contact spoofing review dialog, shown above the \"safe\" user"
    },
    "ContactSpoofingReviewDialog__group__title": {
        "message": "Review members",
        "description": "Title for the contact name spoofing review dialog in groups"
    },
    "ContactSpoofingReviewDialog__group__description": {
        "message": "$count$ group members have similar names. Review the members below or choose to take action.",
        "description": "Description for the group contact spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__group__members-header": {
        "message": "सदस्यों",
        "description": "Header in the group contact spoofing review dialog. After this header, there will be a list of members"
    },
    "ContactSpoofingReviewDialog__group__name-change-info": {
        "message": "Recently changed their profile name from $oldName$ to $newName$",
        "description": "In the group contact spoofing review dialog, this text is shown when someone has changed their name recently",
        "placeholders": {
            "oldName": {
                "content": "$1",
                "example": "Jane Doe"
            },
            "newName": {
                "content": "$2",
                "example": "Doe Jane"
            }
        }
    },
    "RemoveGroupMemberConfirmation__remove-button": {
        "message": "ग्रूप से हटाएँ",
        "description": "When confirming the removal of a group member, show this text in the button"
    },
    "RemoveGroupMemberConfirmation__description": {
        "message": "Remove \"$name$\" from the group?",
        "description": "When confirming the removal of a group member, show this text in the dialog",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "CaptchaDialog__title": {
        "message": "Verify to continue messaging",
        "description": "Header in the captcha dialog"
    },
    "CaptchaDialog__first-paragraph": {
        "message": "To help prevent spam on Signal, please complete verification.",
        "description": "First paragraph in the captcha dialog"
    },
    "CaptchaDialog__second-paragraph": {
        "message": "After verifying, you can continue messaging. Any paused messages will automatically be sent.",
        "description": "First paragraph in the captcha dialog"
    },
    "CaptchaDialog--can-close__title": {
        "message": "Continue Without Verifying?",
        "description": "Header in the captcha dialog that can be closed"
    },
    "CaptchaDialog--can-close__body": {
        "message": "If you choose to skip verification, you may miss messages from other people and your messages may fail to send.",
        "description": "Body of the captcha dialog that can be closed"
    },
    "CaptchaDialog--can_close__skip-verification": {
        "message": "Skip verification",
        "description": "Skip button of the captcha dialog that can be closed"
    },
    "verificationComplete": {
        "message": "Verification complete.",
        "description": "Displayed after successful captcha"
    },
    "verificationFailed": {
        "message": "Verification failed. Please retry later.",
        "description": "Displayed after unsuccessful captcha"
    },
    "deleteForEveryoneFailed": {
        "message": "Failed to delete message for everyone. Please retry later.",
        "description": "Displayed when delete-for-everyone has failed to send to all recepients"
    },
    "ChatColorPicker__delete--title": {
        "message": "Delete color",
        "description": "Confirm title for deleting custom color"
    },
    "ChatColorPicker__delete--message": {
        "message": "This custom color is used in $num$ chats. Do you want to delete it for all chats?",
        "description": "Confirm message for deleting custom color",
        "placeholders": {
            "num": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "ChatColorPicker__global-chat-color": {
        "message": "Global Chat Color",
        "description": "Modal title for the chat color picker and editor for all conversations"
    },
    "ChatColorPicker__menu-title": {
        "message": "चैट का रंग",
        "description": "View title for the chat color picker and editor"
    },
    "ChatColorPicker__reset": {
        "message": "Reset chat color",
        "description": "Button label for resetting chat colors"
    },
    "ChatColorPicker__resetDefault": {
        "message": "Reset Chat Colors",
        "description": "Confirmation dialog title for resetting all chat colors or only the global default one"
    },
    "ChatColorPicker__resetAll": {
        "message": "Reset all chat colors",
        "description": "Button label for resetting all chat colors"
    },
    "ChatColorPicker__confirm-reset-default": {
        "message": "Reset default",
        "description": "Button label for resetting only global chat color"
    },
    "ChatColorPicker__confirm-reset": {
        "message": "फिर से स्थापित करना",
        "description": "Confirm button label for resetting chat colors"
    },
    "ChatColorPicker__confirm-reset-message": {
        "message": "Would you like to override all chat colors?",
        "description": "Modal message text for confirming resetting of chat colors"
    },
    "ChatColorPicker__custom-color--label": {
        "message": "Show custom color editor",
        "description": "aria-label for custom color editor button"
    },
    "ChatColorPicker__sampleBubble1": {
        "message": "Here's a preview of the chat color.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__sampleBubble2": {
        "message": "Another bubble.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__sampleBubble3": {
        "message": "The color is visible to only you.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__context--edit": {
        "message": "Edit color",
        "description": "Option in the custom color bubble context menu"
    },
    "ChatColorPicker__context--duplicate": {
        "message": "Duplicate",
        "description": "Option in the custom color bubble context menu"
    },
    "ChatColorPicker__context--delete": {
        "message": "हटाए ",
        "description": "Option in the custom color bubble context menu"
    },
    "CustomColorEditor__solid": {
        "message": "Solid",
        "description": "Tab label for selecting solid colors"
    },
    "CustomColorEditor__gradient": {
        "message": "Gradient",
        "description": "Tab label for selecting a gradient"
    },
    "CustomColorEditor__hue": {
        "message": "Hue",
        "description": "Label for the hue slider"
    },
    "CustomColorEditor__saturation": {
        "message": "Saturation",
        "description": "Label for the saturation slider"
    },
    "CustomColorEditor__title": {
        "message": "Custom Color",
        "description": "Modal title for the custom color editor"
    },
    "customDisappearingTimeOption": {
        "message": "Custom time...",
        "description": "Text for an option in Disappearing Messages menu and Conversation Details Disappearing Messages setting when no user value is available"
    },
    "selectedCustomDisappearingTimeOption": {
        "message": "Custom time",
        "description": "Text for an option in Conversation Details Disappearing Messages setting when user previously selected custom time"
    },
    "DisappearingTimeDialog__title": {
        "message": "Custom Time",
        "description": "Title for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__body": {
        "message": "Choose a custom time for disappearing messages.",
        "description": "Body for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__set": {
        "message": "Set",
        "description": "Text for the dialog button confirming the custom disappearing message timeout"
    },
    "DisappearingTimeDialog__seconds": {
        "message": "Seconds",
        "description": "Name of the 'seconds' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__minutes": {
        "message": "Minutes",
        "description": "Name of the 'minutes' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__hours": {
        "message": "Hours",
        "description": "Name of the 'hours' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__days": {
        "message": "Days",
        "description": "Name of the 'days' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__weeks": {
        "message": "Weeks",
        "description": "Name of the 'weeks' unit select for the custom disappearing message timeout dialog"
    },
    "settings__DisappearingMessages__footer": {
        "message": "Set a default disappearing message timer for all new chats started by you.",
        "description": "Footer for the Disappearing Messages settings section"
    },
    "settings__DisappearingMessages__timer__label": {
        "message": "Default timer for new chats",
        "description": "Label for the Disapearring Messages default timer setting"
    },
    "UniversalTimerNotification__text": {
        "message": "The disappearing message time will be set to $timeValue$ when you message them.",
        "description": "A message displayed when default disappearing message timeout is about to be applied",
        "placeholders": {
            "timeValue": {
                "content": "$1",
                "example": "1 week"
            }
        }
    },
    "GroupDescription__read-more": {
        "message": "read more",
        "description": "Button text when the group description is too long"
    },
    "EditConversationAttributesModal__description-warning": {
        "message": "Group descriptions will be visible to members of this group and people who have been invited.",
        "description": "Label text shown when editing group description"
    },
    "ConversationDetailsHeader--add-group-description": {
        "message": "Add group description...",
        "description": "Placeholder text in the details header for those that can edit the group description"
    }
}
