{
    "copyErrorAndQuit": {
        "message": "ចម្លងបញ្ហា និងចាកចេញ",
        "description": "Shown in the top-level error popup, allowing user to copy the error text and close the app"
    },
    "unknownGroup": {
        "message": "ក្រុមមិនស្គាល់",
        "description": "Shown as the name of a group if we don't have any information about it"
    },
    "databaseError": {
        "message": "បញ្ហាទិន្នន័យ",
        "description": "Shown in a popup if the database cannot start up properly"
    },
    "deleteAndRestart": {
        "message": "លុបទិន្នន័យទាំងអស់ និងបើកឡើងវិញ",
        "description": "Shown in a popup if the database cannot start up properly; allows user to dalete database and restart"
    },
    "mainMenuFile": {
        "message": "&ឯកសារ",
        "description": "The label that is used for the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuEdit": {
        "message": "&កែប្រែ",
        "description": "The label that is used for the Edit menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuView": {
        "message": "&បង្ហាញ",
        "description": "The label that is used for the View menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuWindow": {
        "message": "&ផ្ទាំងបង្អួច",
        "description": "The label that is used for the Window menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuHelp": {
        "message": "&ជំនួយ",
        "description": "The label that is used for the Help menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuSettings": {
        "message": "ចំណង់ចំណូលចិត្ត...",
        "description": "The label that is used for the Preferences menu in the program main menu. This should be consistent with the standard naming for ‘Preferences’ on the operating system."
    },
    "appMenuHide": {
        "message": "លាក់",
        "description": "Application menu command to hide the window"
    },
    "appMenuHideOthers": {
        "message": "លាក់ផ្សេងទៀត",
        "description": "Application menu command to hide all other windows"
    },
    "appMenuUnhide": {
        "message": "បង្ហាញទាំងអស់",
        "description": "Application menu command to show all application windows"
    },
    "appMenuQuit": {
        "message": "ចាកចេញពីSignal",
        "description": "Application menu command to close the application"
    },
    "editMenuUndo": {
        "message": "មិនធ្វើវិញ",
        "description": "Edit menu command to remove recently-typed text"
    },
    "editMenuRedo": {
        "message": "ធ្វើឡើងវិញ",
        "description": "Edit menu command to restore previously undone typed text"
    },
    "editMenuCut": {
        "message": "កាត់",
        "description": "Edit menu command to remove selected text and add it to clipboard"
    },
    "editMenuCopy": {
        "message": "ចម្លង",
        "description": "Edit menu command to add selected text to clipboard"
    },
    "editMenuPaste": {
        "message": "បិទភ្ជាប់",
        "description": "Edit menu command to insert text from clipboard at cursor location"
    },
    "editMenuPasteAndMatchStyle": {
        "message": "គំរូបិទភ្ជាប់ និងត្រូវគ្នា",
        "description": "Edit menu command to insert text from clipboard at cursor location, taking only text and not style information"
    },
    "editMenuDelete": {
        "message": "លុប",
        "description": "Edit menu command to remove the selected text"
    },
    "editMenuSelectAll": {
        "message": "ជ្រើសរើសទាំងអស់",
        "description": "Edit menu comand to select all of the text in selected text box"
    },
    "editMenuStartSpeaking": {
        "message": "ចាប់ផ្តើមការនិយាយ",
        "description": "Edit menu item under 'speech' to start dictation"
    },
    "editMenuStopSpeaking": {
        "message": "បញ្ឈប់ការនិយាយ",
        "description": "Edit menu item under 'speech' to stop dictation"
    },
    "windowMenuClose": {
        "message": "បិទផ្ទាំង",
        "description": "Window menu command to close the current window"
    },
    "windowMenuMinimize": {
        "message": "បង្រួមតូច",
        "description": "Window menu command to minimize the current window"
    },
    "windowMenuZoom": {
        "message": "ពង្រីក",
        "description": "Window menu command to make the current window the size of the whole screen"
    },
    "windowMenuBringAllToFront": {
        "message": "នាំទាំងអស់ទៅកាន់ពុម្ពអក្សរ",
        "description": "Window menu command to bring all windows of current applicatinon to front"
    },
    "viewMenuResetZoom": {
        "message": "ទំហំជាក់ស្តែង",
        "description": "View menu command to go back to the default zoom"
    },
    "viewMenuZoomIn": {
        "message": "ពង្រីក",
        "description": "View menu command to make everything bigger"
    },
    "viewMenuZoomOut": {
        "message": "បង្រួម",
        "description": "View menu command to make everything smaller"
    },
    "viewMenuToggleFullScreen": {
        "message": "បិទបើកការបង្ហាញពេញអេក្រង់",
        "description": "View menu command to enter or leave Full Screen mode"
    },
    "viewMenuToggleDevTools": {
        "message": "បិទបើកមុខងារអ្នកអភិវឌ្ឍន៍",
        "description": "View menu command to show or hide the developer tools"
    },
    "menuSetupWithImport": {
        "message": "ដំឡើង ជាមួយការនាំចូល",
        "description": "When the application is not yet set up, menu option to start up the import sequence"
    },
    "menuSetupAsNewDevice": {
        "message": "ដំឡើង ជាឧបករណ៍ថ្មី",
        "description": "When the application is not yet set up, menu option to start up the set up as fresh device"
    },
    "menuSetupAsStandalone": {
        "message": "ដំឡើង ជាឧបករណ៍ដាច់ដោយឡែក",
        "description": "Only available on development modes, menu option to open up the standalone device setup sequence"
    },
    "loading": {
        "message": "កំពុងផ្ទុក...",
        "description": "Message shown on the loading screen before we've loaded any messages"
    },
    "optimizingApplication": {
        "message": "ធ្វើឱ្យកម្មវិធីប្រសើរឡើង ...",
        "description": "Message shown on the loading screen while we are doing application optimizations"
    },
    "migratingToSQLCipher": {
        "message": "កំពុងរៀបចំសារ... $status$ រួចរាល់។",
        "description": "Message shown on the loading screen while we are doing application optimizations",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "45/200"
            }
        }
    },
    "archivedConversations": {
        "message": "បណ្ណសារសន្ទនា",
        "description": "Shown in place of the search box when showing archived conversation list"
    },
    "archiveHelperText": {
        "message": "ការសន្ទនាទាំងនេះ នឹងត្រូវធ្វើបណ្ណសារ និងបង្ហាញក្នុងប្រអប់សំបុត្រតែប៉ុណ្ណោះ ប្រសិនបើទទួលបានសារថ្មី។",
        "description": "Shown at the top of the archived converations list in the left pane"
    },
    "archiveConversation": {
        "message": "បណ្ណសារការសន្ទនា",
        "description": "Shown in menu for conversation, and moves conversation out of main conversation list"
    },
    "moveConversationToInbox": {
        "message": "ផ្លាស់ប្តូរការសន្ទនាទៅប្រអប់សារ",
        "description": "Undoes Archive Conversation action, and moves archived conversation back to the main conversation list"
    },
    "chooseDirectory": {
        "message": "ជ្រើសរើសទីតាំងផ្ទុក",
        "description": "Button to allow the user to find a folder on disk"
    },
    "chooseFile": {
        "message": "ជ្រើសរើសឯកសារ",
        "description": "Button to allow the user to find a file on disk"
    },
    "loadDataHeader": {
        "message": "ផ្ទុកទិន្នន័យរបស់អ្នក",
        "description": "Header shown on the first screen in the data import process"
    },
    "loadDataDescription": {
        "message": "អ្នកទើបឆ្លងកាត់ដំណើការនាំចេញ បញ្ជីទំនាក់ទំនង និងសាររបស់អ្នកគឺកំពុងរង់ចាំនៅលើម៉ាស៊ីនកុំព្យូទ័ររបស់អ្នក។ ជ្រើសរើស ថតផ្ទុកទិន្នន័យSignalរបស់អ្នក ដែលបានរក្សាទុក។",
        "description": "Introduction to the process of importing messages and contacts from disk"
    },
    "importChooserTitle": {
        "message": "ជ្រើសរើស ថតឯកសារ ជាមួយទិន្នន័យបាននាំចេញ",
        "description": "Title of the popup window used to select data previously exported"
    },
    "importErrorHeader": {
        "message": "មានបញ្ហាខុសប្រក្រតី!",
        "description": "Header of the error screen after a failed import"
    },
    "importingHeader": {
        "message": "កំពុងផ្ទុកបញ្ជីទំនាក់ទំនង និងសារ",
        "description": "Header of screen shown as data is import"
    },
    "importErrorFirst": {
        "message": "សូមប្រាកដថា អ្នកបានជ្រើសរើស កន្លែងត្រឹមត្រូវដែលផ្ទុកទិន្នន័យSignalរបស់អ្នក ដែលបានរក្សាទុក។ ឈ្មោះវា គួរតែចាប់ផ្តើមដោយ 'នាំចេញ Signal។' អ្នកអាចរក្សាទុកការចម្លងថ្មីមួយនៃទិន្នន័យរបស់អ្នក ពីកម្មវិធី Chrome ។",
        "description": "Message shown if the import went wrong; first paragraph"
    },
    "importErrorSecond": {
        "message": "បើសិនជំហានទាំងនេះ មិនកើតទេ សូមបញ្ជូន កំណត់ត្រាបញ្ហា (បង្ហាញ -> កំណត់ត្រាបញ្ហា) ដូចនេះ យើងអាចជួយអ្នកបាន!",
        "description": "Message shown if the import went wrong; second paragraph"
    },
    "importAgain": {
        "message": "ជ្រើសរើស កន្លែងផ្ទុក និងសាកល្បងម្តងទៀត",
        "description": "Button shown if the user runs into an error during import, allowing them to start over"
    },
    "importCompleteHeader": {
        "message": "ជោគជ័យ!",
        "description": "Header shown on the screen at the end of a successful import process"
    },
    "importCompleteStartButton": {
        "message": "ចាប់ផ្តើមប្រើប្រាស់ Signal Desktop",
        "description": "Button shown at end of successful import process, nothing left but a restart"
    },
    "importCompleteLinkButton": {
        "message": "តភ្ជាប់ឧបករណ៍នេះ ទៅកាន់ទូរស័ព្ទរបស់អ្នក",
        "description": "Button shown at end of successful 'light' import process, so the standard linking process still needs to happen"
    },
    "selectedLocation": {
        "message": "ទីតាំងអ្នកបានជ្រើសរើស",
        "description": "Message shown as the export location if we didn't capture the target directory"
    },
    "upgradingDatabase": {
        "message": "កំពុងដំឡើងទិន្នន័យ។ វាអាចចំណាយពេលខ្លះ...",
        "description": "Message shown on the loading screen when we're changing database structure on first run of a new version"
    },
    "loadingMessages": {
        "message": "កំពុងផ្ទុកសារ។ $count$ ឥឡូវនេះ...",
        "description": "Message shown on the loading screen when we're catching up on the backlog of messages",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "me": {
        "message": "ខ្ញុំ",
        "description": "The label for yourself when shown in a group member list"
    },
    "view": {
        "message": "បង្ហាញ",
        "description": "Used as a label on a button allowing user to see more information"
    },
    "youLeftTheGroup": {
        "message": "អ្នកបានចាកចេញពីក្រុម",
        "description": "Displayed when a user can't send a message because they have left the group"
    },
    "scrollDown": {
        "message": "រំកិលចុះក្រោមនៃការសន្ទនា",
        "description": "Alt text for button to take user down to bottom of conversation, shown when user scrolls up"
    },
    "messageBelow": {
        "message": "សារថ្មីខាងក្រោម",
        "description": "Alt text for button to take user down to bottom of conversation with a new message out of screen"
    },
    "messagesBelow": {
        "message": "សារថ្មីខាងក្រោម",
        "description": "Alt text for button to take user down to bottom of conversation with more than one message out of screen"
    },
    "unreadMessage": {
        "message": "សារមិនទាន់អាន 1 ",
        "description": "Text for unread message separator, just one message"
    },
    "unreadMessages": {
        "message": "$count$ សារមិនទាន់អាន",
        "description": "Text for unread message separator, with count",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "youMarkedAsVerified": {
        "message": "អ្នកបានដាក់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$ថាបានផ្ទៀងផ្ទាត់",
        "description": "Shown in the conversation history when the user marks a contact as verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerified": {
        "message": "អ្នកបានដាក់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$ថាមិនបានផ្ទៀងផ្ទាត់",
        "description": "Shown in the conversation history when the user marks a contact as not verified, whether on the Safety Number screen or by dismissing a banner or dialog.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsVerifiedOtherDevice": {
        "message": "អ្នកបានដាក់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$ថាបានផ្ទៀងផ្ទាត់ពីឧបករណ៍ផ្សេង",
        "description": "Shown in the conversation history when we discover that the user marked a contact as verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerifiedOtherDevice": {
        "message": "អ្នកបានដាក់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$ថាមិនបានផ្ទៀងផ្ទាត់ពីឧបករណ៍ផ្សេង",
        "description": "Shown in the conversation history when we discover that the user marked a contact as not verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "membersNeedingVerification": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយសមាជិកក្រុមច្រើន បានផ្លាស់ប្តូរ តាំងពីអ្នកបានផ្ទៀងផ្ទាត់លើកចុងក្រោយ។ ចុច លើសមាជិកក្រុមមួយ ដើម្បីមើលលេខសុវត្ថិភាពថ្មីជាមួយពួកគេ។",
        "description": "When there are multiple previously-verified group members with safety number changes, a banner will be shown. The list of contacts with safety number changes is shown, and this text introduces that list."
    },
    "changedSinceVerifiedMultiple": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយសមាជិកក្រុមច្រើន បានផ្លាស់ប្តូរ តាំងពីអ្នកបានផ្ទៀងផ្ទាត់លើកចុងក្រោយ។ នេះអាចមានន័យថា មាននរណាម្នាក់កំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក ឬគេបានតំឡើង Signal ឡើងវិញ។",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedSinceVerified": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយ $name$ បានផ្លាស់ប្តូរ តាំងពីអ្នកបានផ្ទៀងផ្ទាត់លើកចុងក្រោយ។ នេះអាចមានន័យថា មានគេកំពុងព្យាយាមជ្រៀតចូលការទំនាក់ទំនង ឬ $name$ បានដំឡើង Signal ឡើងវិញ។",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRightAfterVerify": {
        "message": "លេខសុវត្ថិភាព ដែលអ្នកកំពុងព្យាយាមផ្ទៀងផ្ទាត់បានផ្លាស់ប្តូរ។ សូមពិនិត្យមើលលេខសុវត្ថិភាពថ្មីជាមួយ $name$។ ចងចាំថា ការផ្លាស់ប្តូរនេះអាចមានន័យថា​ មាននរណាម្នាក់កំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក ឬ $name$បានតំឡើង Signal ឡើងវិញ។  ",
        "description": "Shown on the safety number screen when the user has selected to verify/unverify a contact's safety number, and we immediately discover a safety number change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRecentlyMultiple": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយសមាជិកក្រុមច្រើន បានផ្លាស់ប្តូរ ថ្មីៗនេះ។ នេះអាចមានន័យថា មាននរណាម្នាក់កំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក ឬគេបានតំឡើង Signal ឡើងវិញ។ ",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedRecently": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយ $name$ បានផ្លាស់ប្តូរ ថ្មីៗនេះ។ នេះអាចមានន័យថា មានគេកំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក ឬ $name$ បានដំឡើង Signal ឡើងវិញ។",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "identityKeyErrorOnSend": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយ $name$ បានផ្លាស់ប្តូរ។ នេះអាចមានន័យថា មាននរណាម្នាក់កំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក ឬ $name$ បានតំឡើង Signal ឡើងវិញ។ អ្នកអាចត្រូវផ្ទៀងផ្ទាត់លេខសុវត្ថិភាពរបស់អ្នក ជាមួយលេខទំនាក់ទំនងនេះ។",
        "description": "Shown when user clicks on a failed recipient in the message detail view after an identity key change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "sendAnyway": {
        "message": "ផ្ញើ ទោះយ៉ាងណាក៏ដោយ",
        "description": "Used on a warning dialog to make it clear that it might be risky to send the message."
    },
    "noLongerVerified": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$ បានផ្លាស់ប្តូរ និងមិនត្រូវបានផ្ទៀងផ្ទាត់ឡើយ។ ចុច ដើម្បីបង្ហាញ។",
        "description": "Shown in converation banner when user's safety number has changed, but they were previously verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleNoLongerVerified": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយសមាជិកច្រើន នៅក្រុមនេះ បានផ្លាស់ប្តូរ ​និងមិនមានការផ្ទៀងផ្ទាត់ឡើយ។ ចុច  ដើម្បីបង្ហាញ។",
        "description": "Shown in conversation banner when more than one group member's safety number has changed, but they were previously verified."
    },
    "debugLogExplanation": {
        "message": "កំណត់ត្រានេះ នឹងត្រូវបង្ហោះជាសាធារណៈតាមរយៈបណ្តាញ សម្រាប់អ្នកចូលរួមដើម្បីពិនិត្យមើល។ អ្នកអាចពិនិត្យ និងកែប្រែវាមុនពេលបញ្ជូន។",
        "description": ""
    },
    "debugLogError": {
        "message": "មានបញ្ហាក្នុងការផ្ទុក! សូមបន្ថែមក្នុងកំណត់ត្រា ដើម្បីកត់ត្រាបញ្ហាក្នុងឯកសារអ្នក។",
        "description": ""
    },
    "reportIssue": {
        "message": "រាយការណ៍បញ្ហាមួយ",
        "description": "Link to open the issue tracker"
    },
    "gotIt": {
        "message": "យល់ព្រម!",
        "description": "Label for a button that dismisses a dialog. The user clicks it to confirm that they understand the message in the dialog."
    },
    "submit": {
        "message": "បញ្ជូន",
        "description": ""
    },
    "acceptNewKey": {
        "message": "យល់ព្រម",
        "description": "Label for a button to accept a new safety number"
    },
    "verify": {
        "message": "ដាក់ថាបានផ្ទៀងផ្ទាត់",
        "description": ""
    },
    "unverify": {
        "message": "ដាក់ថាមិនបានផ្ទៀងផ្ទាត់",
        "description": ""
    },
    "isVerified": {
        "message": "អ្នកបានផ្ទៀងផ្ទាត់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$.",
        "description": "Summary state shown at top of the safety number screen if user has verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "isNotVerified": {
        "message": "អ្នកមិនបានផ្ទៀងផ្ទាត់លេខសុវត្ថិភាពរបស់អ្នកជាមួយ $name$.",
        "description": "Summary state shown at top of the safety number screen if user has not verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "verified": {
        "message": "បានផ្ទៀងផ្ទាត់",
        "description": ""
    },
    "newIdentity": {
        "message": "លេខសុវត្ថិភាពថ្មី",
        "description": "Header for a key change dialog"
    },
    "identityChanged": {
        "message": "លេខសុវត្ថិភាពរបស់អ្នក ជាមួយលេខទំនាក់ទំនងនេះបានផ្លាស់ប្តូរ។ នេះអាចមានន័យថា មានគេកំពុងព្យាយាមជ្រាតចូលការទំនាក់ទំនងរបស់អ្នក, ឬ លេខទំនាក់ទំនងនេះបានដំឡើង Signal ឡើងវិញ។ អ្នកអាចត្រូវផ្ទៀងផ្ទាត់លេខសុវត្ថិភាពខាងក្រោម។",
        "description": ""
    },
    "incomingError": {
        "message": "បញ្ហាទទួលសារផ្ញើចូល",
        "description": ""
    },
    "media": {
        "message": "ឯកសារមេឌា",
        "description": "Header of the default pane in the media gallery, showing images and videos"
    },
    "mediaEmptyState": {
        "message": "អ្នកមិនមានឯកសារមេឌា ក្នុងការសន្ទនានេះទេ",
        "description": "Message shown to user in the media gallery when there are no messages with media attachments (images or video)"
    },
    "documents": {
        "message": "ឯកសារ",
        "description": "Header of the secondary pane in the media gallery, showing every non-media attachment"
    },
    "documentsEmptyState": {
        "message": "អ្នកមិនមានឯកសារ ក្នុងការសន្ទនានេះទេ",
        "description": "Message shown to user in the media gallery when there are no messages with document attachments (anything other than images or video)"
    },
    "today": {
        "message": "ថ្ងៃនេះ",
        "description": "Section header in the media gallery"
    },
    "yesterday": {
        "message": "ម្សិលមិញ",
        "description": "Section header in the media gallery"
    },
    "thisWeek": {
        "message": "សប្តាហ៍នេះ",
        "description": "Section header in the media gallery"
    },
    "thisMonth": {
        "message": "ខែនេះ",
        "description": "Section header in the media gallery"
    },
    "unsupportedAttachment": {
        "message": "មិនគាំទ្រប្រភេទឯកសារភ្ជាប់។ ចុច ដើម្បីរក្សាទុក។",
        "description": "Displayed for incoming unsupported attachment"
    },
    "clickToSave": {
        "message": "ចុច ដើម្បីរក្សាទុក",
        "description": "Hover text for attachment filenames"
    },
    "unnamedFile": {
        "message": "ឯកសារគ្មានឈ្មោះ",
        "description": "Hover text for attachment filenames"
    },
    "voiceMessage": {
        "message": "សារសំឡេង",
        "description": "Name for a voice message attachment"
    },
    "dangerousFileType": {
        "message": "ប្រភេទឯកសារភ្ជាប់មិនអនុញ្ញាតសម្រាប់ហេតុផលសុវត្ថិភាព",
        "description": "Shown in toast when user attempts to send .exe file, for example"
    },
    "loadingPreview": {
        "message": "កំពុងផ្ទុកការមើល...",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area"
    },
    "stagedPreviewThumbnail": {
        "message": "ការមើលតំណជារូបភាពតូចៗព្រាងសម្រាប់ $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "previewThumbnail": {
        "message": "ការមើលតំណជារូបភាពតូចៗសម្រាប់$domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "stagedImageAttachment": {
        "message": "រូបភាពឯកសារភ្ជាប់ព្រាង៖ $path$",
        "description": "Alt text for staged attachments",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "dog.jpg"
            }
        }
    },
    "oneNonImageAtATimeToast": {
        "message": "ពេលបញ្ចូលឯកសារភ្ជាប់មិន-រូបភាពមួយ ការកំណត់គឺឯកសារភ្ជាប់មួយ សម្រាប់សារមួយ។",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "cannotMixImageAndNonImageAttachments": {
        "message": "អ្នកមិនអាចលាយឡំឯកសារភ្ជាប់ មិន-រូបភាព និងរូបភាព ក្នុងសារតែមួយទេ។",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "maximumAttachments": {
        "message": "អ្នកមិនអាចបន្ថែមឯកសារភ្ជាប់ទៅកាន់សារនេះទេ។",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "fileSizeWarning": {
        "message": "សុំទោស, ឯកសារដែលបានជ្រើសរើស លើសពីទំហំសារដែលបានកំណត់។",
        "description": ""
    },
    "unableToLoadAttachment": {
        "message": "មិនអាចផ្ទុកឯកសារភ្ជាប់ដែលបានជ្រើសរើស។",
        "description": ""
    },
    "disconnected": {
        "message": "បានផ្តាច់",
        "description": "Displayed when the desktop client cannot connect to the server."
    },
    "connecting": {
        "message": "កំពុងតភ្ជាប់",
        "description": "Displayed when the desktop client is currently connecting to the server."
    },
    "offline": {
        "message": "អហ្វឡាញ",
        "description": "Displayed when the desktop client has no network connection."
    },
    "checkNetworkConnection": {
        "message": "ត្រួតពិនិត្យការតភ្ជាប់បណ្តាញរបស់អ្នក។",
        "description": "Obvious instructions for when a user's computer loses its network connection"
    },
    "attemptingReconnection": {
        "message": "កំពុងព្យាយាមតភ្ជាប់ឡើងវិញក្នុងពេល $reconnect_duration_in_seconds$ វិនាទី",
        "description": "",
        "placeholders": {
            "reconnect_duration_in_seconds": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "submitDebugLog": {
        "message": "កំណត់ត្រាបញ្ហា",
        "description": "Menu item and header text for debug log modal (sentence case)"
    },
    "debugLog": {
        "message": "កំណត់ត្រាបញ្ហា",
        "description": "View menu item to open the debug log (title case)"
    },
    "goToReleaseNotes": {
        "message": "ចូលទៅកាន់កំណត់ចេញថ្មី",
        "description": ""
    },
    "goToForums": {
        "message": "ចូលទៅកាន់ វេទិកា",
        "description": "Item under the Help menu, takes you to the forums"
    },
    "goToSupportPage": {
        "message": "ចូលទៅកាន់ទំព័រគាំទ្រ",
        "description": "Item under the Help menu, takes you to the support page"
    },
    "menuReportIssue": {
        "message": "រាយការណ៍បញ្ហាមួយ",
        "description": "Item under the Help menu, takes you to GitHub new issue form (title case)"
    },
    "signalDesktopPreferences": {
        "message": "ចំណង់ចំណូលចិត្តSignal Desktop ",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "aboutSignalDesktop": {
        "message": "អំពី Signal Desktop",
        "description": "Item under the Help menu, which opens a small about window"
    },
    "speech": {
        "message": "សម្តី",
        "description": "Item under the Edit menu, with 'start/stop speaking' items below it"
    },
    "show": {
        "message": "បង្ហាញ",
        "description": "Command under Window menu, to show the window"
    },
    "hide": {
        "message": "លាក់",
        "description": "Command in the tray icon menu, to hide the window"
    },
    "quit": {
        "message": "ចាកចេញ",
        "description": "Command in the tray icon menu, to quit the application"
    },
    "signalDesktop": {
        "message": "Signal Desktop",
        "description": "Tooltip for the tray icon"
    },
    "search": {
        "message": "ស្វែងរក",
        "description": "Placeholder text in the search input"
    },
    "noSearchResults": {
        "message": "គ្មានលទ្ធផលសម្រាប់ \"$searchTerm$\"",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            }
        }
    },
    "conversationsHeader": {
        "message": "ការសន្ទនា",
        "description": "Shown to separate the types of search results"
    },
    "contactsHeader": {
        "message": "បញ្ជីទំនាក់ទំនង",
        "description": "Shown to separate the types of search results"
    },
    "messagesHeader": {
        "message": "សារ",
        "description": "Shown to separate the types of search results"
    },
    "welcomeToSession": {
        "message": "ស្វាគមន៍មកកាន់ Signal",
        "description": ""
    },
    "selectAContact": {
        "message": "ជ្រើសរើសលេខទំនាក់ទំនងមួយ ឬក្រុម ដើម្បីចាប់ផ្តើមការសន្ទនា។",
        "description": ""
    },
    "typingAlt": {
        "message": "ការវាយចលនាសម្រាប់ការសន្ទនានេះ",
        "description": "Used as the 'title' attibute for the typing animation"
    },
    "contactAvatarAlt": {
        "message": "រូបតំណាងសម្រាប់លេខទំនាក់ទំនង $name$",
        "description": "Used in the alt tag for the image avatar of a contact",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "sendMessageToContact": {
        "message": "ផ្ញើសារ",
        "description": "Shown when you are sent a contact and that contact has a signal account"
    },
    "home": {
        "message": "ផ្ទះ",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "work": {
        "message": "ការងារ",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "mobile": {
        "message": "ចល័ត",
        "description": "Shown on contact detail screen as a label for aa phone or email"
    },
    "email": {
        "message": "អ៊ីមែល",
        "description": "Generic label shown if contact email has custom type but no label"
    },
    "phone": {
        "message": "ទូរស័ព្ទ",
        "description": "Generic label shown if contact phone has custom type but no label"
    },
    "address": {
        "message": "អាសយដ្ឋាន",
        "description": "Generic label shown if contact address has custom type but no label"
    },
    "poBox": {
        "message": "ប្រអប់សំបុត្រ",
        "description": "When rendering an address, used to provide context to a post office box"
    },
    "downloading": {
        "message": "កំពុងទាញយក",
        "description": "Shown in the message bubble while a long message attachment is being downloaded"
    },
    "downloadAttachment": {
        "message": "ទាញយកឯកសារភ្ជាប់",
        "description": "Shown in a message's triple-dot menu if there isn't room for a dedicated download button"
    },
    "replyToMessage": {
        "message": "ឆ្លើយតបសារ",
        "description": "Shown in triple-dot menu next to message to allow user to start crafting a message with a quotation"
    },
    "originalMessageNotFound": {
        "message": "រកមិនឃើញឯកសារដើម",
        "description": "Shown in quote if reference message was not found as message was initially downloaded and processed"
    },
    "originalMessageNotAvailable": {
        "message": "ឯកសារដើមលែងមានទៀតហើយ",
        "description": "Shown in toast if user clicks on quote that references message no longer in database"
    },
    "messageFoundButNotLoaded": {
        "message": "រកឃើញសារដើម ប៉ុន្តែមិនអាចផ្ទុក។ រំកិលចុះក្រោម ដើម្បីផ្ទុកវា។",
        "description": "Shown in toast if user clicks on quote references messages not loaded in view, but in database"
    },
    "voiceNoteMustBeOnlyAttachment": {
        "message": "ការចំណាំជាសំឡេងត្រូវតែជាឯកសារភ្ជាប់ នៅក្នុងសារមួយ។",
        "description": "Shown in toast if tries to record a voice note with any staged attachments"
    },
    "you": {
        "message": "អ្នក",
        "description": "In Android theme, shown in quote if you or someone else replies to you"
    },
    "replyingTo": {
        "message": "កំពុងឆ្លើយតបទៅកាន់ $name$",
        "description": "Shown in iOS theme when you or someone quotes to a message which is not from you",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "audioPermissionNeeded": {
        "message": "ដើម្បីបញ្ជូនសារសំឡេង អនុញ្ញាតឲ្យSignal Desktop ចូលប្រើប្រាស់ម៉ៃក្រូហ្វូនរបស់អ្នក។",
        "description": "Shown if the user attempts to send an audio message without audio permssions turned on"
    },
    "allowAccess": {
        "message": "អនុញ្ញាតចូលប្រើប្រាស់",
        "description": "Button shown in popup asking to enable microphon/video permissions to send audio messages"
    },
    "showSettings": {
        "message": "បង្ហាញការកំណត់",
        "description": "A button shown in dialog requesting the user to turn on audio permissions"
    },
    "audio": {
        "message": "សំឡេង",
        "description": "Shown in a quotation of a message containing an audio attachment if no text was originally provided with that attachment"
    },
    "video": {
        "message": "វីដេអូ",
        "description": "Shown in a quotation of a message containing a video if no text was originally provided with that video"
    },
    "photo": {
        "message": "រូបភាព",
        "description": "Shown in a quotation of a message containing a photo if no text was originally provided with that image"
    },
    "cannotUpdate": {
        "message": "Cannot Update",
        "description": "Shown as the title of our update error dialogs on windows"
    },
    "readOnlyVolume": {
        "message": "Signal Desktop is likely in a macOS quarantine, and will not be able to auto-update. Please try moving Signal.app to /Applications with Finder.",
        "description": "Shown on MacOS if running on a read-only volume and we cannot update"
    },
    "ok": {
        "message": "យល់ព្រម",
        "description": ""
    },
    "cancel": {
        "message": "លះបង់",
        "description": ""
    },
    "failedToSend": {
        "message": "បរាជ័យក្នុងការផ្ញើទៅកាន់អ្នកទទួល។ ពិនិត្យការតភ្ជាប់បណ្តាញរបស់អ្នក។",
        "description": ""
    },
    "error": {
        "message": "បញ្ហា",
        "description": ""
    },
    "messageDetail": {
        "message": "សារលម្អិត",
        "description": ""
    },
    "delete": {
        "message": "លុប",
        "description": ""
    },
    "deleteWarning": {
        "message": "តើអ្នកច្បាស់ទេ? ចុច 'លុប' នឹងសារនេះ ចេញពីឧបករណ៍នេះរហូត។",
        "description": ""
    },
    "deleteThisMessage": {
        "message": "លុបសារនេះ",
        "description": ""
    },
    "from": {
        "message": "ពី",
        "description": "Label for the sender of a message"
    },
    "to": {
        "message": "ទៅ",
        "description": "Label for the receiver of a message"
    },
    "sent": {
        "message": "បានផ្ញើ",
        "description": "Label for the time a message was sent"
    },
    "received": {
        "message": "បានទទួល",
        "description": "Label for the time a message was received"
    },
    "sendMessage": {
        "message": "ផ្ញើសារមួយ",
        "description": "Placeholder text in the message entry field"
    },
    "groupMembers": {
        "message": "សមាជិកក្រុម",
        "description": ""
    },
    "showMembers": {
        "message": "បង្ហាញសមាជិក",
        "description": ""
    },
    "resetSession": {
        "message": "កំណត់ការប្រើប្រាស់ឡើងវិញ",
        "description": "This is a menu item for resetting the session, using the imperative case, as in a command."
    },
    "showSafetyNumber": {
        "message": "បង្ហាញលេខសុវត្ថិភាព",
        "description": ""
    },
    "viewAllMedia": {
        "message": "បង្ហាញឯកសារមេឌាទាំងអស់",
        "description": "This is a menu item for viewing all media (images + video) in a conversation, using the imperative case, as in a command."
    },
    "verifyHelp": {
        "message": "បើសិនអ្នកចង់ផ្ទៀងផ្ទាត់សុវត្ថិភាព នៃកូដបនីយកម្មរបស់អ្នកជាមួយ $name$ សូមប្រៀបធៀបលេខខាងលើជាមួយលេខនៅលើឧបករណ៍របស់ពួកគេ។",
        "description": "",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "theirIdentityUnknown": {
        "message": "អ្នកមិនទាន់បានផ្តោះប្តូរសារណាមួយជាមួយលេខទំនាក់ទំនងនេះទេ។ លេខសុវត្ថិភាពរបស់អ្នកជាមួយគេ នឹងមានបន្ទាប់ពីផ្ញើសារដំបូង។",
        "description": ""
    },
    "moreInfo": {
        "message": "ព័ត៌មានបន្ថែម...",
        "description": "Shown on the drop-down menu for an individual message, takes you to message detail screen"
    },
    "retrySend": {
        "message": "ផ្ញើម្តងទៀត",
        "description": "Shown on the drop-down menu for an indinvidaul message, but only if it is an outgoing message that failed to send"
    },
    "deleteMessage": {
        "message": "លុបសារ",
        "description": "Shown on the drop-down menu for an individual message, deletes single message"
    },
    "deleteMessages": {
        "message": "លុបសារ",
        "description": "Menu item for deleting messages, title case."
    },
    "deleteConversationConfirmation": {
        "message": "លុបការសន្ទនានេះចោលរហូត?",
        "description": "Confirmation dialog text that asks the user if they really wish to delete the conversation. Answer buttons use the strings 'ok' and 'cancel'. The deletion is permanent, i.e. it cannot be undone."
    },
    "sessionEnded": {
        "message": "កំណត់ការប្រើប្រាស់សុវត្ថិភាពឡើងវិញ",
        "description": "This is a past tense, informational message. In other words, your secure session has been reset."
    },
    "quoteThumbnailAlt": {
        "message": "រូបភាពតូចៗនៃរូបភាពពីសារដែលបានដកស្រង់",
        "description": "Used in alt tag of thumbnail images inside of an embedded message quote"
    },
    "imageAttachmentAlt": {
        "message": "រូបភាពបានភ្ជាប់ទៅសារ",
        "description": "Used in alt tag of image attachment"
    },
    "videoAttachmentAlt": {
        "message": "រូបថតអេក្រង់នៃវីដេអូភ្ជាប់ទៅកាន់សារ",
        "description": "Used in alt tag of video attachment preview"
    },
    "lightboxImageAlt": {
        "message": "រូបភាពបានផ្ញើ ក្នុងការសន្ទនា",
        "description": "Used in the alt tag for the image shown in a full-screen lightbox view"
    },
    "imageCaptionIconAlt": {
        "message": "រូបតំណាងបង្ហាញថារូបភាពនេះមានចំណងជើង",
        "description": "Used for the icon layered on top of an image in message bubbles"
    },
    "addACaption": {
        "message": "ដាក់ចំណងជើង...",
        "description": ""
    },
    "save": {
        "message": "រក្សាទុក",
        "description": ""
    },
    "fileIconAlt": {
        "message": "រូបតំណាងឯកសារ",
        "description": "Used in the media gallery documents tab to visually represent a file"
    },
    "emojiAlt": {
        "message": "រូបEmoji របស់ '$title$'",
        "description": "Used in the alt tag of all emoji images",
        "placeholders": {
            "title": {
                "content": "$1",
                "example": "grinning"
            }
        }
    },
    "installWelcome": {
        "message": "ស្វាគមន៍មកកាន់ Signal Desktop",
        "description": "Welcome title on the install page"
    },
    "installTagline": {
        "message": "ភាពឯកជនគឺអាចធ្វើទៅបាន។ Signalធ្វើបានដោយងាយស្រួល។",
        "description": "Tagline displayed under 'installWelcome' string on the install page"
    },
    "linkYourPhone": {
        "message": "តភ្ជាប់ទូរស័ព្ទរបស់អ្នក ទៅកាន់ Signal Desktop",
        "description": "Shown on the front page when the application first starst, above the QR code"
    },
    "signalSettings": {
        "message": "ការកំណត់ Signal",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "linkedDevices": {
        "message": "ឧបករណ៍បានតភ្ជាប់",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "plusButton": {
        "message": "'+' ប៊ូតុង",
        "description": "The button used in Signal Android to add a new linked device"
    },
    "linkNewDevice": {
        "message": "តភ្ជាប់ឧបករណ៍ថ្មី",
        "description": "The menu option shown in Signal iOS to add a new linked device"
    },
    "deviceName": {
        "message": "ឈ្មោះឧបករណ៍",
        "description": "The label in settings panel shown for the user-provided name for this desktop instance"
    },
    "chooseDeviceName": {
        "message": "ជ្រើសរើសឈ្មោះឧបករណ៍នេះ",
        "description": "The header shown on the 'choose device name' screen in the device linking process"
    },
    "finishLinkingPhone": {
        "message": "បញ្ចប់ការតភ្ជាប់ទូរស័ព្ទ",
        "description": "The text on the button to finish the linking process, after choosing the device name"
    },
    "initialSync": {
        "message": "កំពុងចម្លងបញ្ជីទំនាក់ទំនង និងក្រុម",
        "description": "Shown during initial link while contacts and groups are being pulled from mobile device"
    },
    "installConnectionFailed": {
        "message": "បរាជ័យក្នុងការតភ្ជាប់ទៅកាន់ម៉ាស៊ីនមេ។",
        "description": "Displayed when we can't connect to the server."
    },
    "installTooManyDevices": {
        "message": "សុំទោស, អ្នកបានភ្ជាប់ឧបករណ៍ច្រើនរួចហើយ។ ព្យាយាមលុបចោលខ្លះ។",
        "description": ""
    },
    "settings": {
        "message": "ការកំណត់",
        "description": "Menu item and header for global settings"
    },
    "theme": {
        "message": "រូបរាង",
        "description": "Header for theme settings"
    },
    "permissions": {
        "message": "ការអនុញ្ញាត",
        "description": "Header for permissions section of settings"
    },
    "mediaPermissionsDescription": {
        "message": "បើកសិទ្ធិប្រើប្រាស់កាមេរ៉ា និងម៉ៃក្រូហ្វូន",
        "description": "Description of the media permission description"
    },
    "general": {
        "message": "ទូទៅ",
        "description": "Header for general options on the settings screen"
    },
    "spellCheckDescription": {
        "message": "បើកការត្រួតពិនិត្យអក្ខរាវិរុទ្ធនៃពាក្យដែលបានបញ្ចូលក្នុងប្រអប់ផ្ញើសារ",
        "description": "Description of the media permission description"
    },
    "clearDataHeader": {
        "message": "សំអាតទិន្នន័យ",
        "description": "Header in the settings dialog for the section dealing with data deletion"
    },
    "clearDataExplanation": {
        "message": "វានឹងសំអាតទិន្នន័យទាំងអស់ក្នុងកម្មវិធី, នឹងលុបចោលសារទាំងអស់ និងព័ត៌មានគណនីដែលបានរក្សាទុក។",
        "description": "Text describing what the clear data button will do."
    },
    "clearDataButton": {
        "message": "សំអាតទិន្នន័យ",
        "description": "Button in the settings dialog starting process to delete all data"
    },
    "deleteAllDataHeader": {
        "message": "លុបចោលទិន្នន័យទាំងអស់?",
        "description": "Header of the full-screen delete data confirmation screen"
    },
    "deleteAllDataBody": {
        "message": "អ្នករៀបនឹងលុបព័ត៌មានគណនី ដែលបានរក្សាទុកទាំងអស់​របស់កម្មវិធីនេះ រួមទាំង បញ្ជីទំនាក់ទំនងនិងសារទាំងអស់។ អ្នកតែងតែអាចភ្ជាប់ជាមួយឧបករណ៍ចល័តរបស់អ្នកម្ដងទៀត ប៉ុន្តែវានឹងមិនអាចស្តារសារដែលបានលុបនោះទេ។",
        "description": "Text describing what exactly will happen if the user clicks the button to delete all data"
    },
    "deleteAllDataButton": {
        "message": "លុបចោលទិន្នន័យទាំងអស់",
        "description": "Text of the button that deletes all data"
    },
    "deleteAllDataProgress": {
        "message": "កំពុងផ្តាច់ និងលុបចោលទិន្នន័យទាំងអស់",
        "description": "Message shown to user when app is disconnected and data deleted"
    },
    "notifications": {
        "message": "ការជូនដំណឹង",
        "description": "Header for notification settings"
    },
    "notificationSettingsDialog": {
        "message": "ពេលទទួលសារ បង្ហាញការជូនដំណឹងដែលមាន៖",
        "description": "Explain the purpose of the notification settings"
    },
    "disableNotifications": {
        "message": "បិទការជូនដំណឹង",
        "description": "Label for disabling notifications"
    },
    "nameAndMessage": {
        "message": "ទាំងឈ្មោះអ្នកផ្ញើ និងសារ",
        "description": "Label for setting notifications to display name and message text"
    },
    "noNameOrMessage": {
        "message": "គ្មានឈ្មោះ ឬ សារ",
        "description": "Label for setting notifications to display no name and no message text"
    },
    "nameOnly": {
        "message": "មានតែឈ្មោះអ្នកផ្ញើ",
        "description": "Label for setting notifications to display sender name only"
    },
    "newMessage": {
        "message": "សារថ្មី",
        "description": "Displayed in notifications for only 1 message"
    },
    "newMessages": {
        "message": "សារថ្មី",
        "description": "Displayed in notifications for multiple messages"
    },
    "notificationMostRecentFrom": {
        "message": "ថ្មីៗបំផុតពី៖",
        "description": "Displayed in notifications when setting is 'name only' and more than one message is waiting"
    },
    "notificationFrom": {
        "message": "ពី៖",
        "description": "Displayed in notifications when setting is 'name only' and one message is waiting"
    },
    "notificationMostRecent": {
        "message": "ថ្មីៗបំផុត៖",
        "description": "Displayed in notifications when setting is 'name and message' and more than one message is waiting"
    },
    "sendFailed": {
        "message": "ផ្ញើបរាជ័យ",
        "description": "Shown on outgoing message if it fails to send"
    },
    "showMore": {
        "message": "លម្អិត",
        "description": "Displays the details of a key change"
    },
    "showLess": {
        "message": "លាក់ ខ្លឹមសារលម្អិត",
        "description": "Hides the details of a key change"
    },
    "learnMore": {
        "message": "ស្វែងយល់បន្ថែមពីការផ្ទៀងផ្ទាត់លេខសុវត្ថិភាព",
        "description": "Text that links to a support article on verifying safety numbers"
    },
    "expiredWarning": {
        "message": "ជំនាន់ Signal Desktop នេះ បានហួសសុពលភាព។ សូមដំឡើងទីកាន់ជំនាន់ចុងក្រោយ ដើម្បីបន្តការផ្ញើសារ។",
        "description": "Warning notification that this version of the app has expired"
    },
    "upgrade": {
        "message": "ដំឡើង",
        "description": "Label text for button to upgrade the app to the latest version"
    },
    "mediaMessage": {
        "message": "សារមេឌា",
        "description": "Description of a message that has an attachment and no text, displayed in the conversation list as a preview."
    },
    "unregisteredUser": {
        "message": "លេខ មិនបានចុះឈ្មោះ",
        "description": "Error message displayed when sending to an unregistered user."
    },
    "sync": {
        "message": "បញ្ជីទំនាក់ទំនង",
        "description": "Label for contact and group sync settings"
    },
    "syncExplanation": {
        "message": "នាំចូលក្រុម និងបញ្ជីទំនាក់ទំនង Signalទាំងអស់ ពីទូរស័ព្ទរបស់អ្នក។",
        "description": "Explanatory text for sync settings"
    },
    "lastSynced": {
        "message": "នាំចូលចុងក្រោយនៅ",
        "description": "Label for date and time of last sync operation"
    },
    "syncNow": {
        "message": "នាំចូលឥឡូវ",
        "description": "Label for a button that syncs contacts and groups from your phone"
    },
    "syncing": {
        "message": "កំពុងនាំចូល...",
        "description": "Label for a disabled sync button while sync is in progress."
    },
    "syncFailed": {
        "message": "ការនាំចូលបរាជ័យ។ ត្រូវប្រាកដថាកុំព្យូទ័រ និងទូរស័ព្ទរបស់អ្នកបានតភ្ជាប់ទៅកាន់អ៊ិនធឺណិត។",
        "description": "Informational text displayed if a sync operation times out."
    },
    "timestamp_s": {
        "message": "ឥឡូវ",
        "description": "Brief timestamp for messages sent less than a minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_m": {
        "message": "1 នាទី",
        "description": "Brief timestamp for messages sent about one minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_h": {
        "message": "1 ម៉ោង",
        "description": "Brief timestamp for messages sent about one hour ago. Displayed in the conversation list and message bubble."
    },
    "hoursAgoShort": {
        "message": "$hours$ ម៉ោង",
        "description": "Even further contracted form of 'X hours ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "hoursAgo": {
        "message": "$hours$ ម៉ោង មុន",
        "description": "Contracted form of 'X hours ago' which works both for singular and plural",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "minutesAgoShort": {
        "message": "$minutes$ នាទី",
        "description": "Even further contracted form of 'X minutes ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "minutesAgo": {
        "message": "$minutes$ នាទី មុន",
        "description": "Contracted form of 'X minutes ago' which works both for singular and plural",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "justNow": {
        "message": "ឥឡូវ",
        "description": "Shown if a message is very recent, less than 60 seconds old"
    },
    "timestampFormat_M": {
        "message": "ខែ ថ្ងៃ",
        "description": "Timestamp format string for displaying month and day (but not the year) of a date within the current year, ex: use 'MMM D' for 'Aug 8', or 'D MMM' for '8 Aug'."
    },
    "unblockToSend": {
        "message": "ដោះការហាមឃាត់លេខទំនាក់ទំនងនេះ ដើម្បីផ្ញើសារ។",
        "description": "Brief message shown when trying to message a blocked number"
    },
    "unblockGroupToSend": {
        "message": "មិនការទប់ស្កាត់ក្រុមនេះ ដើម្បីផ្ញើសារ។",
        "description": "Brief message shown when trying to message a blocked group"
    },
    "youChangedTheTimer": {
        "message": "អ្នកបានកំណត់រយៈពេលសារបាត់ទៅវិញជា $time$",
        "description": "Message displayed when you change the message expiration timer in a conversation.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetOnSync": {
        "message": "រយៈពេលសារបាត់ទៅវិញបានកែប្រែទៅកាន់ $time$",
        "description": "Message displayed when timer is set on initial link of desktop device.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "theyChangedTheTimer": {
        "message": "$name$ បានកំណត់រយៈពេលសារបាត់ទៅវិញជា $time$",
        "description": "Message displayed when someone else changes the message expiration timer in a conversation.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            },
            "time": {
                "content": "$2",
                "example": "10m"
            }
        }
    },
    "timerOption_0_seconds": {
        "message": "បិទ",
        "description": "Label for option to turn off message expiration in the timer menu"
    },
    "timerOption_5_seconds": {
        "message": "5 វិនាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_10_seconds": {
        "message": "10 វិនាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_seconds": {
        "message": "30 វិនាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_minute": {
        "message": "1 នាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_5_minutes": {
        "message": "5 នាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_minutes": {
        "message": "30 នាទី",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_hour": {
        "message": "1 ម៉ោង",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_6_hours": {
        "message": "6 ម៉ោង",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_12_hours": {
        "message": "12 ម៉ោង",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_day": {
        "message": "1 ថ្ងៃ",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_week": {
        "message": "1 សប្តាហ៍",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "disappearingMessages": {
        "message": "សារបាត់ទៅវិញ",
        "description": "Conversation menu option to enable disappearing messages"
    },
    "timerOption_0_seconds_abbreviated": {
        "message": "បិទ",
        "description": "Short format indicating current timer setting in the conversation list snippet"
    },
    "timerOption_5_seconds_abbreviated": {
        "message": "5វិ",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_10_seconds_abbreviated": {
        "message": "10វិ",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_seconds_abbreviated": {
        "message": "30វិ",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_minute_abbreviated": {
        "message": "1ន",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_5_minutes_abbreviated": {
        "message": "5ន",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_minutes_abbreviated": {
        "message": "30ន",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_hour_abbreviated": {
        "message": "1ម",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_6_hours_abbreviated": {
        "message": "6ម",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_12_hours_abbreviated": {
        "message": "12ម",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_day_abbreviated": {
        "message": "1ថ",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_week_abbreviated": {
        "message": "1ស",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "disappearingMessagesDisabled": {
        "message": "សារបាត់ទៅវិញបានបិទ",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disabledDisappearingMessages": {
        "message": "$name$ បានបិទសារបាត់ទៅវិញ",
        "description": "Displayed in the conversation list when the timer is turned off",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "youDisabledDisappearingMessages": {
        "message": "អ្នកបានបិទសារបាត់ទៅវិញ",
        "description": "Displayed in the conversation list when the timer is turned off"
    },
    "timerSetTo": {
        "message": "រយៈពេលបានកំណត់$time$",
        "description": "Displayed in the conversation list when the timer is updated by some automatic action, or in the left pane",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "1w"
            }
        }
    },
    "audioNotificationDescription": {
        "message": "លេងសំឡេងជូនដំណឹង",
        "description": "Description for audio notification setting"
    },
    "safetyNumberChanged": {
        "message": "លេខសុវត្ថិភាពបានផ្លាស់ប្តូរ",
        "description": "A notification shown in the conversation when a contact reinstalls"
    },
    "safetyNumberChangedGroup": {
        "message": "លេខសុវត្ថិភាពជាមួយ$name$ បានផ្លាស់ប្តូរ",
        "description": "A notification shown in a group conversation when a contact reinstalls, showing the contact name",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "verifyNewNumber": {
        "message": "ផ្ទៀងផ្ទាត់លេខសុវត្ថិភាព",
        "description": "Label on button included with safety number change notification in the conversation"
    },
    "yourSafetyNumberWith": {
        "message": "លេខសុវត្ថិភាពជាមួយ $name$៖",
        "description": "Heading for safety number view",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "themeLight": {
        "message": "ភ្លឺ",
        "description": "Label text for light theme (normal)"
    },
    "themeDark": {
        "message": "ងងឹត",
        "description": "Label text for dark theme"
    },
    "noteToSelf": {
        "message": "កំណត់ចំណាំ",
        "description": "Name for the conversation with your own phone number"
    },
    "hideMenuBar": {
        "message": "លាក់របារម៉ឺនុយ",
        "description": "Label text for menu bar visibility setting"
    },
    "startConversation": {
        "message": "ចាប់ផ្តើមការសន្ទនាថ្មី...",
        "description": "Label underneath number a user enters that is not an existing contact"
    },
    "newPhoneNumber": {
        "message": "បញ្ចូលលេខទូរស័ព្ទ ដើម្បីបន្ថែមលេខទំនាក់ទំនង។",
        "description": "Placeholder for adding a new number to a contact"
    },
    "invalidNumberError": {
        "message": "លេខមិនត្រឹមត្រូវ",
        "description": "When a person inputs a number that is invalid"
    },
    "unlinkedWarning": {
        "message": "តភ្ជាប់ Signal Desktop ទៅកាន់ទូរស័ព្ទរបស់អ្នកឡើងវិញ ដើម្បីបន្តការផ្ញើសារ។",
        "description": ""
    },
    "unlinked": {
        "message": "បានផ្តាច់",
        "description": ""
    },
    "relink": {
        "message": "តភ្ជាប់ឡើងវិញ",
        "description": ""
    },
    "autoUpdateNewVersionTitle": {
        "message": "មានបច្ចុប្បន្នភាព Session",
        "description": ""
    },
    "autoUpdateNewVersionMessage": {
        "message": "មានSessionជំនាន់ថ្មី",
        "description": ""
    },
    "autoUpdateNewVersionInstructions": {
        "message": "ចុច បើក Sessionឡើងវិញ ដើម្បីដំណើការបច្ចុប្បន្នភាព។",
        "description": ""
    },
    "autoUpdateRestartButtonLabel": {
        "message": "បើកSession ឡើងវិញ",
        "description": ""
    },
    "autoUpdateLaterButtonLabel": {
        "message": "លើកក្រោយ",
        "description": ""
    },
    "leftTheGroup": {
        "message": "$name$ បានចេញពីក្រុម",
        "description": "Shown in the conversation history when a single person leaves the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleLeftTheGroup": {
        "message": "$name$ បានចេញពីក្រុម",
        "description": "Shown in the conversation history when multiple people leave the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "updatedTheGroup": {
        "message": "ក្រុមបានធ្វើបច្ចុប្បន្នភាព",
        "description": "Shown in the conversation history when someone updates the group"
    },
    "titleIsNow": {
        "message": "ចំណងជើងឥឡូវគឺ '$name$'",
        "description": "Shown in the conversation history when someone changes the title of the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Book Club"
            }
        }
    },
    "joinedTheGroup": {
        "message": "$name$ បានចូលក្រុម",
        "description": "Shown in the conversation history when a single person joins the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "multipleJoinedTheGroup": {
        "message": "$names$ បានចូលក្រុម",
        "description": "Shown in the conversation history when more than one person joins the group",
        "placeholders": {
            "names": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    }
}
