{
    "copyErrorAndQuit": {
        "message": "Copier l’erreur et quitter",
        "description": "Shown in the top-level error popup, allowing user to copy the error text and close the app"
    },
    "unknownGroup": {
        "message": "Groupe inconnu",
        "description": "Shown as the name of a group if we don't have any information about it"
    },
    "databaseError": {
        "message": "Erreur de base de données",
        "description": "Shown in a popup if the database cannot start up properly"
    },
    "deleteAndRestart": {
        "message": "Supprimer toutes les données et relancer",
        "description": "Shown in a popup if the database cannot start up properly; allows user to dalete database and restart"
    },
    "mainMenuFile": {
        "message": "&Fichier",
        "description": "The label that is used for the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuEdit": {
        "message": "É&dition",
        "description": "The label that is used for the Edit menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuView": {
        "message": "&Affichage",
        "description": "The label that is used for the View menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuWindow": {
        "message": "F&enêtre",
        "description": "The label that is used for the Window menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuHelp": {
        "message": "A&ide",
        "description": "The label that is used for the Help menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuSettings": {
        "message": "Préférences…",
        "description": "The label that is used for the Preferences menu in the program main menu. This should be consistent with the standard naming for ‘Preferences’ on the operating system."
    },
    "appMenuHide": {
        "message": "Cacher",
        "description": "Application menu command to hide the window"
    },
    "appMenuHideOthers": {
        "message": "Cacher les autres",
        "description": "Application menu command to hide all other windows"
    },
    "appMenuUnhide": {
        "message": "Tout afficher",
        "description": "Application menu command to show all application windows"
    },
    "appMenuQuit": {
        "message": "Quitter Signal",
        "description": "Application menu command to close the application"
    },
    "editMenuUndo": {
        "message": "Annuler",
        "description": "Edit menu command to remove recently-typed text"
    },
    "editMenuRedo": {
        "message": "Rétablir",
        "description": "Edit menu command to restore previously undone typed text"
    },
    "editMenuCut": {
        "message": "Couper",
        "description": "Edit menu command to remove selected text and add it to clipboard"
    },
    "editMenuCopy": {
        "message": "Copier",
        "description": "Edit menu command to add selected text to clipboard"
    },
    "editMenuPaste": {
        "message": "Coller",
        "description": "Edit menu command to insert text from clipboard at cursor location"
    },
    "editMenuPasteAndMatchStyle": {
        "message": "Coller et faire correspondre le style",
        "description": "Edit menu command to insert text from clipboard at cursor location, taking only text and not style information"
    },
    "editMenuDelete": {
        "message": "Supprimer",
        "description": "Edit menu command to remove the selected text"
    },
    "editMenuSelectAll": {
        "message": "Tout sélectionner",
        "description": "Edit menu comand to select all of the text in selected text box"
    },
    "editMenuStartSpeaking": {
        "message": "Commencer à parler",
        "description": "Edit menu item under 'speech' to start dictation"
    },
    "editMenuStopSpeaking": {
        "message": "Arrêter de parler",
        "description": "Edit menu item under 'speech' to stop dictation"
    },
    "windowMenuClose": {
        "message": "Fermer la fenêtre",
        "description": "Window menu command to close the current window"
    },
    "windowMenuMinimize": {
        "message": "Réduire",
        "description": "Window menu command to minimize the current window"
    },
    "windowMenuZoom": {
        "message": "Agrandir",
        "description": "Window menu command to make the current window the size of the whole screen"
    },
    "windowMenuBringAllToFront": {
        "message": "Tout amener à l’avant-plan",
        "description": "Window menu command to bring all windows of current applicatinon to front"
    },
    "viewMenuResetZoom": {
        "message": "Taille réelle",
        "description": "View menu command to go back to the default zoom"
    },
    "viewMenuZoomIn": {
        "message": "Zoom avant",
        "description": "View menu command to make everything bigger"
    },
    "viewMenuZoomOut": {
        "message": "Zoom arrière",
        "description": "View menu command to make everything smaller"
    },
    "viewMenuToggleFullScreen": {
        "message": "Activer/désactiver le plein écran",
        "description": "View menu command to enter or leave Full Screen mode"
    },
    "viewMenuToggleDevTools": {
        "message": "Afficher/cacher les outils pour développeurs",
        "description": "View menu command to show or hide the developer tools"
    },
    "menuSetupWithImport": {
        "message": "Configurer avec importation",
        "description": "When the application is not yet set up, menu option to start up the import sequence"
    },
    "menuSetupAsNewDevice": {
        "message": "Configurer comme nouvel appareil",
        "description": "When the application is not yet set up, menu option to start up the set up as fresh device"
    },
    "menuSetupAsStandalone": {
        "message": "Configurer comme appareil autonome",
        "description": "Only available on development modes, menu option to open up the standalone device setup sequence"
    },
    "loading": {
        "message": "Chargement…",
        "description": "Message shown on the loading screen before we've loaded any messages"
    },
    "optimizingApplication": {
        "message": "Optimisation de l’application…",
        "description": "Message shown on the loading screen while we are doing application optimizations"
    },
    "migratingToSQLCipher": {
        "message": "Optimisation des messages… $status$ terminés.",
        "description": "Message shown on the loading screen while we are doing application optimizations",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "45/200"
            }
        }
    },
    "archivedConversations": {
        "message": "Conversations archivées",
        "description": "Shown in place of the search box when showing archived conversation list"
    },
    "archiveHelperText": {
        "message": "Ces conversations sont archivées et n’apparaîtront dans la boîte de réception que si de nouveaux messages sont reçus.",
        "description": "Shown at the top of the archived converations list in the left pane"
    },
    "archiveConversation": {
        "message": "Archiver la conversation",
        "description": "Shown in menu for conversation, and moves conversation out of main conversation list"
    },
    "moveConversationToInbox": {
        "message": "Déplacer la conversation vers la boite de réception",
        "description": "Undoes Archive Conversation action, and moves archived conversation back to the main conversation list"
    },
    "chooseDirectory": {
        "message": "Sélectionner un dossier",
        "description": "Button to allow the user to find a folder on disk"
    },
    "chooseFile": {
        "message": "Choisir un fichier",
        "description": "Button to allow the user to find a file on disk"
    },
    "loadDataHeader": {
        "message": "Chargez vos données",
        "description": "Header shown on the first screen in the data import process"
    },
    "loadDataDescription": {
        "message": "Vous venez de passer par le processus d’exportation, et vos contacts et messages attendent patiemment sur votre ordinateur. Sélectionnez le dossier contenant vos données relatives à Signal enregistrées.",
        "description": "Introduction to the process of importing messages and contacts from disk"
    },
    "importChooserTitle": {
        "message": "Sélectionner le répertoire contenant les données exportées",
        "description": "Title of the popup window used to select data previously exported"
    },
    "importErrorHeader": {
        "message": "Une erreur s’est produite !",
        "description": "Header of the error screen after a failed import"
    },
    "importingHeader": {
        "message": "Chargement des contacts et messages",
        "description": "Header of screen shown as data is import"
    },
    "importErrorFirst": {
        "message": "Assurez-vous d’avoir sélectionné le bon répertoire contenant vos données relatives à Signal enregistrées. Son nom devrait commencer par « Signal Export ». Vous pouvez également enregistrer une nouvelle copie de vos données à partir de l’application Chrome.",
        "description": "Message shown if the import went wrong; first paragraph"
    },
    "importErrorSecond": {
        "message": "Si ces étapes ne fonctionnent pas, veuillez envoyer un journal de débogage (Affichage -> Journal de débogage) afin que nous puissions vous aider à migrer !",
        "description": "Message shown if the import went wrong; second paragraph"
    },
    "importAgain": {
        "message": "Sélectionner un dossier et ressayer",
        "description": "Button shown if the user runs into an error during import, allowing them to start over"
    },
    "importCompleteHeader": {
        "message": "L’importation est réussie !",
        "description": "Header shown on the screen at the end of a successful import process"
    },
    "importCompleteStartButton": {
        "message": "Commencez à utiliser Signal Desktop pour ordinateur",
        "description": "Button shown at end of successful import process, nothing left but a restart"
    },
    "importCompleteLinkButton": {
        "message": "Relier cet appareil à votre téléphone",
        "description": "Button shown at end of successful 'light' import process, so the standard linking process still needs to happen"
    },
    "selectedLocation": {
        "message": "votre emplacement sélectionné",
        "description": "Message shown as the export location if we didn't capture the target directory"
    },
    "upgradingDatabase": {
        "message": "Mise à niveau de la base de données. Cela peut prendre un certain temps…",
        "description": "Message shown on the loading screen when we're changing database structure on first run of a new version"
    },
    "loadingMessages": {
        "message": "Chargement des messages. $count$ jusqu’à présent…",
        "description": "Message shown on the loading screen when we're catching up on the backlog of messages",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "me": {
        "message": "Moi",
        "description": "The label for yourself when shown in a group member list"
    },
    "view": {
        "message": "Afficher",
        "description": "Used as a label on a button allowing user to see more information"
    },
    "youLeftTheGroup": {
        "message": "Vous avez quitté le groupe",
        "description": "Displayed when a user can't send a message because they have left the group"
    },
    "scrollDown": {
        "message": "Faire défiler vers le bas de la conversation",
        "description": "Alt text for button to take user down to bottom of conversation, shown when user scrolls up"
    },
    "messageBelow": {
        "message": "Nouveau message ci-dessous",
        "description": "Alt text for button to take user down to bottom of conversation with a new message out of screen"
    },
    "messagesBelow": {
        "message": "Nouveaux messages ci-dessous",
        "description": "Alt text for button to take user down to bottom of conversation with more than one message out of screen"
    },
    "unreadMessage": {
        "message": "1 message non lu",
        "description": "Text for unread message separator, just one message"
    },
    "unreadMessages": {
        "message": "$count$ messages non lus",
        "description": "Text for unread message separator, with count",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "youMarkedAsVerified": {
        "message": "Vous avez marqué votre numéro de sécurité avec $name$ comme vérifié",
        "description": "Shown in the conversation history when the user marks a contact as verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerified": {
        "message": "Vous avez marqué votre numéro de sécurité avec $name$ comme non vérifié",
        "description": "Shown in the conversation history when the user marks a contact as not verified, whether on the Safety Number screen or by dismissing a banner or dialog.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsVerifiedOtherDevice": {
        "message": "Vous avez marqué votre numéro de sécurité avec $name$ comme vérifié à partir d’un autre appareil.",
        "description": "Shown in the conversation history when we discover that the user marked a contact as verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerifiedOtherDevice": {
        "message": "Vous avez marqué votre numéro de sécurité avec $name$ comme non vérifié à partir d’un autre appareil",
        "description": "Shown in the conversation history when we discover that the user marked a contact as not verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "membersNeedingVerification": {
        "message": "Vos numéros de sécurité avec les membres de ce groupe ont changé depuis votre dernière vérification. Cliquez sur un membre du groupe pour visualiser votre nouveau numéro de sécurité avec ce membre.",
        "description": "When there are multiple previously-verified group members with safety number changes, a banner will be shown. The list of contacts with safety number changes is shown, and this text introduces that list."
    },
    "changedSinceVerifiedMultiple": {
        "message": "Vos numéros de sécurité avec plusieurs membres du groupe ont changé depuis votre dernière vérification. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit qu’ils ont simplement réinstallé Signal.",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedSinceVerified": {
        "message": "Votre numéro de sécurité avec $name$ a changé depuis votre dernière conversation. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit que $name$ a simplement réinstallé Signal.",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRightAfterVerify": {
        "message": "Le numéro de sécurité que vous essayez de vérifier a changé. Veuillez réviser votre nouveau numéro de sécurité avec $name$. Rappelez-vous que ce changement pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit que $name$ a simplement réinstallé Signal.",
        "description": "Shown on the safety number screen when the user has selected to verify/unverify a contact's safety number, and we immediately discover a safety number change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRecentlyMultiple": {
        "message": "Vos numéros de sécurité avec plusieurs membres du groupe ont changé récemment. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit qu’ils ont simplement réinstallé Signal.",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedRecently": {
        "message": "Votre numéro de sécurité avec $name$ a changé récemment. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit que $name$ a simplement réinstallé Signal.",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "identityKeyErrorOnSend": {
        "message": "Votre numéro de sécurité avec $name$ a changé. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit que $name$ a simplement réinstallé Signal. Vous devriez peut-être vérifier votre numéro de sécurité avec ce contact.",
        "description": "Shown when user clicks on a failed recipient in the message detail view after an identity key change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "sendAnyway": {
        "message": "Envoyer quand même",
        "description": "Used on a warning dialog to make it clear that it might be risky to send the message."
    },
    "noLongerVerified": {
        "message": "Votre numéro de sécurité avec $name$ a changé et n’est plus vérifié. Cliquez pour l’afficher.",
        "description": "Shown in converation banner when user's safety number has changed, but they were previously verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleNoLongerVerified": {
        "message": "Vos numéros de sécurité avec plusieurs membres de ce groupe ont changé et ne sont plus vérifiés. Cliquez pour afficher.",
        "description": "Shown in conversation banner when more than one group member's safety number has changed, but they were previously verified."
    },
    "debugLogExplanation": {
        "message": "Ce journal sera publié en ligne publiquement pour être consulté par les contributeurs. Vous pouvez l’examiner et l’éditer avant de l’envoyer.",
        "description": ""
    },
    "debugLogError": {
        "message": "Un problème est survenu lors du téléversement ! Veuillez envisager d’ajouter manuellement votre journal à votre rapport de bogue.",
        "description": ""
    },
    "reportIssue": {
        "message": "Signaler un problème",
        "description": "Link to open the issue tracker"
    },
    "gotIt": {
        "message": "D’accord !",
        "description": "Label for a button that dismisses a dialog. The user clicks it to confirm that they understand the message in the dialog."
    },
    "submit": {
        "message": "Envoyer",
        "description": ""
    },
    "acceptNewKey": {
        "message": "Accepter",
        "description": "Label for a button to accept a new safety number"
    },
    "verify": {
        "message": "Marquer comme vérifié",
        "description": ""
    },
    "unverify": {
        "message": "Marquer comme non vérifié",
        "description": ""
    },
    "isVerified": {
        "message": "Vous avez vérifié votre numéro de sécurité avec $name$.",
        "description": "Summary state shown at top of the safety number screen if user has verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "isNotVerified": {
        "message": "Vous n’avez pas vérifié votre numéro de sécurité avec $name$",
        "description": "Summary state shown at top of the safety number screen if user has not verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "verified": {
        "message": "Vérifié",
        "description": ""
    },
    "newIdentity": {
        "message": "Nouveau numéro de sécurité",
        "description": "Header for a key change dialog"
    },
    "identityChanged": {
        "message": "Votre numéro de sécurité avec ce contact a changé. Cela pourrait signifier soit que quelqu’un tente d’intercepter votre communication, soit que ce contact a simplement réinstallé Signal. Vous devriez peut-être vérifier le nouveau numéro de sécurité ce-dessous.",
        "description": ""
    },
    "incomingError": {
        "message": "Erreur de traitement du message entrant",
        "description": ""
    },
    "media": {
        "message": "Médias",
        "description": "Header of the default pane in the media gallery, showing images and videos"
    },
    "mediaEmptyState": {
        "message": "Vous n’avez aucun fichier média dans cette conversation",
        "description": "Message shown to user in the media gallery when there are no messages with media attachments (images or video)"
    },
    "documents": {
        "message": "Documents",
        "description": "Header of the secondary pane in the media gallery, showing every non-media attachment"
    },
    "documentsEmptyState": {
        "message": "Vous n’avez aucun document dans cette conversation",
        "description": "Message shown to user in the media gallery when there are no messages with document attachments (anything other than images or video)"
    },
    "today": {
        "message": "Aujourd’hui",
        "description": "Section header in the media gallery"
    },
    "yesterday": {
        "message": "Hier",
        "description": "Section header in the media gallery"
    },
    "thisWeek": {
        "message": "Cette semaine",
        "description": "Section header in the media gallery"
    },
    "thisMonth": {
        "message": "Ce mois",
        "description": "Section header in the media gallery"
    },
    "unsupportedAttachment": {
        "message": "Le type de pièce jointe n’est pas pris en charge. Cliquez pour l’enregistrer.",
        "description": "Displayed for incoming unsupported attachment"
    },
    "clickToSave": {
        "message": "Cliquer pour enregistrer",
        "description": "Hover text for attachment filenames"
    },
    "unnamedFile": {
        "message": "Fichier sans nom",
        "description": "Hover text for attachment filenames"
    },
    "voiceMessage": {
        "message": "Message vocal",
        "description": "Name for a voice message attachment"
    },
    "dangerousFileType": {
        "message": "Le type de fichier joint n’est pas autorisé pour des raisons de sécurité",
        "description": "Shown in toast when user attempts to send .exe file, for example"
    },
    "loadingPreview": {
        "message": "Chargement de l’aperçu…",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area"
    },
    "stagedPreviewThumbnail": {
        "message": "Brouillon d’imagette d’aperçu de lien pour $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "previewThumbnail": {
        "message": "Imagette d’aperçu de lien pour $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "stagedImageAttachment": {
        "message": "Brouillon d’image jointe : $path$",
        "description": "Alt text for staged attachments",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "dog.jpg"
            }
        }
    },
    "oneNonImageAtATimeToast": {
        "message": "Pour un fichier joint qui n’est pas une image, la limite est un fichier joint par message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "cannotMixImageAndNonImageAttachments": {
        "message": "Vous ne pouvez pas joindre à la fois image et non image dans le même message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "maximumAttachments": {
        "message": "Vous ne pouvez pas ajouter d’autres fichiers joints à ce message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "fileSizeWarning": {
        "message": "Désolé, le fichier sélectionné dépasse la limite de taille des messages.",
        "description": ""
    },
    "unableToLoadAttachment": {
        "message": "Impossible de charger le fichier joint sélectionné.",
        "description": ""
    },
    "disconnected": {
        "message": "L’application est déconnectée",
        "description": "Displayed when the desktop client cannot connect to the server."
    },
    "connecting": {
        "message": "Connexion",
        "description": "Displayed when the desktop client is currently connecting to the server."
    },
    "offline": {
        "message": "Hors ligne",
        "description": "Displayed when the desktop client has no network connection."
    },
    "checkNetworkConnection": {
        "message": "Vérifiez votre connexion au réseau.",
        "description": "Obvious instructions for when a user's computer loses its network connection"
    },
    "attemptingReconnection": {
        "message": "Tentative de reconnexion $reconnect_duration_in_seconds$ secondes",
        "description": "",
        "placeholders": {
            "reconnect_duration_in_seconds": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "submitDebugLog": {
        "message": "Journal de débogage",
        "description": "Menu item and header text for debug log modal (sentence case)"
    },
    "debugLog": {
        "message": "Journal de débogage",
        "description": "View menu item to open the debug log (title case)"
    },
    "goToReleaseNotes": {
        "message": "Accéder aux notes de mise à jour",
        "description": ""
    },
    "goToForums": {
        "message": "Accéder aux forums",
        "description": "Item under the Help menu, takes you to the forums"
    },
    "goToSupportPage": {
        "message": "Accéder à la page d’assistance",
        "description": "Item under the Help menu, takes you to the support page"
    },
    "menuReportIssue": {
        "message": "Signaler un problème",
        "description": "Item under the Help menu, takes you to GitHub new issue form (title case)"
    },
    "signalDesktopPreferences": {
        "message": "Préférences de Signal Desktop pour ordinateur",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "aboutSignalDesktop": {
        "message": "À propos de Signal Desktop pour ordinateur",
        "description": "Item under the Help menu, which opens a small about window"
    },
    "speech": {
        "message": "Parole",
        "description": "Item under the Edit menu, with 'start/stop speaking' items below it"
    },
    "show": {
        "message": "Afficher",
        "description": "Command under Window menu, to show the window"
    },
    "hide": {
        "message": "Cacher",
        "description": "Command in the tray icon menu, to hide the window"
    },
    "quit": {
        "message": "Quitter",
        "description": "Command in the tray icon menu, to quit the application"
    },
    "signalDesktop": {
        "message": "Signal Desktop pour ordinateur",
        "description": "Tooltip for the tray icon"
    },
    "search": {
        "message": "Chercher",
        "description": "Placeholder text in the search input"
    },
    "noSearchResults": {
        "message": "Aucun résultat pour « $searchTerm$ »",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            }
        }
    },
    "conversationsHeader": {
        "message": "Conversations",
        "description": "Shown to separate the types of search results"
    },
    "contactsHeader": {
        "message": "Contacts",
        "description": "Shown to separate the types of search results"
    },
    "messagesHeader": {
        "message": "Messages",
        "description": "Shown to separate the types of search results"
    },
    "welcomeToSession": {
        "message": "Bienvenue sur Signal",
        "description": ""
    },
    "selectAContact": {
        "message": "Sélectionnez un contact ou un groupe pour lancer une conversation.",
        "description": ""
    },
    "typingAlt": {
        "message": "Animation de saisie pour cette conversation",
        "description": "Used as the 'title' attibute for the typing animation"
    },
    "contactAvatarAlt": {
        "message": "Avatar pour le contact $name$",
        "description": "Used in the alt tag for the image avatar of a contact",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "sendMessageToContact": {
        "message": "Envoyer un message",
        "description": "Shown when you are sent a contact and that contact has a signal account"
    },
    "home": {
        "message": "domicile",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "work": {
        "message": "travail",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "mobile": {
        "message": "mobile",
        "description": "Shown on contact detail screen as a label for aa phone or email"
    },
    "email": {
        "message": "courriel",
        "description": "Generic label shown if contact email has custom type but no label"
    },
    "phone": {
        "message": "téléphone",
        "description": "Generic label shown if contact phone has custom type but no label"
    },
    "address": {
        "message": "adresse",
        "description": "Generic label shown if contact address has custom type but no label"
    },
    "poBox": {
        "message": "Boîte postale",
        "description": "When rendering an address, used to provide context to a post office box"
    },
    "downloading": {
        "message": "Téléchargement",
        "description": "Shown in the message bubble while a long message attachment is being downloaded"
    },
    "downloadAttachment": {
        "message": "Télécharger la pièce jointe",
        "description": "Shown in a message's triple-dot menu if there isn't room for a dedicated download button"
    },
    "replyToMessage": {
        "message": "Répondre au message",
        "description": "Shown in triple-dot menu next to message to allow user to start crafting a message with a quotation"
    },
    "originalMessageNotFound": {
        "message": "Le message original est introuvable",
        "description": "Shown in quote if reference message was not found as message was initially downloaded and processed"
    },
    "originalMessageNotAvailable": {
        "message": "Le message original n’est plus disponible",
        "description": "Shown in toast if user clicks on quote that references message no longer in database"
    },
    "messageFoundButNotLoaded": {
        "message": "Le message original a été trouvé, mais n’a pas été chargé. Faites défiler vers le haut pour le charger.",
        "description": "Shown in toast if user clicks on quote references messages not loaded in view, but in database"
    },
    "voiceNoteMustBeOnlyAttachment": {
        "message": "Une note vocale doit être le seul fichier joint à un message.",
        "description": "Shown in toast if tries to record a voice note with any staged attachments"
    },
    "you": {
        "message": "Vous",
        "description": "In Android theme, shown in quote if you or someone else replies to you"
    },
    "replyingTo": {
        "message": "Réponse à $name$",
        "description": "Shown in iOS theme when you or someone quotes to a message which is not from you",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "audioPermissionNeeded": {
        "message": "Afin d’envoyer des messages audio, autorisez Signal Desktop pour ordinateur à accéder à votre micro.",
        "description": "Shown if the user attempts to send an audio message without audio permssions turned on"
    },
    "allowAccess": {
        "message": "Autoriser l’accès",
        "description": "Button shown in popup asking to enable microphon/video permissions to send audio messages"
    },
    "showSettings": {
        "message": "Afficher les paramètres",
        "description": "A button shown in dialog requesting the user to turn on audio permissions"
    },
    "audio": {
        "message": "Audio",
        "description": "Shown in a quotation of a message containing an audio attachment if no text was originally provided with that attachment"
    },
    "video": {
        "message": "Vidéo",
        "description": "Shown in a quotation of a message containing a video if no text was originally provided with that video"
    },
    "photo": {
        "message": "Photo",
        "description": "Shown in a quotation of a message containing a photo if no text was originally provided with that image"
    },
    "cannotUpdate": {
        "message": "Cannot Update",
        "description": "Shown as the title of our update error dialogs on windows"
    },
    "readOnlyVolume": {
        "message": "Signal Desktop is likely in a macOS quarantine, and will not be able to auto-update. Please try moving Signal.app to /Applications with Finder.",
        "description": "Shown on MacOS if running on a read-only volume and we cannot update"
    },
    "ok": {
        "message": "Valider",
        "description": ""
    },
    "cancel": {
        "message": "Annuler",
        "description": ""
    },
    "failedToSend": {
        "message": "Échec d’envoi à certains destinataires. Veuillez vérifiez votre connexion réseau.",
        "description": ""
    },
    "error": {
        "message": "Erreur",
        "description": ""
    },
    "messageDetail": {
        "message": "Détails du message",
        "description": ""
    },
    "delete": {
        "message": "Supprimer",
        "description": ""
    },
    "deleteWarning": {
        "message": "Êtes-vous certain ? Cliquer sur Supprimer éliminera définitivement ce message de cet appareil seulement.",
        "description": ""
    },
    "deleteThisMessage": {
        "message": "Supprimer ce message",
        "description": ""
    },
    "from": {
        "message": "De",
        "description": "Label for the sender of a message"
    },
    "to": {
        "message": "à",
        "description": "Label for the receiver of a message"
    },
    "sent": {
        "message": "Envoyé",
        "description": "Label for the time a message was sent"
    },
    "received": {
        "message": "Reçu",
        "description": "Label for the time a message was received"
    },
    "sendMessage": {
        "message": "Envoyer un message",
        "description": "Placeholder text in the message entry field"
    },
    "groupMembers": {
        "message": "Membres du groupe",
        "description": ""
    },
    "showMembers": {
        "message": "Afficher les membres",
        "description": ""
    },
    "resetSession": {
        "message": "Réinitialiser la session",
        "description": "This is a menu item for resetting the session, using the imperative case, as in a command."
    },
    "showSafetyNumber": {
        "message": "Afficher le numéro de sécurité",
        "description": ""
    },
    "viewAllMedia": {
        "message": "Afficher tous les médias",
        "description": "This is a menu item for viewing all media (images + video) in a conversation, using the imperative case, as in a command."
    },
    "verifyHelp": {
        "message": "Si vous souhaitez vérifier la sécurité de votre chiffrement de bout en bout avec $name$, comparez les numéros ci-dessus avec les numéros sur son appareil.",
        "description": "",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "theirIdentityUnknown": {
        "message": "Vous n’avez pas encore échangé de messages avec ce contact. Votre numéro de sécurité sera accessible après le premier message.",
        "description": ""
    },
    "moreInfo": {
        "message": "Plus d’infos…",
        "description": "Shown on the drop-down menu for an individual message, takes you to message detail screen"
    },
    "retrySend": {
        "message": "Renvoyer",
        "description": "Shown on the drop-down menu for an indinvidaul message, but only if it is an outgoing message that failed to send"
    },
    "deleteMessage": {
        "message": "Supprimer ce message",
        "description": "Shown on the drop-down menu for an individual message, deletes single message"
    },
    "deleteMessages": {
        "message": "Supprimer les messages",
        "description": "Menu item for deleting messages, title case."
    },
    "deleteConversationConfirmation": {
        "message": "Supprimer définitivement cette conversation ?",
        "description": "Confirmation dialog text that asks the user if they really wish to delete the conversation. Answer buttons use the strings 'ok' and 'cancel'. The deletion is permanent, i.e. it cannot be undone."
    },
    "sessionEnded": {
        "message": "La session sécurisée a été réinitialisée",
        "description": "This is a past tense, informational message. In other words, your secure session has been reset."
    },
    "quoteThumbnailAlt": {
        "message": "Imagette du message cité",
        "description": "Used in alt tag of thumbnail images inside of an embedded message quote"
    },
    "imageAttachmentAlt": {
        "message": "Image jointe au message",
        "description": "Used in alt tag of image attachment"
    },
    "videoAttachmentAlt": {
        "message": "Capture d.écran de la vidéo jointe au message",
        "description": "Used in alt tag of video attachment preview"
    },
    "lightboxImageAlt": {
        "message": "Image envoyée dans la conversation",
        "description": "Used in the alt tag for the image shown in a full-screen lightbox view"
    },
    "imageCaptionIconAlt": {
        "message": "Icône qui indique que cette image a une légende",
        "description": "Used for the icon layered on top of an image in message bubbles"
    },
    "addACaption": {
        "message": "Ajouter un légende…",
        "description": ""
    },
    "save": {
        "message": "Enregistrer",
        "description": ""
    },
    "fileIconAlt": {
        "message": "Icône de fichier",
        "description": "Used in the media gallery documents tab to visually represent a file"
    },
    "emojiAlt": {
        "message": "Image émoji de « $title$ »",
        "description": "Used in the alt tag of all emoji images",
        "placeholders": {
            "title": {
                "content": "$1",
                "example": "grinning"
            }
        }
    },
    "installWelcome": {
        "message": "Bienvenue sur Signal Desktop pour ordinateur",
        "description": "Welcome title on the install page"
    },
    "installTagline": {
        "message": "La confidentialité est possible. Signal la facilite.",
        "description": "Tagline displayed under 'installWelcome' string on the install page"
    },
    "linkYourPhone": {
        "message": "Reliez votre téléphone à Signal Desktop pour ordinateur",
        "description": "Shown on the front page when the application first starst, above the QR code"
    },
    "signalSettings": {
        "message": "Paramètres de Signal",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "linkedDevices": {
        "message": "Appareils reliés",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "plusButton": {
        "message": "Bouton « + »",
        "description": "The button used in Signal Android to add a new linked device"
    },
    "linkNewDevice": {
        "message": "Relier un nouvel appareil",
        "description": "The menu option shown in Signal iOS to add a new linked device"
    },
    "deviceName": {
        "message": "Nom de l’appareil ",
        "description": "The label in settings panel shown for the user-provided name for this desktop instance"
    },
    "chooseDeviceName": {
        "message": "Choisissez le nom de cet appareil",
        "description": "The header shown on the 'choose device name' screen in the device linking process"
    },
    "finishLinkingPhone": {
        "message": "Terminer la liaison de l’appareil",
        "description": "The text on the button to finish the linking process, after choosing the device name"
    },
    "initialSync": {
        "message": "Synchronisation des contacts et groupes",
        "description": "Shown during initial link while contacts and groups are being pulled from mobile device"
    },
    "installConnectionFailed": {
        "message": "Échec de connexion au serveur.",
        "description": "Displayed when we can't connect to the server."
    },
    "installTooManyDevices": {
        "message": "Désolé, trop d’appareils sont déjà reliés. Essayez d’en supprimer.",
        "description": ""
    },
    "settings": {
        "message": "Paramètres",
        "description": "Menu item and header for global settings"
    },
    "theme": {
        "message": "Thème",
        "description": "Header for theme settings"
    },
    "permissions": {
        "message": "Autorisations",
        "description": "Header for permissions section of settings"
    },
    "mediaPermissionsDescription": {
        "message": "Autoriser l’accès à la caméra et au micro",
        "description": "Description of the media permission description"
    },
    "general": {
        "message": "Général",
        "description": "Header for general options on the settings screen"
    },
    "spellCheckDescription": {
        "message": "Activer la vérification de l’orthographe du texte saisi dans la fenêtre de rédaction des messages",
        "description": "Description of the media permission description"
    },
    "clearDataHeader": {
        "message": "Suppression des données",
        "description": "Header in the settings dialog for the section dealing with data deletion"
    },
    "clearDataExplanation": {
        "message": "Toutes les données dans l’application seront supprimées, y compris tous les messages et les renseignements de compte enregistrés.",
        "description": "Text describing what the clear data button will do."
    },
    "clearDataButton": {
        "message": "Supprimer les données",
        "description": "Button in the settings dialog starting process to delete all data"
    },
    "deleteAllDataHeader": {
        "message": "Supprimer toutes les données ?",
        "description": "Header of the full-screen delete data confirmation screen"
    },
    "deleteAllDataBody": {
        "message": "Vous êtes sur le point de supprimer tous les renseignements de compte enregistrés de cette application, y compris tous les contacts et messages. Vous pourrez toujours relier votre appareil mobile de nouveau, mais cela ne restaurera pas les messages supprimés.",
        "description": "Text describing what exactly will happen if the user clicks the button to delete all data"
    },
    "deleteAllDataButton": {
        "message": "Supprimer toutes les données",
        "description": "Text of the button that deletes all data"
    },
    "deleteAllDataProgress": {
        "message": "Déconnexion et suppression de toutes les données",
        "description": "Message shown to user when app is disconnected and data deleted"
    },
    "notifications": {
        "message": "Notifications",
        "description": "Header for notification settings"
    },
    "notificationSettingsDialog": {
        "message": "Lors de la réception de messages, afficher des notifications qui indiquent :",
        "description": "Explain the purpose of the notification settings"
    },
    "disableNotifications": {
        "message": "Désactiver les notifications",
        "description": "Label for disabling notifications"
    },
    "nameAndMessage": {
        "message": "À la fois le nom de l’expéditeur et son message",
        "description": "Label for setting notifications to display name and message text"
    },
    "noNameOrMessage": {
        "message": "Ni le nom ni le message",
        "description": "Label for setting notifications to display no name and no message text"
    },
    "nameOnly": {
        "message": "Seulement le nom de l’expéditeur",
        "description": "Label for setting notifications to display sender name only"
    },
    "newMessage": {
        "message": "Nouveau message",
        "description": "Displayed in notifications for only 1 message"
    },
    "newMessages": {
        "message": "Nouveaux messages",
        "description": "Displayed in notifications for multiple messages"
    },
    "notificationMostRecentFrom": {
        "message": "Les plus récents de :",
        "description": "Displayed in notifications when setting is 'name only' and more than one message is waiting"
    },
    "notificationFrom": {
        "message": "De :",
        "description": "Displayed in notifications when setting is 'name only' and one message is waiting"
    },
    "notificationMostRecent": {
        "message": "Les plus récents :",
        "description": "Displayed in notifications when setting is 'name and message' and more than one message is waiting"
    },
    "sendFailed": {
        "message": "Échec d’envoi",
        "description": "Shown on outgoing message if it fails to send"
    },
    "showMore": {
        "message": "Détails",
        "description": "Displays the details of a key change"
    },
    "showLess": {
        "message": "Cacher les détails",
        "description": "Hides the details of a key change"
    },
    "learnMore": {
        "message": "En savoir plus sur la vérification des numéros de sécurité",
        "description": "Text that links to a support article on verifying safety numbers"
    },
    "expiredWarning": {
        "message": "Cette version de Signal Desktop pour ordinateur est expirée. Veuillez la mettre à niveau vers la version la plus récente afin de continuer à échanger.",
        "description": "Warning notification that this version of the app has expired"
    },
    "upgrade": {
        "message": "Mettre à niveau",
        "description": "Label text for button to upgrade the app to the latest version"
    },
    "mediaMessage": {
        "message": "Message média",
        "description": "Description of a message that has an attachment and no text, displayed in the conversation list as a preview."
    },
    "unregisteredUser": {
        "message": "Le numéro n’est pas inscrit",
        "description": "Error message displayed when sending to an unregistered user."
    },
    "sync": {
        "message": "Contacts",
        "description": "Label for contact and group sync settings"
    },
    "syncExplanation": {
        "message": "Importer tous les groupes et contacts Signal de votre appareil mobile",
        "description": "Explanatory text for sync settings"
    },
    "lastSynced": {
        "message": "Dernière importation le",
        "description": "Label for date and time of last sync operation"
    },
    "syncNow": {
        "message": "Importer maintenant",
        "description": "Label for a button that syncs contacts and groups from your phone"
    },
    "syncing": {
        "message": "Importation…",
        "description": "Label for a disabled sync button while sync is in progress."
    },
    "syncFailed": {
        "message": "Échec d’importation. Assurez-vous que votre ordinateur et votre téléphone sont connectés à Internet.",
        "description": "Informational text displayed if a sync operation times out."
    },
    "timestamp_s": {
        "message": "maintenant",
        "description": "Brief timestamp for messages sent less than a minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_m": {
        "message": "1 minute",
        "description": "Brief timestamp for messages sent about one minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_h": {
        "message": "1 heure",
        "description": "Brief timestamp for messages sent about one hour ago. Displayed in the conversation list and message bubble."
    },
    "hoursAgoShort": {
        "message": "$hours$ h",
        "description": "Even further contracted form of 'X hours ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "hoursAgo": {
        "message": "Il y a $hours$ h",
        "description": "Contracted form of 'X hours ago' which works both for singular and plural",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "minutesAgoShort": {
        "message": "$minutes$ min",
        "description": "Even further contracted form of 'X minutes ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "minutesAgo": {
        "message": "Il y a $minutes$ min",
        "description": "Contracted form of 'X minutes ago' which works both for singular and plural",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "justNow": {
        "message": "maintenant",
        "description": "Shown if a message is very recent, less than 60 seconds old"
    },
    "timestampFormat_M": {
        "message": "D MMM",
        "description": "Timestamp format string for displaying month and day (but not the year) of a date within the current year, ex: use 'MMM D' for 'Aug 8', or 'D MMM' for '8 Aug'."
    },
    "unblockToSend": {
        "message": "Débloquez ce contact pour envoyer un message",
        "description": "Brief message shown when trying to message a blocked number"
    },
    "unblockGroupToSend": {
        "message": "Débloquer ce groupe pour envoyer un message.",
        "description": "Brief message shown when trying to message a blocked group"
    },
    "youChangedTheTimer": {
        "message": "Vous avez défini l’expiration des messages éphémères à $time$",
        "description": "Message displayed when you change the message expiration timer in a conversation.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetOnSync": {
        "message": "L’expiration des messages éphémères est maintenant à $time$",
        "description": "Message displayed when timer is set on initial link of desktop device.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "theyChangedTheTimer": {
        "message": "$name$ a défini l’expiration des messages éphémères à $time$",
        "description": "Message displayed when someone else changes the message expiration timer in a conversation.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            },
            "time": {
                "content": "$2",
                "example": "10m"
            }
        }
    },
    "timerOption_0_seconds": {
        "message": "Désactivés",
        "description": "Label for option to turn off message expiration in the timer menu"
    },
    "timerOption_5_seconds": {
        "message": "5 secondes",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_10_seconds": {
        "message": "10 secondes",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_seconds": {
        "message": "30 secondes",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_minute": {
        "message": "1 minute",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_5_minutes": {
        "message": "5 minutes",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_minutes": {
        "message": "30 minutes",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_hour": {
        "message": "1 heure",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_6_hours": {
        "message": "6 heures",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_12_hours": {
        "message": "12 heures",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_day": {
        "message": "1 jour",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_week": {
        "message": "1 semaine",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "disappearingMessages": {
        "message": "Messages éphémères",
        "description": "Conversation menu option to enable disappearing messages"
    },
    "timerOption_0_seconds_abbreviated": {
        "message": "Désactivés",
        "description": "Short format indicating current timer setting in the conversation list snippet"
    },
    "timerOption_5_seconds_abbreviated": {
        "message": "5 s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_10_seconds_abbreviated": {
        "message": "10 s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_seconds_abbreviated": {
        "message": "30 s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_minute_abbreviated": {
        "message": "1 min",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_5_minutes_abbreviated": {
        "message": "5 min",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_minutes_abbreviated": {
        "message": "30 min",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_hour_abbreviated": {
        "message": "1 h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_6_hours_abbreviated": {
        "message": "6 h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_12_hours_abbreviated": {
        "message": "12 h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_day_abbreviated": {
        "message": "1 j",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_week_abbreviated": {
        "message": "1 sem.",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "disappearingMessagesDisabled": {
        "message": "Les messages éphémères sont désactivés",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disabledDisappearingMessages": {
        "message": "$name$a désactivé les messages éphémères",
        "description": "Displayed in the conversation list when the timer is turned off",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "youDisabledDisappearingMessages": {
        "message": "Vous avez désactivé les messages éphémères",
        "description": "Displayed in the conversation list when the timer is turned off"
    },
    "timerSetTo": {
        "message": "L’expiration des messages a été définie à $time$",
        "description": "Displayed in the conversation list when the timer is updated by some automatic action, or in the left pane",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "1w"
            }
        }
    },
    "audioNotificationDescription": {
        "message": "Jouer une notification sonore",
        "description": "Description for audio notification setting"
    },
    "safetyNumberChanged": {
        "message": "Le numéro de sécurité a changé",
        "description": "A notification shown in the conversation when a contact reinstalls"
    },
    "safetyNumberChangedGroup": {
        "message": "Le numéro de sécurité avec $name$ a changé",
        "description": "A notification shown in a group conversation when a contact reinstalls, showing the contact name",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "verifyNewNumber": {
        "message": "Vérifier le numéro de sécurité",
        "description": "Label on button included with safety number change notification in the conversation"
    },
    "yourSafetyNumberWith": {
        "message": "Votre numéro de sécurité avec $name$ :",
        "description": "Heading for safety number view",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "themeLight": {
        "message": "Clair",
        "description": "Label text for light theme (normal)"
    },
    "themeDark": {
        "message": "Sombre",
        "description": "Label text for dark theme"
    },
    "noteToSelf": {
        "message": "Note à mon intention",
        "description": "Name for the conversation with your own phone number"
    },
    "hideMenuBar": {
        "message": "Cacher la barre de menu",
        "description": "Label text for menu bar visibility setting"
    },
    "startConversation": {
        "message": "Lancer une nouvelle conversation…",
        "description": "Label underneath number a user enters that is not an existing contact"
    },
    "newPhoneNumber": {
        "message": "Saisir un numéro de téléphone pour ajouter un contact.",
        "description": "Placeholder for adding a new number to a contact"
    },
    "invalidNumberError": {
        "message": "Le numéro est invalide",
        "description": "When a person inputs a number that is invalid"
    },
    "unlinkedWarning": {
        "message": "Reliez Signal Desktop pour ordinateur à votre appareil mobile de nouveau pour continuer à communiquer.",
        "description": ""
    },
    "unlinked": {
        "message": "Non relié",
        "description": ""
    },
    "relink": {
        "message": "Relier de nouveau",
        "description": ""
    },
    "autoUpdateNewVersionTitle": {
        "message": "Une mise à jour de Session est proposée",
        "description": ""
    },
    "autoUpdateNewVersionMessage": {
        "message": "Une nouvelle version de Session est proposée.",
        "description": ""
    },
    "autoUpdateNewVersionInstructions": {
        "message": "Appuyez sur « Redémarrer Session » pour appliquer les mises à jour.",
        "description": ""
    },
    "autoUpdateRestartButtonLabel": {
        "message": "Redémarrer Session",
        "description": ""
    },
    "autoUpdateLaterButtonLabel": {
        "message": "Plus tard",
        "description": ""
    },
    "leftTheGroup": {
        "message": "$name$ a quitté le groupe",
        "description": "Shown in the conversation history when a single person leaves the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleLeftTheGroup": {
        "message": "$name$ ont quitté le groupe",
        "description": "Shown in the conversation history when multiple people leave the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "updatedTheGroup": {
        "message": "Le groupe a été mis à jour",
        "description": "Shown in the conversation history when someone updates the group"
    },
    "titleIsNow": {
        "message": "Le titre est maintenant « $name$ »",
        "description": "Shown in the conversation history when someone changes the title of the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Book Club"
            }
        }
    },
    "joinedTheGroup": {
        "message": "$name$ s’est joint au groupe",
        "description": "Shown in the conversation history when a single person joins the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "multipleJoinedTheGroup": {
        "message": "$names$ se sont joints au groupe",
        "description": "Shown in the conversation history when more than one person joins the group",
        "placeholders": {
            "names": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    }
}
