{
    "copyErrorAndQuit": {
        "message": "Copy error and quit",
        "description": "Shown in the top-level error popup, allowing user to copy the error text and close the app"
    },
    "unknownGroup": {
        "message": "Unknown group",
        "description": "Shown as the name of a group if we don't have any information about it"
    },
    "databaseError": {
        "message": "Database Error",
        "description": "Shown in a popup if the database cannot start up properly"
    },
    "deleteAndRestart": {
        "message": "Delete all data and restart",
        "description": "Shown in a popup if the database cannot start up properly; allows user to dalete database and restart"
    },
    "mainMenuFile": {
        "message": "ไ&ฟล์",
        "description": "The label that is used for the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuEdit": {
        "message": "แ&ก้ไข",
        "description": "The label that is used for the Edit menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuView": {
        "message": "&ดู",
        "description": "The label that is used for the View menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuWindow": {
        "message": "ห&น้าต่าง",
        "description": "The label that is used for the Window menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuHelp": {
        "message": "&ความช่วยเหลือ",
        "description": "The label that is used for the Help menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuSettings": {
        "message": "การกำหนด...",
        "description": "The label that is used for the Preferences menu in the program main menu. This should be consistent with the standard naming for ‘Preferences’ on the operating system."
    },
    "appMenuHide": {
        "message": "ซ่อน",
        "description": "Application menu command to hide the window"
    },
    "appMenuHideOthers": {
        "message": "ซ่อนหน้าต่างอื่นๆ",
        "description": "Application menu command to hide all other windows"
    },
    "appMenuUnhide": {
        "message": "แสดงทั้งหมด",
        "description": "Application menu command to show all application windows"
    },
    "appMenuQuit": {
        "message": "ออกจาก Signal",
        "description": "Application menu command to close the application"
    },
    "editMenuUndo": {
        "message": "เลิกทำ",
        "description": "Edit menu command to remove recently-typed text"
    },
    "editMenuRedo": {
        "message": "ทำซ้ำ",
        "description": "Edit menu command to restore previously undone typed text"
    },
    "editMenuCut": {
        "message": "ตัด",
        "description": "Edit menu command to remove selected text and add it to clipboard"
    },
    "editMenuCopy": {
        "message": "คัดลอก",
        "description": "Edit menu command to add selected text to clipboard"
    },
    "editMenuPaste": {
        "message": "วาง",
        "description": "Edit menu command to insert text from clipboard at cursor location"
    },
    "editMenuPasteAndMatchStyle": {
        "message": "วางและให้รูปแบบตรงกัน",
        "description": "Edit menu command to insert text from clipboard at cursor location, taking only text and not style information"
    },
    "editMenuDelete": {
        "message": "ลบ",
        "description": "Edit menu command to remove the selected text"
    },
    "editMenuSelectAll": {
        "message": "เลือกทั้งหมด",
        "description": "Edit menu comand to select all of the text in selected text box"
    },
    "editMenuStartSpeaking": {
        "message": "เริ่มพูด",
        "description": "Edit menu item under 'speech' to start dictation"
    },
    "editMenuStopSpeaking": {
        "message": "หยุดพูด",
        "description": "Edit menu item under 'speech' to stop dictation"
    },
    "windowMenuClose": {
        "message": "ปิดหน้าต่าง",
        "description": "Window menu command to close the current window"
    },
    "windowMenuMinimize": {
        "message": "ย่อลง",
        "description": "Window menu command to minimize the current window"
    },
    "windowMenuZoom": {
        "message": "ซูม",
        "description": "Window menu command to make the current window the size of the whole screen"
    },
    "windowMenuBringAllToFront": {
        "message": "เอาไว้ข้างหน้าทั้งหมด",
        "description": "Window menu command to bring all windows of current applicatinon to front"
    },
    "viewMenuResetZoom": {
        "message": "ขนาดจริง",
        "description": "View menu command to go back to the default zoom"
    },
    "viewMenuZoomIn": {
        "message": "ซูมเข้า",
        "description": "View menu command to make everything bigger"
    },
    "viewMenuZoomOut": {
        "message": "ซูมออก",
        "description": "View menu command to make everything smaller"
    },
    "viewMenuToggleFullScreen": {
        "message": "สลับไปเต็มหน้าจอ",
        "description": "View menu command to enter or leave Full Screen mode"
    },
    "viewMenuToggleDevTools": {
        "message": "สลับไปที่เครื่องมือสำหรับผู้พัฒนา",
        "description": "View menu command to show or hide the developer tools"
    },
    "menuSetupWithImport": {
        "message": "ตั้งค่าด้วยการนำเข้า",
        "description": "When the application is not yet set up, menu option to start up the import sequence"
    },
    "menuSetupAsNewDevice": {
        "message": "ตั้งค่าให้เป็นอุปกรณ์ใหม่",
        "description": "When the application is not yet set up, menu option to start up the set up as fresh device"
    },
    "menuSetupAsStandalone": {
        "message": "ตั้งค่าเป็นอุปกรณ์สแตนด์อโลน",
        "description": "Only available on development modes, menu option to open up the standalone device setup sequence"
    },
    "loading": {
        "message": "กำลังโหลด...",
        "description": "Message shown on the loading screen before we've loaded any messages"
    },
    "optimizingApplication": {
        "message": "กำลังปรับแต่งโปรแกรม...",
        "description": "Message shown on the loading screen while we are doing application optimizations"
    },
    "migratingToSQLCipher": {
        "message": "Optimizing messages... $status$ complete.",
        "description": "Message shown on the loading screen while we are doing application optimizations",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "45/200"
            }
        }
    },
    "archivedConversations": {
        "message": "Archived Conversations",
        "description": "Shown in place of the search box when showing archived conversation list"
    },
    "archiveHelperText": {
        "message": "These conversations are archived and will only appear in the Inbox if new messages are received.",
        "description": "Shown at the top of the archived converations list in the left pane"
    },
    "archiveConversation": {
        "message": "Archive Conversation",
        "description": "Shown in menu for conversation, and moves conversation out of main conversation list"
    },
    "moveConversationToInbox": {
        "message": "Move Conversation to Inbox",
        "description": "Undoes Archive Conversation action, and moves archived conversation back to the main conversation list"
    },
    "chooseDirectory": {
        "message": "เลือกโฟลเดอร์",
        "description": "Button to allow the user to find a folder on disk"
    },
    "chooseFile": {
        "message": "Choose file",
        "description": "Button to allow the user to find a file on disk"
    },
    "loadDataHeader": {
        "message": "โหลดข้อมูลของคุณ",
        "description": "Header shown on the first screen in the data import process"
    },
    "loadDataDescription": {
        "message": "คุณพึ่งจะผ่านพ้นขั้นตอนการส่งออกและข้อมูลผู้ติดต่อและข้อความของคุณยังคงรออยู่ในเครื่องคอมพิวเตอร์ของคุณ เลือกโฟลเดอร์ที่จัดเก็บข้อมูล Signal ที่บันทึกไว้ของคุณ",
        "description": "Introduction to the process of importing messages and contacts from disk"
    },
    "importChooserTitle": {
        "message": "เลือกโฟลเดอร์ที่มีข้อมูลที่ส่งออก",
        "description": "Title of the popup window used to select data previously exported"
    },
    "importErrorHeader": {
        "message": "เกิดข้อผิดพลาดบางอย่าง",
        "description": "Header of the error screen after a failed import"
    },
    "importingHeader": {
        "message": "กำลังโหลดรายชื่อติดต่อและข้อความ",
        "description": "Header of screen shown as data is import"
    },
    "importErrorFirst": {
        "message": "โปรดแน่ใจว่าคุณได้เลือกโฟลเดอร์ที่จัดเก็บข้อมูล Signal ที่บันทึกไว้ของคุณอย่างถูกต้อง โดยชื่อของโฟลเดอร์ควรจะเริ่มต้นด้วยคำว่า 'Signal Export' คุณยังสามารถทำการบันทึกข้อมูลของคุณใหม่ผ่านทางแอปใน Chrome",
        "description": "Message shown if the import went wrong; first paragraph"
    },
    "importErrorSecond": {
        "message": "หากทำตามขั้นตอนเหล่านี้แล้วไม่สำเร็จ โปรดส่งบันทึกดีบัก (ดู -> บันทึกดีบัก) เพื่อให้เราช่วยเหลือคุณในการโอนย้าย",
        "description": "Message shown if the import went wrong; second paragraph"
    },
    "importAgain": {
        "message": "เลือกโฟลเดอร์และลองอีกครั้ง",
        "description": "Button shown if the user runs into an error during import, allowing them to start over"
    },
    "importCompleteHeader": {
        "message": "สำเร็จ",
        "description": "Header shown on the screen at the end of a successful import process"
    },
    "importCompleteStartButton": {
        "message": "เริ่มต้นใช้งาน Signal Desktop",
        "description": "Button shown at end of successful import process, nothing left but a restart"
    },
    "importCompleteLinkButton": {
        "message": "เชื่อมโยงอุปกรณ์นี้กับโทรศัพท์ของคุณ",
        "description": "Button shown at end of successful 'light' import process, so the standard linking process still needs to happen"
    },
    "selectedLocation": {
        "message": "ตำแหน่งที่คุณเลือก",
        "description": "Message shown as the export location if we didn't capture the target directory"
    },
    "upgradingDatabase": {
        "message": "กำลังอัพเกรดฐานข้อมูล อาจต้องใช้เวลาสักพักหนึ่ง...",
        "description": "Message shown on the loading screen when we're changing database structure on first run of a new version"
    },
    "loadingMessages": {
        "message": "ถึงตอนนี้กำลังโหลดข้อความไปแล้ว $count$ ข้อความ...",
        "description": "Message shown on the loading screen when we're catching up on the backlog of messages",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "me": {
        "message": "ฉัน",
        "description": "The label for yourself when shown in a group member list"
    },
    "view": {
        "message": "ดู",
        "description": "Used as a label on a button allowing user to see more information"
    },
    "youLeftTheGroup": {
        "message": "คุณได้ออกจากกลุ่ม",
        "description": "Displayed when a user can't send a message because they have left the group"
    },
    "scrollDown": {
        "message": "เลื่อนไปที่ด้านล่างสุดของการสนทนา",
        "description": "Alt text for button to take user down to bottom of conversation, shown when user scrolls up"
    },
    "messageBelow": {
        "message": "ข้อความใหม่ข้างล่าง",
        "description": "Alt text for button to take user down to bottom of conversation with a new message out of screen"
    },
    "messagesBelow": {
        "message": "ข้อความใหม่ข้างล่าง",
        "description": "Alt text for button to take user down to bottom of conversation with more than one message out of screen"
    },
    "unreadMessage": {
        "message": "1 ข้อความที่ยังไม่ได้อ่าน",
        "description": "Text for unread message separator, just one message"
    },
    "unreadMessages": {
        "message": "$count$ ข้อความที่ยังไม่ได้อ่าน",
        "description": "Text for unread message separator, with count",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "youMarkedAsVerified": {
        "message": "คุณทำเครื่องหมายว่า รหัสความปลอดภัยของคุณกับ $name$ ถูกยืนยันแล้ว",
        "description": "Shown in the conversation history when the user marks a contact as verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerified": {
        "message": "คุณทำเครื่องหมายว่า รหัสความปลอดภัยของคุณกับ $name$ ยังไม่ถูกยืนยัน",
        "description": "Shown in the conversation history when the user marks a contact as not verified, whether on the Safety Number screen or by dismissing a banner or dialog.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsVerifiedOtherDevice": {
        "message": "คุณทำเครื่องหมายจากอีกอุปกรณ์ว่า รหัสความปลอดภัยของคุณกับ $name$ ได้รับการยืนยัน",
        "description": "Shown in the conversation history when we discover that the user marked a contact as verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerifiedOtherDevice": {
        "message": "คุณทำเครื่องหมายจากอีกอุปกรณ์ว่า รหัสความปลอดภัยของคุณกับ $name$ ไม่ได้รับการยืนยัน",
        "description": "Shown in the conversation history when we discover that the user marked a contact as not verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "membersNeedingVerification": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับสมาชิกกลุ่มนี้นับตั้งแต่การยืนยันล่าสุดของคุณ คลิกที่สมาชิกกลุ่มใดๆ เพื่อดูรหัสความปลอดภัยใหม่ของคุณกับเขาเหล่านั้น",
        "description": "When there are multiple previously-verified group members with safety number changes, a banner will be shown. The list of contacts with safety number changes is shown, and this text introduces that list."
    },
    "changedSinceVerifiedMultiple": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับสมาชิกในหลายกลุ่มนับตั้งแต่การยืนยันครั้งล่าสุดของคุณ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่พวกเขาเหล่านั้นได้ติดตั้งแอป Signal ใหม่",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedSinceVerified": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับ $name$ นับตั้งแต่การยืนยันครั้งล่าสุดของคุณ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่ $name$ ได้ติดตั้งแอป Signal ใหม่",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRightAfterVerify": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยที่คุณกำลังจะทำการยืนยัน โปรดตรวจสอบรหัสความปลอดภัยของคุณกับ $name$ โปรดจำไว้ว่า การเปลี่ยนแปลงนี้อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่ $name$ ได้ติดตั้งแอป Signal ใหม่",
        "description": "Shown on the safety number screen when the user has selected to verify/unverify a contact's safety number, and we immediately discover a safety number change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "changedRecentlyMultiple": {
        "message": "มีการเปลี่ยนแปลงรหัสความปลอดภัยของคุณกับสมาชิกในหลายกลุ่มเมื่อเร็วๆ นี้ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่พวกเขาเหล่านั้นได้ติดตั้งแอป Signal ใหม่",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "changedRecently": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับ $name$ เมื่อเร็วๆ นี้ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่ $name$ ได้ติดตั้งแอป Signal ใหม่",
        "description": "Shown on confirmation dialog when user attempts to send a message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "identityKeyErrorOnSend": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับ $name$ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่ $name$ ได้ติดตั้งแอป Signal ใหม่ คุณอาจจะต้องยืนยันรหัสความปลอดภัยกับผู้ติดต่อนี้",
        "description": "Shown when user clicks on a failed recipient in the message detail view after an identity key change",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "sendAnyway": {
        "message": "ยืนยันที่จะส่ง",
        "description": "Used on a warning dialog to make it clear that it might be risky to send the message."
    },
    "noLongerVerified": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับ $name$ และถือว่ายังไม่ได้รับการยืนยัน คลิกเพื่อแสดง",
        "description": "Shown in converation banner when user's safety number has changed, but they were previously verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleNoLongerVerified": {
        "message": "มีการเปลี่ยนแปลงรหัสความปลอดภัยของคุณกับสมาชิกในหลายกลุ่มและถือว่ายังไม่ได้รับการยืนยัน คลิกเพื่อแสดง",
        "description": "Shown in conversation banner when more than one group member's safety number has changed, but they were previously verified."
    },
    "debugLogExplanation": {
        "message": "บันทึกนี้จะถูกโพสต์แบบสาธารณะทางออนไลน์เพื่อให้ผู้สนับสนุนสามารถดูได้ คุณอาจจะตรวจสอบและแก้ไขก่อนที่จะส่งออกไป",
        "description": ""
    },
    "debugLogError": {
        "message": "Something went wrong with the upload! Please consider manually adding your log to the bug you file.",
        "description": ""
    },
    "reportIssue": {
        "message": "รายงานปัญหา",
        "description": "Link to open the issue tracker"
    },
    "gotIt": {
        "message": "เข้าใจแล้ว",
        "description": "Label for a button that dismisses a dialog. The user clicks it to confirm that they understand the message in the dialog."
    },
    "submit": {
        "message": "ส่ง",
        "description": ""
    },
    "acceptNewKey": {
        "message": "ยอมรับ",
        "description": "Label for a button to accept a new safety number"
    },
    "verify": {
        "message": "ทำเครื่องหมายว่ายืนยันแล้ว",
        "description": ""
    },
    "unverify": {
        "message": "ทำเครื่องหมายว่าไม่ได้รับการยืนยัน",
        "description": ""
    },
    "isVerified": {
        "message": "คุณยังได้ยืนยันรหัสความปลอดภัยของคุณกับ $name$ แล้ว",
        "description": "Summary state shown at top of the safety number screen if user has verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "isNotVerified": {
        "message": "คุณยังไม่ได้ยืนยันรหัสความปลอดภัยของคุณกับ $name$",
        "description": "Summary state shown at top of the safety number screen if user has not verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "verified": {
        "message": "ยืนยันแล้ว",
        "description": ""
    },
    "newIdentity": {
        "message": "รหัสความปลอดภัยใหม่",
        "description": "Header for a key change dialog"
    },
    "identityChanged": {
        "message": "มีการเปลี่ยนแปลงในรหัสความปลอดภัยของคุณกับผู้ติดต่อนี้ นี่อาจหมายความว่ามีใครพยายามดักการสื่อสารของคุณ หรือไม่ก็แค่ผู้ติดต่อนี้ได้ติดตั้งแอป Signal ใหม่ คุณอาจจะต้องยืนยันรหัสความปลอดภัยใหม่ด้านล่างนี้",
        "description": ""
    },
    "incomingError": {
        "message": "เกิดข้อผิดพลาดในการจัดการข้อความขาเข้า",
        "description": ""
    },
    "media": {
        "message": "สื่อ",
        "description": "Header of the default pane in the media gallery, showing images and videos"
    },
    "mediaEmptyState": {
        "message": "คุณไม่มีสื่อข้อมูลใดๆ ในการสนทนานี้",
        "description": "Message shown to user in the media gallery when there are no messages with media attachments (images or video)"
    },
    "documents": {
        "message": "เอกสาร",
        "description": "Header of the secondary pane in the media gallery, showing every non-media attachment"
    },
    "documentsEmptyState": {
        "message": "คุณไม่มีเอกสารใดๆ ในการสนทนานี้",
        "description": "Message shown to user in the media gallery when there are no messages with document attachments (anything other than images or video)"
    },
    "today": {
        "message": "วันนี้",
        "description": "Section header in the media gallery"
    },
    "yesterday": {
        "message": "เมื่อวานนี้",
        "description": "Section header in the media gallery"
    },
    "thisWeek": {
        "message": "สัปดาห์นี้",
        "description": "Section header in the media gallery"
    },
    "thisMonth": {
        "message": "เดือนนี้",
        "description": "Section header in the media gallery"
    },
    "unsupportedAttachment": {
        "message": "ประเภทไฟล์แนบที่ไม่รองรับ คลิกเพื่อบันทึก",
        "description": "Displayed for incoming unsupported attachment"
    },
    "clickToSave": {
        "message": "คลิกเพื่อบันทึก",
        "description": "Hover text for attachment filenames"
    },
    "unnamedFile": {
        "message": "ไฟล์ที่ไม่มีชื่อ",
        "description": "Hover text for attachment filenames"
    },
    "voiceMessage": {
        "message": "ข้อความเสียง",
        "description": "Name for a voice message attachment"
    },
    "dangerousFileType": {
        "message": "Attachment type not allowed for security reasons",
        "description": "Shown in toast when user attempts to send .exe file, for example"
    },
    "loadingPreview": {
        "message": "Loading Preview...",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area"
    },
    "stagedPreviewThumbnail": {
        "message": "Draft thumbnail link preview for $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "previewThumbnail": {
        "message": "Thumbnail link preview for $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "stagedImageAttachment": {
        "message": "Draft image attachment: $path$",
        "description": "Alt text for staged attachments",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "dog.jpg"
            }
        }
    },
    "oneNonImageAtATimeToast": {
        "message": "When including a non-image attachment, the limit is one attachment per message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "cannotMixImageAndNonImageAttachments": {
        "message": "You cannot mix non-image and image attachments in one message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "maximumAttachments": {
        "message": "You cannot add any more attachments to this message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "fileSizeWarning": {
        "message": "ขออภัย ไฟล์ที่เลือกมีขนาดเกินจากที่จำกัด",
        "description": ""
    },
    "unableToLoadAttachment": {
        "message": "Unable to load selected attachment.",
        "description": ""
    },
    "disconnected": {
        "message": "เลิกการเชื่อมต่อแล้ว",
        "description": "Displayed when the desktop client cannot connect to the server."
    },
    "connecting": {
        "message": "กำลังเชื่อมต่อ",
        "description": "Displayed when the desktop client is currently connecting to the server."
    },
    "offline": {
        "message": "ออฟไลน์",
        "description": "Displayed when the desktop client has no network connection."
    },
    "checkNetworkConnection": {
        "message": "ตรวจสอบการเชื่อมต่อเครือข่ายของคุณ",
        "description": "Obvious instructions for when a user's computer loses its network connection"
    },
    "attemptingReconnection": {
        "message": "กำลังพยายามเชื่อมต่อใหม่อีกครั้งในอีก $reconnect_duration_in_seconds$ วินาที",
        "description": "",
        "placeholders": {
            "reconnect_duration_in_seconds": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "submitDebugLog": {
        "message": "บันทึกดีบัก",
        "description": "Menu item and header text for debug log modal (sentence case)"
    },
    "debugLog": {
        "message": "บันทึกดีบัก",
        "description": "View menu item to open the debug log (title case)"
    },
    "goToReleaseNotes": {
        "message": "ไปที่บันทึกประจำรุ่น",
        "description": ""
    },
    "goToForums": {
        "message": "ไปที่ฟอรัม",
        "description": "Item under the Help menu, takes you to the forums"
    },
    "goToSupportPage": {
        "message": "ไปที่หน้าการสนับสนุน",
        "description": "Item under the Help menu, takes you to the support page"
    },
    "menuReportIssue": {
        "message": "รายงานปัญหา",
        "description": "Item under the Help menu, takes you to GitHub new issue form (title case)"
    },
    "signalDesktopPreferences": {
        "message": "การกำหนดลักษณะ Signal Desktop",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "aboutSignalDesktop": {
        "message": "เกี่ยวกับ Signal Desktop",
        "description": "Item under the Help menu, which opens a small about window"
    },
    "speech": {
        "message": "การพูด",
        "description": "Item under the Edit menu, with 'start/stop speaking' items below it"
    },
    "show": {
        "message": "แสดง",
        "description": "Command under Window menu, to show the window"
    },
    "hide": {
        "message": "ซ่อน",
        "description": "Command in the tray icon menu, to hide the window"
    },
    "quit": {
        "message": "ออก",
        "description": "Command in the tray icon menu, to quit the application"
    },
    "signalDesktop": {
        "message": "Signal Desktop",
        "description": "Tooltip for the tray icon"
    },
    "search": {
        "message": "ค้นหา",
        "description": "Placeholder text in the search input"
    },
    "noSearchResults": {
        "message": "No results for \"$searchTerm$\"",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            }
        }
    },
    "conversationsHeader": {
        "message": "การสนทนา",
        "description": "Shown to separate the types of search results"
    },
    "contactsHeader": {
        "message": "ผู้ติดต่อ",
        "description": "Shown to separate the types of search results"
    },
    "messagesHeader": {
        "message": "ข้อความ",
        "description": "Shown to separate the types of search results"
    },
    "welcomeToSession": {
        "message": "ยินดีต้อนรับสู่ Signal",
        "description": ""
    },
    "selectAContact": {
        "message": "เลือกผู้ติดต่อหรือกลุ่มเพื่อเริ่มต้นการแชต",
        "description": ""
    },
    "typingAlt": {
        "message": "Typing animation for this conversation",
        "description": "Used as the 'title' attibute for the typing animation"
    },
    "contactAvatarAlt": {
        "message": "ภาพบุคคลที่ติดต่อ",
        "description": "Used in the alt tag for the image avatar of a contact",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "sendMessageToContact": {
        "message": "ส่งข้อความ",
        "description": "Shown when you are sent a contact and that contact has a signal account"
    },
    "home": {
        "message": "บ้าน",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "work": {
        "message": "ที่ทำงาน",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "mobile": {
        "message": "มือถือ",
        "description": "Shown on contact detail screen as a label for aa phone or email"
    },
    "email": {
        "message": "อีเมล",
        "description": "Generic label shown if contact email has custom type but no label"
    },
    "phone": {
        "message": "โทรศัพท์",
        "description": "Generic label shown if contact phone has custom type but no label"
    },
    "address": {
        "message": "ที่อยู่",
        "description": "Generic label shown if contact address has custom type but no label"
    },
    "poBox": {
        "message": "ตู้ไปรษณีย์",
        "description": "When rendering an address, used to provide context to a post office box"
    },
    "downloading": {
        "message": "Downloading",
        "description": "Shown in the message bubble while a long message attachment is being downloaded"
    },
    "downloadAttachment": {
        "message": "Download Attachment",
        "description": "Shown in a message's triple-dot menu if there isn't room for a dedicated download button"
    },
    "replyToMessage": {
        "message": "ตอบกลับข้อความ",
        "description": "Shown in triple-dot menu next to message to allow user to start crafting a message with a quotation"
    },
    "originalMessageNotFound": {
        "message": "Original message not found",
        "description": "Shown in quote if reference message was not found as message was initially downloaded and processed"
    },
    "originalMessageNotAvailable": {
        "message": "Original message no longer available",
        "description": "Shown in toast if user clicks on quote that references message no longer in database"
    },
    "messageFoundButNotLoaded": {
        "message": "Original message found, but not loaded. Scroll up to load it.",
        "description": "Shown in toast if user clicks on quote references messages not loaded in view, but in database"
    },
    "voiceNoteMustBeOnlyAttachment": {
        "message": "A voice note must be the only attachment included in a message.",
        "description": "Shown in toast if tries to record a voice note with any staged attachments"
    },
    "you": {
        "message": "คุณ",
        "description": "In Android theme, shown in quote if you or someone else replies to you"
    },
    "replyingTo": {
        "message": "ตอบกลับหา $name$",
        "description": "Shown in iOS theme when you or someone quotes to a message which is not from you",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "audioPermissionNeeded": {
        "message": "เพื่อจะส่งข้อความเสียง ต้องอนุญาตให้ Signal Desktop ใช้งานไมโครโฟนของคุณ",
        "description": "Shown if the user attempts to send an audio message without audio permssions turned on"
    },
    "allowAccess": {
        "message": "อนุญาตให้เข้าถึง",
        "description": "Button shown in popup asking to enable microphon/video permissions to send audio messages"
    },
    "showSettings": {
        "message": "แสดงการตั้งค่า",
        "description": "A button shown in dialog requesting the user to turn on audio permissions"
    },
    "audio": {
        "message": "เสียง",
        "description": "Shown in a quotation of a message containing an audio attachment if no text was originally provided with that attachment"
    },
    "video": {
        "message": "วิดีโอ",
        "description": "Shown in a quotation of a message containing a video if no text was originally provided with that video"
    },
    "photo": {
        "message": "รูปภาพ",
        "description": "Shown in a quotation of a message containing a photo if no text was originally provided with that image"
    },
    "cannotUpdate": {
        "message": "Cannot Update",
        "description": "Shown as the title of our update error dialogs on windows"
    },
    "readOnlyVolume": {
        "message": "Signal Desktop is likely in a macOS quarantine, and will not be able to auto-update. Please try moving Signal.app to /Applications with Finder.",
        "description": "Shown on MacOS if running on a read-only volume and we cannot update"
    },
    "ok": {
        "message": "ตกลง",
        "description": ""
    },
    "cancel": {
        "message": "ยกเลิก",
        "description": ""
    },
    "failedToSend": {
        "message": "ส่งไปยังผู้รับบางคนไม่สำเร็จ ตรวจสอบการเชื่อมต่อเครือข่ายของคุณ",
        "description": ""
    },
    "error": {
        "message": "ข้อผิดพลาด",
        "description": ""
    },
    "messageDetail": {
        "message": "รายละเอียดข้อความ",
        "description": ""
    },
    "delete": {
        "message": "ลบ",
        "description": ""
    },
    "deleteWarning": {
        "message": "คุณแน่ใจหรือ การคลิกที่ 'ลบ' จะเป็นการลบข้อความนี้ออกไปจากอุปกรณ์นี้อย่างถาวร",
        "description": ""
    },
    "deleteThisMessage": {
        "message": "ลบข้อความนี้",
        "description": ""
    },
    "from": {
        "message": "จาก",
        "description": "Label for the sender of a message"
    },
    "to": {
        "message": "to",
        "description": "Label for the receiver of a message"
    },
    "sent": {
        "message": "ส่งแล้ว",
        "description": "Label for the time a message was sent"
    },
    "received": {
        "message": "ได้รับแล้ว",
        "description": "Label for the time a message was received"
    },
    "sendMessage": {
        "message": "ส่งข้อความ",
        "description": "Placeholder text in the message entry field"
    },
    "groupMembers": {
        "message": "สมาชิกกลุ่ม",
        "description": ""
    },
    "showMembers": {
        "message": "แสดงสมาชิก",
        "description": ""
    },
    "resetSession": {
        "message": "ตั้งค่าเซสชันใหม่",
        "description": "This is a menu item for resetting the session, using the imperative case, as in a command."
    },
    "showSafetyNumber": {
        "message": "แสดงรหัสความปลอดภัย",
        "description": ""
    },
    "viewAllMedia": {
        "message": "ดูสื่อทั้งหมด",
        "description": "This is a menu item for viewing all media (images + video) in a conversation, using the imperative case, as in a command."
    },
    "verifyHelp": {
        "message": "หากคุณต้องการยืนยันความปลอดภัยในการเข้ารหัสจากต้นทางถึงปลายทางระหว่างคุณกับ $name$ ให้เปรียบเทียบตัวเลขด้านบนกับตัวเลขบนอุปกรณ์ของเขา",
        "description": "",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "theirIdentityUnknown": {
        "message": "คุณยังไม่ได้แลกเปลี่ยนข้อความใดๆ กับผู้ติดต่อนี้ รหัสความปลอดภัยของคุณกับพวกเขาจะมีให้หลังเริ่มส่งข้อความแรก",
        "description": ""
    },
    "moreInfo": {
        "message": "More Info...",
        "description": "Shown on the drop-down menu for an individual message, takes you to message detail screen"
    },
    "retrySend": {
        "message": "Retry Send",
        "description": "Shown on the drop-down menu for an indinvidaul message, but only if it is an outgoing message that failed to send"
    },
    "deleteMessage": {
        "message": "ลบข้อความนี้",
        "description": "Shown on the drop-down menu for an individual message, deletes single message"
    },
    "deleteMessages": {
        "message": "ลบข้อความ",
        "description": "Menu item for deleting messages, title case."
    },
    "deleteConversationConfirmation": {
        "message": "ลบการสนทนานี้โดยถาวรหรือไม่",
        "description": "Confirmation dialog text that asks the user if they really wish to delete the conversation. Answer buttons use the strings 'ok' and 'cancel'. The deletion is permanent, i.e. it cannot be undone."
    },
    "sessionEnded": {
        "message": "เซสชันที่ปลอดภัยถูกรีเซ็ตแล้ว",
        "description": "This is a past tense, informational message. In other words, your secure session has been reset."
    },
    "quoteThumbnailAlt": {
        "message": "รูปย่อจากข้อความที่อ้างถึง",
        "description": "Used in alt tag of thumbnail images inside of an embedded message quote"
    },
    "imageAttachmentAlt": {
        "message": "Image attached to message",
        "description": "Used in alt tag of image attachment"
    },
    "videoAttachmentAlt": {
        "message": "Screenshot of video attached to message",
        "description": "Used in alt tag of video attachment preview"
    },
    "lightboxImageAlt": {
        "message": "ภาพถูกส่งไปในการสนทนา",
        "description": "Used in the alt tag for the image shown in a full-screen lightbox view"
    },
    "imageCaptionIconAlt": {
        "message": "Icon showing that this image has a caption",
        "description": "Used for the icon layered on top of an image in message bubbles"
    },
    "addACaption": {
        "message": "Add a caption...",
        "description": ""
    },
    "save": {
        "message": "บันทึก",
        "description": ""
    },
    "fileIconAlt": {
        "message": "ไอคอนไฟล์",
        "description": "Used in the media gallery documents tab to visually represent a file"
    },
    "emojiAlt": {
        "message": "รูปอีโมจิของ '$title$'",
        "description": "Used in the alt tag of all emoji images",
        "placeholders": {
            "title": {
                "content": "$1",
                "example": "grinning"
            }
        }
    },
    "installWelcome": {
        "message": "ยินดีต้อนรับสู่ Signal Desktop",
        "description": "Welcome title on the install page"
    },
    "installTagline": {
        "message": "ความเป็นส่วนตัวเป็นไปได้อย่างง่ายดายด้วย Signal",
        "description": "Tagline displayed under 'installWelcome' string on the install page"
    },
    "linkYourPhone": {
        "message": "เชื่อมโยงโทรศัพท์ของคุณกับ Signal Desktop",
        "description": "Shown on the front page when the application first starst, above the QR code"
    },
    "signalSettings": {
        "message": "การตั้งค่า Signal",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "linkedDevices": {
        "message": "อุปกรณ์ที่เชื่อมโยง",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "plusButton": {
        "message": "ปุ่ม '+'",
        "description": "The button used in Signal Android to add a new linked device"
    },
    "linkNewDevice": {
        "message": "เชื่อมโยงอุปกรณ์ใหม่",
        "description": "The menu option shown in Signal iOS to add a new linked device"
    },
    "deviceName": {
        "message": "ชื่ออุปกรณ์",
        "description": "The label in settings panel shown for the user-provided name for this desktop instance"
    },
    "chooseDeviceName": {
        "message": "เลือกชื่อของอุปกรณ์นี้",
        "description": "The header shown on the 'choose device name' screen in the device linking process"
    },
    "finishLinkingPhone": {
        "message": "เชื่อมโยงโทรศัพท์เสร็จสิ้น",
        "description": "The text on the button to finish the linking process, after choosing the device name"
    },
    "initialSync": {
        "message": "กำลังซิงค์รายชื่อผู้ติดต่อและกลุ่ม",
        "description": "Shown during initial link while contacts and groups are being pulled from mobile device"
    },
    "installConnectionFailed": {
        "message": "เชื่อมต่อกับเซิร์ฟเวอร์ล้มเหลว",
        "description": "Displayed when we can't connect to the server."
    },
    "installTooManyDevices": {
        "message": "ขออภัย คุณมีอุปกรณ์ที่เชื่อมโยงมากเกินไป ลองถอนการเชื่อมโยงจากบางอุปกรณ์บ้าง",
        "description": ""
    },
    "settings": {
        "message": "การตั้งค่า",
        "description": "Menu item and header for global settings"
    },
    "theme": {
        "message": "ธีม",
        "description": "Header for theme settings"
    },
    "permissions": {
        "message": "สิทธิ์",
        "description": "Header for permissions section of settings"
    },
    "mediaPermissionsDescription": {
        "message": "อนุญาตให้เข้าถึงกล้องและไมโครโฟน",
        "description": "Description of the media permission description"
    },
    "general": {
        "message": "General",
        "description": "Header for general options on the settings screen"
    },
    "spellCheckDescription": {
        "message": "Enable spell check of text entered in message composition box",
        "description": "Description of the media permission description"
    },
    "clearDataHeader": {
        "message": "ล้างข้อมูล",
        "description": "Header in the settings dialog for the section dealing with data deletion"
    },
    "clearDataExplanation": {
        "message": "นี่จะเป็นการล้างข้อมูลทั้งหมดในโปรแกรม ลบข้อความทั้งหมดรวมทั้งข้อมูลทางบัญชีที่บันทึกไว้",
        "description": "Text describing what the clear data button will do."
    },
    "clearDataButton": {
        "message": "ล้างข้อมูล",
        "description": "Button in the settings dialog starting process to delete all data"
    },
    "deleteAllDataHeader": {
        "message": "ลบข้อมูลทั้งหมดหรือ",
        "description": "Header of the full-screen delete data confirmation screen"
    },
    "deleteAllDataBody": {
        "message": "คุณกำลังจะลบข้อมูลบัญชีที่บันทึกไว้ของโปรแกรมนี้ทั้งหมด ซึ่งรวมถึงผู้ติดต่อและข้อความทั้งหมด คุณสามารถเชื่อมต่อกับอุปกรณ์เคลื่อนที่ของคุณใหม่ได้เสมอแต่จะไม่สามารถเรียกคืนข้อความที่ถูกลบไปแล้ว",
        "description": "Text describing what exactly will happen if the user clicks the button to delete all data"
    },
    "deleteAllDataButton": {
        "message": "ลบข้อมูลทั้งหมด",
        "description": "Text of the button that deletes all data"
    },
    "deleteAllDataProgress": {
        "message": "กำลังยกเลิกการเชื่อมต่อและลบข้อมูลทั้งหมด",
        "description": "Message shown to user when app is disconnected and data deleted"
    },
    "notifications": {
        "message": "การแจ้งเตือน",
        "description": "Header for notification settings"
    },
    "notificationSettingsDialog": {
        "message": "เมื่อมีข้อความเข้ามา ให้การแจ้งเตือนแสดง:",
        "description": "Explain the purpose of the notification settings"
    },
    "disableNotifications": {
        "message": "ปิดใช้งานการแจ้งเตือน",
        "description": "Label for disabling notifications"
    },
    "nameAndMessage": {
        "message": "ทั้งชื่อผู้ส่งและข้อความ",
        "description": "Label for setting notifications to display name and message text"
    },
    "noNameOrMessage": {
        "message": "ไม่ทั้งชื่อหรือข้อความ",
        "description": "Label for setting notifications to display no name and no message text"
    },
    "nameOnly": {
        "message": "เฉพาะชื่อผู้ส่ง",
        "description": "Label for setting notifications to display sender name only"
    },
    "newMessage": {
        "message": "ข้อความใหม่",
        "description": "Displayed in notifications for only 1 message"
    },
    "newMessages": {
        "message": "ข้อความใหม่",
        "description": "Displayed in notifications for multiple messages"
    },
    "notificationMostRecentFrom": {
        "message": "ล่าสุดจาก:",
        "description": "Displayed in notifications when setting is 'name only' and more than one message is waiting"
    },
    "notificationFrom": {
        "message": "จาก:",
        "description": "Displayed in notifications when setting is 'name only' and one message is waiting"
    },
    "notificationMostRecent": {
        "message": "ล่าสุดจาก:",
        "description": "Displayed in notifications when setting is 'name and message' and more than one message is waiting"
    },
    "sendFailed": {
        "message": "Send failed",
        "description": "Shown on outgoing message if it fails to send"
    },
    "showMore": {
        "message": "รายละเอียด",
        "description": "Displays the details of a key change"
    },
    "showLess": {
        "message": "ซ่อนรายละเอียด",
        "description": "Hides the details of a key change"
    },
    "learnMore": {
        "message": "เรียนรู้เพิ่มเติมเกี่ยวกับการยืนยันรหัสความปลอดภัย",
        "description": "Text that links to a support article on verifying safety numbers"
    },
    "expiredWarning": {
        "message": "Signal Desktop เวอร์ชันนี้หมดอายุแล้ว โปรดอัพเกรดไปเป็นเวอร์ชันล่าสุดเพื่อดำเนินการส่งข้อความต่อ",
        "description": "Warning notification that this version of the app has expired"
    },
    "upgrade": {
        "message": "อัพเกรด",
        "description": "Label text for button to upgrade the app to the latest version"
    },
    "mediaMessage": {
        "message": "ข้อความสื่อ",
        "description": "Description of a message that has an attachment and no text, displayed in the conversation list as a preview."
    },
    "unregisteredUser": {
        "message": "ยังไม่ได้ลงทะเบียนรหัส",
        "description": "Error message displayed when sending to an unregistered user."
    },
    "sync": {
        "message": "ผู้ติดต่อ",
        "description": "Label for contact and group sync settings"
    },
    "syncExplanation": {
        "message": "นำเข้ากลุ่มและผู้ติดต่อใน Signal ทั้งหมดจากอุปกรณ์เคลื่อนที่ของคุณ",
        "description": "Explanatory text for sync settings"
    },
    "lastSynced": {
        "message": "นำเข้าครั้งล่าสุดเมื่อ",
        "description": "Label for date and time of last sync operation"
    },
    "syncNow": {
        "message": "นำเข้าเดี๋ยวนี้",
        "description": "Label for a button that syncs contacts and groups from your phone"
    },
    "syncing": {
        "message": "กำลังนำเข้า...",
        "description": "Label for a disabled sync button while sync is in progress."
    },
    "syncFailed": {
        "message": "การนำเข้าล้มเหลว แน่ใจว่าคอมพิวเตอร์และโทรศัพท์ของคุณเชื่อมต่อกับอินเตอร์เน็ตแล้ว",
        "description": "Informational text displayed if a sync operation times out."
    },
    "timestamp_s": {
        "message": "เดี๋ยวนี้",
        "description": "Brief timestamp for messages sent less than a minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_m": {
        "message": "1 นาที",
        "description": "Brief timestamp for messages sent about one minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_h": {
        "message": "1 ชั่วโมง",
        "description": "Brief timestamp for messages sent about one hour ago. Displayed in the conversation list and message bubble."
    },
    "hoursAgoShort": {
        "message": "$hours$ hr",
        "description": "Even further contracted form of 'X hours ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "hoursAgo": {
        "message": "$hours$ hr ago",
        "description": "Contracted form of 'X hours ago' which works both for singular and plural",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "minutesAgoShort": {
        "message": "$minutes$ min",
        "description": "Even further contracted form of 'X minutes ago' which works both for singular and plural, used in the left pane",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "minutesAgo": {
        "message": "$minutes$ min ago",
        "description": "Contracted form of 'X minutes ago' which works both for singular and plural",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "justNow": {
        "message": "เดี๋ยวนี้",
        "description": "Shown if a message is very recent, less than 60 seconds old"
    },
    "timestampFormat_M": {
        "message": "ดดด ว",
        "description": "Timestamp format string for displaying month and day (but not the year) of a date within the current year, ex: use 'MMM D' for 'Aug 8', or 'D MMM' for '8 Aug'."
    },
    "unblockToSend": {
        "message": "เลิกปิดกั้นผู้ติดต่อนี้เพื่อส่งข้อความ",
        "description": "Brief message shown when trying to message a blocked number"
    },
    "unblockGroupToSend": {
        "message": "Unblock this group to send a message.",
        "description": "Brief message shown when trying to message a blocked group"
    },
    "youChangedTheTimer": {
        "message": "คุณตั้งค่าตัวตั้งเวลาไว้ที่ $time$",
        "description": "Message displayed when you change the message expiration timer in a conversation.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetOnSync": {
        "message": "ตั้งค่าตัวตั้งเวลาไว้ที่ $time$",
        "description": "Message displayed when timer is set on initial link of desktop device.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "theyChangedTheTimer": {
        "message": "$name$ ตั้งค่าตัวตั้งเวลาไว้ที่ $time$",
        "description": "Message displayed when someone else changes the message expiration timer in a conversation.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            },
            "time": {
                "content": "$2",
                "example": "10m"
            }
        }
    },
    "timerOption_0_seconds": {
        "message": "ปิด",
        "description": "Label for option to turn off message expiration in the timer menu"
    },
    "timerOption_5_seconds": {
        "message": "5 วินาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_10_seconds": {
        "message": "10 วินาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_seconds": {
        "message": "30 วินาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_minute": {
        "message": "1 นาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_5_minutes": {
        "message": "5 นาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_30_minutes": {
        "message": "30 นาที",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_hour": {
        "message": "1 ชั่วโมง",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_6_hours": {
        "message": "6 ชั่วโมง",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_12_hours": {
        "message": "12 ชั่วโมง",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_day": {
        "message": "1 วัน",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "timerOption_1_week": {
        "message": "1 อาทิตย์",
        "description": "Label for a selectable option in the message expiration timer menu"
    },
    "disappearingMessages": {
        "message": "ข้อความที่ลบตัวเอง",
        "description": "Conversation menu option to enable disappearing messages"
    },
    "timerOption_0_seconds_abbreviated": {
        "message": "ปิด",
        "description": "Short format indicating current timer setting in the conversation list snippet"
    },
    "timerOption_5_seconds_abbreviated": {
        "message": "5s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_10_seconds_abbreviated": {
        "message": "10s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_seconds_abbreviated": {
        "message": "30s",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_minute_abbreviated": {
        "message": "1m",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_5_minutes_abbreviated": {
        "message": "5m",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_30_minutes_abbreviated": {
        "message": "30m",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_hour_abbreviated": {
        "message": "1h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_6_hours_abbreviated": {
        "message": "6h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_12_hours_abbreviated": {
        "message": "12h",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_day_abbreviated": {
        "message": "1d",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "timerOption_1_week_abbreviated": {
        "message": "1w",
        "description": "Very short format indicating current timer setting in the conversation header"
    },
    "disappearingMessagesDisabled": {
        "message": "Disappearing messages disabled",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disabledDisappearingMessages": {
        "message": "$name$ disabled disappearing messages",
        "description": "Displayed in the conversation list when the timer is turned off",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "youDisabledDisappearingMessages": {
        "message": "You disabled disappearing messages",
        "description": "Displayed in the conversation list when the timer is turned off"
    },
    "timerSetTo": {
        "message": "ตั้งค่าตัวตั้งเวลาไว้ที่ $time$",
        "description": "Displayed in the conversation list when the timer is updated by some automatic action, or in the left pane",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "1w"
            }
        }
    },
    "audioNotificationDescription": {
        "message": "เล่นการแจ้งเตือนด้วยเสียง",
        "description": "Description for audio notification setting"
    },
    "safetyNumberChanged": {
        "message": "Safety Number has changed",
        "description": "A notification shown in the conversation when a contact reinstalls"
    },
    "safetyNumberChangedGroup": {
        "message": "Safety Number with $name$ has changed",
        "description": "A notification shown in a group conversation when a contact reinstalls, showing the contact name",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "verifyNewNumber": {
        "message": "Verify Safety Number",
        "description": "Label on button included with safety number change notification in the conversation"
    },
    "yourSafetyNumberWith": {
        "message": "รหัสความปลอดภัยของคุณกับ $name$:",
        "description": "Heading for safety number view",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "themeLight": {
        "message": "Light",
        "description": "Label text for light theme (normal)"
    },
    "themeDark": {
        "message": "Dark",
        "description": "Label text for dark theme"
    },
    "noteToSelf": {
        "message": "Note to Self",
        "description": "Name for the conversation with your own phone number"
    },
    "hideMenuBar": {
        "message": "ซ่อนแถบเมนู",
        "description": "Label text for menu bar visibility setting"
    },
    "startConversation": {
        "message": "Start new conversation…",
        "description": "Label underneath number a user enters that is not an existing contact"
    },
    "newPhoneNumber": {
        "message": "ป้อนหมายเลขโทรศัพท์เพื่อเพิ่มผู้ติดต่อ",
        "description": "Placeholder for adding a new number to a contact"
    },
    "invalidNumberError": {
        "message": "หมายเลขไม่ถูกต้อง",
        "description": "When a person inputs a number that is invalid"
    },
    "unlinkedWarning": {
        "message": "เชื่อมโยง Signal Desktop กับอุปกรณ์เคลื่อนที่ของคุณอีกครั้งเพื่อใช้งานการส่งข้อความอย่างต่อเนื่อง",
        "description": ""
    },
    "unlinked": {
        "message": "เลิกเชื่อมโยงแล้ว",
        "description": ""
    },
    "relink": {
        "message": "เชื่อมโยงอีกครั้ง",
        "description": ""
    },
    "autoUpdateNewVersionTitle": {
        "message": "มีการอัพเดทสำหรับ Session",
        "description": ""
    },
    "autoUpdateNewVersionMessage": {
        "message": "มี Session รุ่นใหม่แล้ว",
        "description": ""
    },
    "autoUpdateNewVersionInstructions": {
        "message": "กด เริ่มต้น Session ใหม่เพื่อเริ่มใช้การอัพเดต",
        "description": ""
    },
    "autoUpdateRestartButtonLabel": {
        "message": "เริ่มต้น Session ใหม่",
        "description": ""
    },
    "autoUpdateLaterButtonLabel": {
        "message": "ไว้ภายหลัง",
        "description": ""
    },
    "leftTheGroup": {
        "message": "$name$ ได้ออกจากกลุ่ม",
        "description": "Shown in the conversation history when a single person leaves the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleLeftTheGroup": {
        "message": "$name$ ได้ออกจากกลุ่ม",
        "description": "Shown in the conversation history when multiple people leave the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "updatedTheGroup": {
        "message": "กลุ่มมีการปรับปรุง",
        "description": "Shown in the conversation history when someone updates the group"
    },
    "titleIsNow": {
        "message": "หัวข้อตอนนี้คือ '$name$'",
        "description": "Shown in the conversation history when someone changes the title of the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Book Club"
            }
        }
    },
    "joinedTheGroup": {
        "message": "$name$ ได้เข้าร่วมกลุ่ม",
        "description": "Shown in the conversation history when a single person joins the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "multipleJoinedTheGroup": {
        "message": "$names$ ได้เข้าร่วมกลุ่ม",
        "description": "Shown in the conversation history when more than one person joins the group",
        "placeholders": {
            "names": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    }
}
