{
    "softwareAcknowledgments": {
        "message": "ການຮອງຮັບຂອງໂປແກຣມສອບແວ່ຣ",
        "description": "Shown in the about box for the link to software acknowledgments"
    },
    "privacyPolicy": {
        "message": "ເງື່ອນໄຂແລະນະໂຍບາຍຄວາມເປັນສ່ວນຕົວ",
        "description": "Shown in the about box for the link to https://signal.org/legal"
    },
    "copyErrorAndQuit": {
        "message": "ກອບປີ້ຕົວບໍທຳງານແລະລົບລ້າງ",
        "description": "Shown in the top-level error popup, allowing user to copy the error text and close the app"
    },
    "unknownContact": {
        "message": "ບໍສາມາດເຊື່ອມຕໍ່",
        "description": "Shown as the name of a contact if we don't have any displayable information about them"
    },
    "unknownGroup": {
        "message": "ບໍ່ສາມາດເຂົ້າກຸ່ມ",
        "description": "Shown as the name of a group if we don't have any information about it"
    },
    "databaseError": {
        "message": "ໍຂໍມູນດາຕ່າ ບໍ່ທຳງານ",
        "description": "Shown in a popup if the database cannot start up properly"
    },
    "deleteAndRestart": {
        "message": "ລົບຂໍມູນດາຕ່າທັງໝົດແລະເປີດເຄືອງໄຫມ່",
        "description": "Shown in a popup if the database cannot start up properly; allows user to delete database and restart"
    },
    "mainMenuFile": {
        "message": "ແຟ້ມ",
        "description": "The label that is used for the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuCreateStickers": {
        "message": "ສ້າງ / ອັບໂຫລດສະຕິກເກີແພັກ",
        "description": "The label that is used for the Create/upload sticker pack option in the File menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuEdit": {
        "message": "ດັດແກ້",
        "description": "The label that is used for the Edit menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuView": {
        "message": "ເບິ່ງ",
        "description": "The label that is used for the View menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuWindow": {
        "message": "ວີນໂດ",
        "description": "The label that is used for the Window menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuHelp": {
        "message": "ຊ່ວຍ",
        "description": "The label that is used for the Help menu in the program main menu. The '&' indicates that the following letter will be used as the keyboard 'shortcut letter' for accessing the menu with the Alt-<letter> combination."
    },
    "mainMenuSettings": {
        "message": "ການຕັ້ງຄ່າ…",
        "description": "The label that is used for the Preferences menu in the program main menu. This should be consistent with the standard naming for ‘Preferences’ on the operating system."
    },
    "appMenuServices": {
        "message": "Services",
        "description": "Application menu item for macOS 'Services'"
    },
    "appMenuHide": {
        "message": "ເຊື່ອງ",
        "description": "Application menu command to hide the window"
    },
    "appMenuHideOthers": {
        "message": "ເຊື່ອງອື່ນໆ",
        "description": "Application menu command to hide all other windows"
    },
    "appMenuUnhide": {
        "message": "ສະແດງທັງໜົດ",
        "description": "Application menu command to show all application windows"
    },
    "appMenuQuit": {
        "message": "ປິດສີກຫນໍ",
        "description": "Application menu command to close the application"
    },
    "editMenuUndo": {
        "message": "ຍົກເລີກ",
        "description": "Edit menu command to remove recently-typed text"
    },
    "editMenuRedo": {
        "message": "ເກັບຂໍ້ມູນຄືນ",
        "description": "Edit menu command to restore previously undone typed text"
    },
    "editMenuCut": {
        "message": "ຕັດອອກ",
        "description": "Edit menu command to remove selected text and add it to clipboard"
    },
    "editMenuCopy": {
        "message": "ກອບປີ້",
        "description": "Edit menu command to add selected text to clipboard"
    },
    "editMenuPaste": {
        "message": "ວາງໄສ່",
        "description": "Edit menu command to insert text from clipboard at cursor location"
    },
    "editMenuPasteAndMatchStyle": {
        "message": "ວ່າງໄຫ້ຮູບແບບຕົງກັນ",
        "description": "Edit menu command to insert text from clipboard at cursor location, taking only text and not style information"
    },
    "editMenuDelete": {
        "message": "ລົບ",
        "description": "Edit menu command to remove the selected text"
    },
    "editMenuSelectAll": {
        "message": "ເລື່ອກທັງຫມົດ",
        "description": "Edit menu command to select all of the text in selected text box"
    },
    "editMenuStartSpeaking": {
        "message": "ເລີມເວົ້າ",
        "description": "Edit menu item under 'speech' to start dictation"
    },
    "editMenuStopSpeaking": {
        "message": "ຍຸດເວົ້າ",
        "description": "Edit menu item under 'speech' to stop dictation"
    },
    "windowMenuClose": {
        "message": "ປີດວີນໂດ",
        "description": "Window menu command to close the current window"
    },
    "windowMenuMinimize": {
        "message": "ເຊື່ອງ",
        "description": "Window menu command to minimize the current window"
    },
    "windowMenuZoom": {
        "message": "ໄຫ່ຍກວ່າ",
        "description": "Window menu command to make the current window the size of the whole screen"
    },
    "windowMenuBringAllToFront": {
        "message": "ເອົາສ່ວນສຳຄັນທາງຫນ້າທັງໝົດ",
        "description": "Window menu command to bring all windows of current application to front"
    },
    "viewMenuResetZoom": {
        "message": "ຂະໝາດທີມີຢູ່",
        "description": "View menu command to go back to the default zoom"
    },
    "viewMenuZoomIn": {
        "message": "ຊົ້ມເຂົ້າ",
        "description": "View menu command to make everything bigger"
    },
    "viewMenuZoomOut": {
        "message": "ຊົ້ມອອກ",
        "description": "View menu command to make everything smaller"
    },
    "viewMenuToggleFullScreen": {
        "message": "ເປີດເຕັມຈໍ",
        "description": "View menu command to enter or leave Full Screen mode"
    },
    "viewMenuToggleDevTools": {
        "message": "ເປີດໄຊ້ເຄືອງມືການພັດທະນາເວັບໄຊ້",
        "description": "View menu command to show or hide the developer tools"
    },
    "menuSetupAsNewDevice": {
        "message": "ຕິດຕັ້ງອຸປະກອນໄຫມ່",
        "description": "When the application is not yet set up, menu option to start up the set up as fresh device"
    },
    "menuSetupAsStandalone": {
        "message": "ຕັ້ງຄ່າເປັນອຸປະກອນ ທີເລີ່ມດ້ວຍຕົວ",
        "description": "Only available on development modes, menu option to open up the standalone device setup sequence"
    },
    "messageContextMenuButton": {
        "message": "ເພີມລັກສະນະ",
        "description": "Label for context button next to each message"
    },
    "contextMenuCopyLink": {
        "message": "ກອບປີ້ລີ່ງ",
        "description": "Shown in the context menu for a link to indicate that the user can copy the link"
    },
    "contextMenuCopyImage": {
        "message": "ກອບປີ້ຮູບ",
        "description": "Shown in the context menu for an image to indicate that the user can copy the image"
    },
    "contextMenuNoSuggestions": {
        "message": "ບໍ່ມີຄຳແນະນຳ",
        "description": "Shown in the context menu for a misspelled word to indicate that there are no suggestions to replace the misspelled word"
    },
    "avatarMenuViewArchive": {
        "message": "ເບີງສີງທີເກັບໄວ້ເບືອງຫລັງ",
        "description": "One of the menu options available in the Avatar Popup menu"
    },
    "avatarMenuChatColors": {
        "message": "Chat Color",
        "description": "One of the menu options available in the Avatar Popup menu"
    },
    "loading": {
        "message": "ກຳລັງໂຫລດ...",
        "description": "Message shown on the loading screen before we've loaded any messages"
    },
    "optimizingApplication": {
        "message": "ກຳລັງເພີ່ມປະສິດທິພາບແອັບພິເຄຊັ່ນ",
        "description": "Message shown on the loading screen while we are doing application optimizations"
    },
    "migratingToSQLCipher": {
        "message": "ເພີມປະສິດຕິພາບ ຂໍ້ຄວາມ...$status$ ໄຫ້ສົມບູນ.",
        "description": "Message shown on the loading screen while we are doing application optimizations",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "45/200"
            }
        }
    },
    "archivedConversations": {
        "message": "ເບືອງຫລັງຂອງການສົນທະນາ",
        "description": "Shown in place of the search box when showing archived conversation list"
    },
    "LeftPane--pinned": {
        "message": "ມູດ",
        "description": "Shown as a header for pinned conversations in the left pane"
    },
    "LeftPane--chats": {
        "message": "ແຊັດ",
        "description": "Shown as a header for non-pinned conversations in the left pane"
    },
    "archiveHelperText": {
        "message": "ການສົນທະນານີ້ ໄດ້ເກັບໄວ້ ແລະ ຈະໄດ້ປະກົດຂື້ນ ຢູ່ໄນອີນບັອກເທົ່ານັ້ນ ຖ້າມີຂໍ້ຄວາມໄໝ່ ທີໄດ້ຮັບ.",
        "description": "Shown at the top of the archived conversations list in the left pane"
    },
    "archiveConversation": {
        "message": "ເກັບໄວ້ເບືອງຫລັງ",
        "description": "Shown in menu for conversation, and moves conversation out of main conversation list"
    },
    "markUnread": {
        "message": "ໝາຍສີ່ງທີບໍ່ໄດ້ອ່ານ",
        "description": "Shown in menu for conversation, and marks conversation as unread"
    },
    "moveConversationToInbox": {
        "message": "ບໍເກັບໄວ້ເບືອງຫລັງ",
        "description": "Undoes Archive Conversation action, and moves archived conversation back to the main conversation list"
    },
    "pinConversation": {
        "message": "ມູດການສົນທະນາ",
        "description": "Shown in menu for conversation, and pins the conversation to the top of the conversation list"
    },
    "unpinConversation": {
        "message": "ບໍມີມູດການສົນທະນາ",
        "description": "Undoes Archive Conversation action, and unpins the conversation from the top of the conversation list"
    },
    "pinnedConversationsFull": {
        "message": "ເຈົ້າສາມາດໄຊ້ມູດ4ອັນຂື້ນໄປ",
        "description": ""
    },
    "chooseDirectory": {
        "message": "ເລືອກແຟ້ມ",
        "description": "Button to allow the user to find a folder on disk"
    },
    "chooseFile": {
        "message": "ເລືອກໄຟ",
        "description": "Button to allow the user to find a file on disk"
    },
    "loadDataHeader": {
        "message": "ໂລດຂໍມູນດາຕ່າ",
        "description": "Header shown on the first screen in the data import process"
    },
    "loadDataDescription": {
        "message": "You've just gone through the export process, and your contacts and messages are waiting patiently on your computer. Select the folder that contains your saved Signal data.",
        "description": "Introduction to the process of importing messages and contacts from disk"
    },
    "importChooserTitle": {
        "message": "ເລືອກຂໍມູນທີຈຳເປັນແລ້ວສົ່ງອອກ",
        "description": "Title of the popup window used to select data previously exported"
    },
    "importErrorHeader": {
        "message": "ບາງຢາງມີບັນຫາ",
        "description": "Header of the error screen after a failed import"
    },
    "importingHeader": {
        "message": "ຂໍ້ຄວາມແລະການຕິດຕໍ່ ກຳລັງດາວໂລດ",
        "description": "Header of screen shown as data is import"
    },
    "importErrorFirst": {
        "message": "Make sure you have chosen the correct directory that contains your saved Signal data. Its name should begin with 'Signal Export.' You can also save a new copy of your data from the Chrome App.",
        "description": "Message shown if the import went wrong; first paragraph"
    },
    "importErrorSecond": {
        "message": "If these steps don't work for you, please submit a debug log (View -> Debug Log) so that we can help you get migrated!",
        "description": "Message shown if the import went wrong; second paragraph"
    },
    "importAgain": {
        "message": "ເລືອກແຟ້ມແລະລອງໄຫມ່ອີກຄັງ",
        "description": "Button shown if the user runs into an error during import, allowing them to start over"
    },
    "importCompleteHeader": {
        "message": "ສຳເລັດ",
        "description": "Header shown on the screen at the end of a successful import process"
    },
    "importCompleteStartButton": {
        "message": "້ເລີ່ມໄຊ້ສີກຫນໍແດັສທອບ",
        "description": "Button shown at end of successful import process, nothing left but a restart"
    },
    "importCompleteLinkButton": {
        "message": "ລີງທີເຊືອມຕໍ່ມືຖືຂອງເຈັ້າ",
        "description": "Button shown at end of successful 'light' import process, so the standard linking process still needs to happen"
    },
    "selectedLocation": {
        "message": "ເລືອກຕຳແຫນ່ງຂອງເຈົ້າ",
        "description": "Message shown as the export location if we didn't capture the target directory"
    },
    "upgradingDatabase": {
        "message": "ເພີມຂໍມູນດາຕ່າ ນິ້ຈະໄຊ້ບາງເວລາ",
        "description": "Message shown on the loading screen when we're changing database structure on first run of a new version"
    },
    "loadingMessages": {
        "message": "ກຳລັງດາວໂລດຂໍ້ຄວາມ $count$ ໄດ້ແລ້ວ",
        "description": "Message shown on the loading screen when we're catching up on the backlog of messages",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "view": {
        "message": "ເບີງ",
        "description": "Used as a label on a button allowing user to see more information"
    },
    "youLeftTheGroup": {
        "message": "ເຈົ້າບໍ່ແມ່ນສຳມະຊີກຢູ່ໄນກຸ່ມ",
        "description": "Displayed when a user can't send a message because they have left the group"
    },
    "invalidConversation": {
        "message": "ກຸ່ມບໍ່ສາມາດໄຊ້ ກະລຸນາສ້າງກຸ່ມໄຫມ່",
        "description": "Displayed when a user can't send a message because something has gone wrong in the conversation."
    },
    "scrollDown": {
        "message": "ເລືອນລົງທ້າຍສຸດຂອງການສົນທະນາ",
        "description": "Alt text for button to take user down to bottom of conversation, shown when user scrolls up"
    },
    "messagesBelow": {
        "message": "ຂໍ້ຄວາມໄຫມ່ຢູ່ເບືອງລຸ້ມ",
        "description": "Alt text for button to take user down to bottom of conversation with more than one message out of screen"
    },
    "unreadMessage": {
        "message": "1 ບໍ່ອ່ານຂໍ້ຄວາມ",
        "description": "Text for unread message separator, just one message"
    },
    "unreadMessages": {
        "message": "$count$  ບໍ່ອ່ານຂໍ້ຄວາມ",
        "description": "Text for unread message separator, with count",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "messageHistoryUnsynced": {
        "message": "ສຳລັບຄວາມປອດໄພ ການສົນທະນາທີຜ່ານມາ ບໍ່ສາມາດຍົກຍ້າຍໄປລີ່ງໄຫມ່ໄດ້",
        "description": "Shown in the conversation history when a user links a new device to explain what is not supported."
    },
    "youMarkedAsVerified": {
        "message": "ເຈົ້າເລືອກໝາຍເລັກທີເໝາະສົມກັບ $name$ ເປັນການຢືນຢັ້ນ",
        "description": "Shown in the conversation history when the user marks a contact as verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerified": {
        "message": "ເຈົ້າເລືອກໝາຍເລັກທີເໝາະສົມກັບ $name$ ບໍສາມາດຢືນຢັ້ນ",
        "description": "Shown in the conversation history when the user marks a contact as not verified, whether on the Safety Number screen or by dismissing a banner or dialog.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsVerifiedOtherDevice": {
        "message": "ເຈົ້າເລືອກໝາຍເລັກທີເໝາະສົມກັບ $name$ ແລ້ວຈະຢືນຢົ້ນຈາກອຸປະກອນອື່ນ",
        "description": "Shown in the conversation history when we discover that the user marked a contact as verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "youMarkedAsNotVerifiedOtherDevice": {
        "message": "ເຈົ້າເລືອກໝາຍທີເໝາະສົມກັບ $name$ ທີບໍ່ສາມາດຢືນຢົ້ນຈາກອຸປະກອນອື່ນ",
        "description": "Shown in the conversation history when we discover that the user marked a contact as not verified on another device.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "membersNeedingVerification": {
        "message": "Your safety numbers with these group members have changed since you last verified. Click a group member to see your new safety number with them.",
        "description": "When there are multiple previously-verified group members with safety number changes, a banner will be shown. The list of contacts with safety number changes is shown, and this text introduces that list."
    },
    "changedRightAfterVerify": {
        "message": "The safety number you are trying to verify has changed. Please review your new safety number with $name1$. Remember, this change could mean that someone is trying to intercept your communication or that $name2$ has simply reinstalled Signal.",
        "description": "Shown on the safety number screen when the user has selected to verify/unverify a contact's safety number, and we immediately discover a safety number change",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "Bob"
            },
            "name2": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "changedVerificationWarning": {
        "message": "The following people may have reinstalled or changed devices. Verify your safety number with them to ensure privacy.",
        "description": "Shown on confirmation dialog when user attempts to send a message"
    },
    "identityKeyErrorOnSend": {
        "message": "Your safety number with $name1$ has changed. This could either mean that someone is trying to intercept your communication or that $name2$ has simply reinstalled Signal. You may wish to verify your safety number with this contact.",
        "description": "Shown when user clicks on a failed recipient in the message detail view after an identity key change",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "Bob"
            },
            "name2": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "sendAnyway": {
        "message": "ສົ່ງໄປທີອື່ນໆ",
        "description": "Used on a warning dialog to make it clear that it might be risky to send the message."
    },
    "callAnyway": {
        "message": "ໂທໄປທີອື່ນໆ",
        "description": "Used on a warning dialog to make it clear that it might be risky to call the conversation."
    },
    "continueCall": {
        "message": "ສືບຕໍ່ການໂທ",
        "description": "Used on a warning dialog to make it clear that it might be risky to continue the group call."
    },
    "noLongerVerified": {
        "message": "້ເຈົ້າເລືອກເລັກທີເໝາະສົມກັບ 1$name$ ທີມີການປຽນແປງ ແລະ ມັນບໍສາມາດຢືນຢົ້ນໄດ້ ຈາກການກົດປຸ້ມເພືອສະແດງ",
        "description": "Shown in conversation banner when user's safety number has changed, but they were previously verified.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleNoLongerVerified": {
        "message": "ເຈົ້າເລືອກເລັກກັບຈຳນວນຫຼາຍ ສຳມະຊີກທີຢູ່ກຸ່ມມີການປຽນແປງ ແລະບໍ່ສາມາດຢືນຢົ້ນ ຈາກການກົດປຸ້ມເພືອສະແດງ",
        "description": "Shown in conversation banner when more than one group member's safety number has changed, but they were previously verified."
    },
    "debugLogExplanation": {
        "message": "This log will be posted publicly online for contributors to view. You may examine and edit it before submitting.",
        "description": ""
    },
    "debugLogError": {
        "message": "ມີບາງຢ່າງຜີດປົກກະຕິ ກັບ ການອັບໂລດ ກະລຸນາພີຈາລະນາເພີມ ທ່ອນໄຟຂອງຄວາມບົກພ່ອງ",
        "description": ""
    },
    "debugLogCopy": {
        "message": "ກອບປີ້",
        "description": "Shown as the text for the copy button on the debug log screen"
    },
    "debugLogCopyAlt": {
        "message": "ກອບປີ້ລີ່ງ ໄປທີແປັນພີມ",
        "description": "Shown as the alt text for the copy button on the debug log screen"
    },
    "debugLogLinkCopied": {
        "message": "ລີ່ງທີກອບປີ້ ໄປທີແປັນພີມ",
        "description": "Shown in a toast to let the user know that the link to the debug log has been copied to their clipboard"
    },
    "reportIssue": {
        "message": "ລາຍງານຕົວບັນຫາ",
        "description": "Link to open the issue tracker"
    },
    "gotIt": {
        "message": "ໄດ້ແລ້ວ",
        "description": "Label for a button that dismisses a dialog. The user clicks it to confirm that they understand the message in the dialog."
    },
    "submit": {
        "message": "ສະເຫນີ",
        "description": ""
    },
    "acceptNewKey": {
        "message": "ຍ້ອມຮັບ",
        "description": "Label for a button to accept a new safety number"
    },
    "verify": {
        "message": "ໝາຍຈາກການຢືນຢັ້ນ",
        "description": ""
    },
    "unverify": {
        "message": "ບໍ່ໝາຍຈາກການາຢືນຢັ້ນ",
        "description": ""
    },
    "isVerified": {
        "message": "ເຈົ້າມີການຢືນຢັ້ນ ຈຳນວນເລັກທີເໝາະສົມກັບ$name$",
        "description": "Summary state shown at top of the safety number screen if user has verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "isNotVerified": {
        "message": "ເຈົ້າບໍມີການຢືນຢັ້ນ ຈຳນວນເລັກທີເໝາະສົມຂອງເຈົ້າກັບ1$name$",
        "description": "Summary state shown at top of the safety number screen if user has not verified contact.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "verified": {
        "message": "ການຢືນຢັ້ນ",
        "description": ""
    },
    "newIdentity": {
        "message": "ຈຳນວນເລັກໄຫມ່ທີເໝາະສົມ",
        "description": "Header for a key change dialog"
    },
    "identityChanged": {
        "message": "Your safety number with this contact has changed. This could either mean that someone is trying to intercept your communication, or this contact simply reinstalled Signal. You may wish to verify the new safety number below.",
        "description": ""
    },
    "incomingError": {
        "message": "ຂໍ້ຄວາມທີເຂົ້າມາມີຄວາມຜິດພາດ",
        "description": ""
    },
    "media": {
        "message": "ເຄືອງສຽງ",
        "description": "Header of the default pane in the media gallery, showing images and videos"
    },
    "mediaEmptyState": {
        "message": "ເຈົ້າບໍ່ມີຮູບຫຼືວີດີໂອໄນການສົນທະນາ",
        "description": "Message shown to user in the media gallery when there are no messages with media attachments (images or video)"
    },
    "allMedia": {
        "message": "ສື່ທັງໝົດ",
        "description": "Header for the media gallery"
    },
    "documents": {
        "message": "ຂໍ້ມູນ",
        "description": "Header of the secondary pane in the media gallery, showing every non-media attachment"
    },
    "documentsEmptyState": {
        "message": "ເຈົ້າບໍ່ມີລັກຖານໄນການສົນທະນາ",
        "description": "Message shown to user in the media gallery when there are no messages with document attachments (anything other than images or video)"
    },
    "today": {
        "message": "ມື້​ນີ້",
        "description": "Section header in the media gallery"
    },
    "yesterday": {
        "message": "ມື້ວານນີ້",
        "description": "Section header in the media gallery"
    },
    "thisWeek": {
        "message": "ອາ​ທິດ​ນີ້",
        "description": "Section header in the media gallery"
    },
    "thisMonth": {
        "message": "ເດືອນ​ນີ້",
        "description": "Section header in the media gallery"
    },
    "unsupportedAttachment": {
        "message": "ບໍ່ຮັບຮອງ ປະເພດ ອຸປະກອນທີຍືດຕິດ. ກົດເພືອບັນທືກ.",
        "description": "Displayed for incoming unsupported attachment"
    },
    "clickToSave": {
        "message": "ກົດປຸ້ມເກັບ",
        "description": "Hover text for attachment filenames"
    },
    "unnamedFile": {
        "message": "ບໍ່ມີຊື່ໄນໄຝ",
        "description": "Hover text for attachment filenames"
    },
    "voiceMessage": {
        "message": "ຂໍ້ຄວາມສຽງ",
        "description": "Name for a voice message attachment"
    },
    "dangerousFileType": {
        "message": "ປະເພດ ອຸປະກອນທີຍືດຕິດ ບໍ່ມີການຮັບຮອງ ດ້ານຄວາມປອດໄພ ",
        "description": "Shown in toast when user attempts to send .exe file, for example"
    },
    "loadingPreview": {
        "message": "ກຳລັງດາວໂລດການສະແດງຂອງສີກຫນໍແດັດທອບ",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area"
    },
    "stagedPreviewThumbnail": {
        "message": "ຮູບຮ່າງຫຍໍ້ ຂອງລີງທີຜ່ານມາ ສຳລັບ $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "previewThumbnail": {
        "message": "ຮູບນ້ອຍລີງ ທີຜ່ານມາ ສຳລັບ $domain$",
        "description": "Shown while Signal Desktop is fetching metadata for a url in composition area",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "instagram.com"
            }
        }
    },
    "stagedImageAttachment": {
        "message": "ຮ່າງຮູບພາບ ອຸປະກອນທີຍືດຕິດ: $path$",
        "description": "Alt text for staged attachments",
        "placeholders": {
            "path": {
                "content": "$1",
                "example": "dog.jpg"
            }
        }
    },
    "oneNonImageAtATimeToast": {
        "message": "When including a non-image attachment, the limit is one attachment per message.",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "cannotMixImageAndNonImageAttachments": {
        "message": "ເຈົ້າບໍ່ສາມາດສ້າງຮູບພາບແລະຮູບພາບໄນຫນື່ງຂໍ້ຄວາມກະຕິດຕັ້ງບໍ່ໄດ້",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "maximumAttachments": {
        "message": "ເຈົ້້າບໍ່ສາມາດເພີມໄນການຕິດຕັ້ງຂໍ້ຄວາມນີ້ອີກ",
        "description": "An error popup when the user has attempted to add an attachment"
    },
    "fileSizeWarning": {
        "message": "Sorry, the selected file exceeds message size restrictions.",
        "description": ""
    },
    "unableToLoadAttachment": {
        "message": "ມີບັນຫາການດາວໂລດເລືອກຂອງການຕິດຕັ້ງ",
        "description": ""
    },
    "disconnected": {
        "message": "ບໍສາມາດເຊື່ອມຕໍ່ໄດ້",
        "description": "Displayed when the desktop client cannot connect to the server."
    },
    "connecting": {
        "message": "ກຳລັງເຊື່ອມຕໍ່",
        "description": "Displayed when the desktop client is currently connecting to the server."
    },
    "connect": {
        "message": "້ເຊື່ອມຕໍ່",
        "description": "Shown to allow the user to manually attempt a reconnect."
    },
    "connectingHangOn": {
        "message": "ໄຊ້ເວລາບໍດົນ...",
        "description": "Subtext description for when the client is connecting to the server."
    },
    "offline": {
        "message": "ັໂຕເຄືອງທຳງານເອງ",
        "description": "Displayed when the desktop client has no network connection."
    },
    "checkNetworkConnection": {
        "message": "ກວດເບີງການເຊື່ອມເຄື່ອຂ່າຍຂອງເຈົ້າ",
        "description": "Obvious instructions for when a user's computer loses its network connection"
    },
    "submitDebugLog": {
        "message": "ລ໋ອກ ດີບາກ",
        "description": "Menu item and header text for debug log modal (sentence case)"
    },
    "debugLog": {
        "message": "ລ໋ອກ ດີບາກ",
        "description": "View menu item to open the debug log (title case)"
    },
    "helpMenuShowKeyboardShortcuts": {
        "message": "ສະແດງທາງລັດການໄຊ້ແປັນພີມ",
        "description": "Item under the help menu, pops up a screen showing the application's keyboard shortcuts"
    },
    "contactUs": {
        "message": "ຕິດຕໍ່ພວກເຮົາ",
        "description": "Item under the help menu, takes you to the contact us support page"
    },
    "goToReleaseNotes": {
        "message": "ໄປແກ້ໄຂສີ່ງທີບັນທືກ",
        "description": "Item under the help menu, takes you to GitHub page for release notes"
    },
    "goToForums": {
        "message": "ໄປທີ່ບົດຄວາມ",
        "description": "Item under the Help menu, takes you to the forums"
    },
    "goToSupportPage": {
        "message": "ໄປຊ່ວຍການສາໝັບສະໝູນເພກ",
        "description": "Item under the Help menu, takes you to the support page"
    },
    "joinTheBeta": {
        "message": "ເຂົ້າຮ່ວມ ບີຕ໋າ",
        "description": "Item under the Help menu, takes you to an article describing how to install the beta release of Signal Desktop"
    },
    "signalDesktopPreferences": {
        "message": "ການຕັ້ງຄ່າສີກຫນໍແດັດທອບ",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "signalDesktopStickerCreator": {
        "message": "ການສ້າງສະຕີກເກີພິເສດ",
        "description": "Title of the window that pops up with Signal Desktop preferences in it"
    },
    "aboutSignalDesktop": {
        "message": "ກ່ຽວກັບສີກຫນໍແດັດທອບ",
        "description": "Item under the Help menu, which opens a small about window"
    },
    "screenShareWindow": {
        "message": "Sharing screen",
        "description": "Title for screen sharing window"
    },
    "speech": {
        "message": "ຄວາມໄວ",
        "description": "Item under the Edit menu, with 'start/stop speaking' items below it"
    },
    "show": {
        "message": "ສະແດງ",
        "description": "Command under Window menu, to show the window"
    },
    "hide": {
        "message": "ເຊື່ອງ",
        "description": "Command in the tray icon menu, to hide the window"
    },
    "quit": {
        "message": "ສ່ວນກຽ່ວຂ້ອງ",
        "description": "Command in the tray icon menu, to quit the application"
    },
    "signalDesktop": {
        "message": "ສີກຫນໍແດັດທອບ",
        "description": "Tooltip for the tray icon"
    },
    "search": {
        "message": "ຄົ້ນຫາ",
        "description": "Placeholder text in the search input"
    },
    "clearSearch": {
        "message": "ລ້າງການຄົ້ນຫາ",
        "description": "Aria label for clear search button"
    },
    "searchIn": {
        "message": "ຄົ້ນຫາໄນ $conversationName$",
        "description": "Shown in the search box before text is entered when searching in a specific conversation",
        "placeholders": {
            "conversationName": {
                "content": "$1",
                "example": "Friends"
            }
        }
    },
    "noSearchResults": {
        "message": "ບໍ່ໄດ້ຜົນສຳລັບ\" $searchTerm$\"",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            }
        }
    },
    "noSearchResults--sms-only": {
        "message": "SMS/MMS contacts are not available on Desktop.",
        "description": "Shown in the search left pane when no results were found and primary device has SMS/MMS handling enabled"
    },
    "noSearchResultsInConversation": {
        "message": "ບໍ່ໄດ້ຜົນສຳລັບ\"1$searchTerm$\"ໄນ $conversationName$",
        "description": "Shown in the search left pane when no results were found",
        "placeholders": {
            "searchTerm": {
                "content": "$1",
                "example": "dog"
            },
            "conversationName": {
                "content": "$2",
                "example": "Friends"
            }
        }
    },
    "conversationsHeader": {
        "message": "ການສົນທະນາ",
        "description": "Shown to separate the types of search results"
    },
    "contactsHeader": {
        "message": "ຕິດຕໍ່",
        "description": "Shown to separate the types of search results"
    },
    "groupsHeader": {
        "message": "Groups",
        "description": "Shown to separate the types of search results"
    },
    "messagesHeader": {
        "message": "ຂໍ້ຄວາມ",
        "description": "Shown to separate the types of search results"
    },
    "welcomeToSignal": {
        "message": "ຍີນດີນຕ້ອນຮັບສີກຫນໍ",
        "description": ""
    },
    "selectAContact": {
        "message": "ເລືອກກຸ່ມທີຕິດຕໍ່ຫຼືກຳລັງແຊັດຫາ",
        "description": ""
    },
    "typingAlt": {
        "message": "ພີມການສົນທະນາ ດ້ວຍພາບກາຕູນ ທີເຄືອນໄຫວໄດ້",
        "description": "Used as the 'title' attribute for the typing animation"
    },
    "contactInAddressBook": {
        "message": "ຄົນນີ້ຢູ່ໄນການຕິດຕໍ່ຂອງເຈົ້າ",
        "description": "Description of icon denoting that contact is from your address book"
    },
    "contactAvatarAlt": {
        "message": "ເຊື່ອມຕໍ່ກັບຄືນ ອາວະຕ໋າ $name$",
        "description": "Used in the alt tag for the image avatar of a contact",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "sendMessageToContact": {
        "message": "ສົ່ງຂໍ້ຄວາມ",
        "description": "Shown when you are sent a contact and that contact has a signal account"
    },
    "home": {
        "message": "ບ້ານ",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "work": {
        "message": "ວຽກ",
        "description": "Shown on contact detail screen as a label for an address/phone/email"
    },
    "mobile": {
        "message": "ມືຖື",
        "description": "Shown on contact detail screen as a label for aa phone or email"
    },
    "email": {
        "message": "ອີເມວ",
        "description": "Generic label shown if contact email has custom type but no label"
    },
    "phone": {
        "message": "ໂທລະສັບ",
        "description": "Generic label shown if contact phone has custom type but no label"
    },
    "address": {
        "message": "ທີຢູ່",
        "description": "Generic label shown if contact address has custom type but no label"
    },
    "poBox": {
        "message": "ທີ່ຢູຕູ້ໄປສະນີ",
        "description": "When rendering an address, used to provide context to a post office box"
    },
    "downloading": {
        "message": "ກຳລັງດາວໂລດ",
        "description": "Shown in the message bubble while a long message attachment is being downloaded"
    },
    "downloadAttachment": {
        "message": "ດາວໂລດການຕິດຕັ້ງ",
        "description": "Shown in a message's triple-dot menu if there isn't room for a dedicated download button"
    },
    "reactToMessage": {
        "message": "ປະຕິກິລິຍາຂໍ້ຄວາມ",
        "description": "Shown in triple-dot menu next to message to allow user to react to the associated message"
    },
    "replyToMessage": {
        "message": "ຕອບຂໍ້ຄວາມ",
        "description": "Shown in triple-dot menu next to message to allow user to start crafting a message with a quotation"
    },
    "originalMessageNotFound": {
        "message": "ຂໍ້ຄວາມສະບັບເກົ່າບໍ່ເຫັນ",
        "description": "Shown in quote if reference message was not found as message was initially downloaded and processed"
    },
    "originalMessageNotAvailable": {
        "message": "ຂໍ້ຄວາມສະບັບເກົ່າໄຊ້ບໍ່ໄດ້ດົນ",
        "description": "Shown in toast if user clicks on quote that references message no longer in database"
    },
    "messageFoundButNotLoaded": {
        "message": "ຂໍ້ຄວາມສະບັບເກົ່າທີເຫັນນັ້ນ ແຕ່ບໍໄດ້ໂລດ ເລື່ອນຂື້ນເພືອໂລດມັນ",
        "description": "Shown in toast if user clicks on quote references messages not loaded in view, but in database"
    },
    "voiceRecordingInterruptedMax": {
        "message": "ຂໍ້ຄວາມສຽງໄດ້ຍຸດ ເພາະວ່າ ເວລາສູງສຸດ ມີຂິດຈຳກັດ ຂອງການຄົ້ນຫາ.",
        "description": "Confirmation dialog message for when the voice recording is interrupted due to max time limit"
    },
    "voiceRecordingInterruptedBlur": {
        "message": "ການບັນທືກ ຂໍ້ຄວາມສຽງ ໄດ້ຢຸດ ເພາະວ່າ ທ່ານໄດ້ປຽ່ນ ໄປແອັບອື່ນ.",
        "description": "Confirmation dialog message for when the voice recording is interrupted due to app losing focus"
    },
    "voiceNoteLimit": {
        "message": "ຂໍ້ຄວາມສຽງ ຖືກຈຳກັດ 5ນາທີ ຂອງການບັນທືກສຽງ ຈະຢຸດ ຖ້າທ່ານປຽ່ນໄປແອັບອື່ນ.",
        "description": "Shown in toast to warn user about limited time and that window must be in focus"
    },
    "voiceNoteMustBeOnlyAttachment": {
        "message": "ຂໍ້ຄວາມສຽງຈະເປັນຫນືງໄນຄວາມຜູກພັນ",
        "description": "Shown in toast if tries to record a voice note with any staged attachments"
    },
    "attachmentSaved": {
        "message": "ເກັບຄວາມຜູກພັນ ກົດສະແດງໄນໂຟນເດີ",
        "description": "Shown after user selects to save to downloads",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "proof.jpg"
            }
        }
    },
    "you": {
        "message": "ທ່ານ",
        "description": "Shown when the user represented is the current user."
    },
    "replyingTo": {
        "message": "ກຳລັງຕອບໄປ $name$",
        "description": "Shown in iOS theme when you or someone quotes to a message which is not from you",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "audioPermissionNeeded": {
        "message": "ສົ່ງຂໍ້ຄວາມສຽງ, ສີກຫນໍແດັດທັອບ ອານຸໄຫ້ ເຂົ້າເຖີງ ໄມຄໍຣໂຟນຂອງທ່ານ.",
        "description": "Shown if the user attempts to send an audio message without audio permissions turned on"
    },
    "audioCallingPermissionNeeded": {
        "message": "ສຳລັບໂທ, ທ່ານຕ້ອງໄດ້ ຮັບອານຸຍາດ ສີກຫນໍແດັດທັອບ ເຂົ້າເຖີງໄມຄໍຣໂຟນຂອງທ່ານ.",
        "description": "Shown if the user attempts access the microphone for calling without audio permissions turned on"
    },
    "videoCallingPermissionNeeded": {
        "message": "ສຳລັບການໂທວີດີໂອ; ອະນຸຍາດໄຫ້ທ່ານ ໄຊ້ສິກຫນໍແດັດທອບ ເຂົ້າເຖີງ ກ້ອງຖ່າຍຂອງທ່ານ.",
        "description": "Shown if the user attempts access the camera for video calling without video permissions turned on"
    },
    "allowAccess": {
        "message": "ອະນຸຍາດໄຫ້ເຂົ້າໄປ",
        "description": "Button shown in popup asking to enable microphone/video permissions to send audio messages"
    },
    "showSettings": {
        "message": "ສະແດງການຕິດຕັ້ງ",
        "description": "A button shown in dialog requesting the user to turn on audio permissions"
    },
    "audio": {
        "message": "ສຽງ",
        "description": "Shown in a quotation of a message containing an audio attachment if no text was originally provided with that attachment"
    },
    "video": {
        "message": "ວີດີໂອ",
        "description": "Shown in a quotation of a message containing a video if no text was originally provided with that video"
    },
    "photo": {
        "message": "ຮູບພາບ",
        "description": "Shown in a quotation of a message containing a photo if no text was originally provided with that image"
    },
    "cannotUpdate": {
        "message": "ບໍ່ສາມາດອັບເດດ",
        "description": "Shown as the title of our update error dialogs on windows"
    },
    "cannotUpdateDetail": {
        "message": "Signal Desktop failed to update, but there is a new version available. Please go to $url$ and install the new version manually, then either contact support or file a bug about this problem.",
        "description": "Shown if a general error happened while trying to install update package",
        "placeholders": {
            "url": {
                "content": "$1",
                "example": "https://signal.org/download"
            }
        }
    },
    "readOnlyVolume": {
        "message": "Signal Desktop is likely in a macOS quarantine, and will not be able to auto-update. Please try moving $app$ to $folder$ with Finder.",
        "description": "Shown on MacOS if running on a read-only volume and we cannot update",
        "placeholders": {
            "app": {
                "content": "$1",
                "example": "Signal.app"
            },
            "folder": {
                "content": "$2",
                "example": "/Applications"
            }
        }
    },
    "ok": {
        "message": "ໂອເຄ",
        "description": ""
    },
    "cancel": {
        "message": "ຍົກເລີກ",
        "description": ""
    },
    "discard": {
        "message": "ປະຕິເສດ",
        "description": ""
    },
    "failedToSend": {
        "message": "ການສົ່ງມີບັນຫານ ຕໍ່ຜູ້ທີໄດ້ຮັບ. ກວດເບີງການເຊື່ອມເຄືອຂ່າຍຂອງທ່ານ.",
        "description": ""
    },
    "error": {
        "message": "ຜິດພາດ",
        "description": ""
    },
    "messageDetail": {
        "message": "ຂໍ້ຄວາມລາຍລະອຽດ",
        "description": ""
    },
    "delete": {
        "message": "ລົບ",
        "description": ""
    },
    "accept": {
        "message": "ຍ້ອມຮັບ",
        "description": ""
    },
    "on": {
        "message": "ເປີດ",
        "description": "Label for when something is turned on"
    },
    "off": {
        "message": "ປີດ",
        "description": "Label for when something is turned off"
    },
    "deleteWarning": {
        "message": "This message will be deleted from this device.",
        "description": "Text shown in the confirmation dialog for deleting a message locally"
    },
    "deleteForEveryoneWarning": {
        "message": "This message will be deleted for everyone in the conversation if they’re on a recent version of Signal. They will be able to see that you deleted a message.",
        "description": "Text shown in the confirmation dialog for deleting a message for everyone"
    },
    "deleteThisMessage": {
        "message": "ລົບຂໍ້ຄວາມນີ້",
        "description": ""
    },
    "from": {
        "message": "ຈາກ",
        "description": "Label for the sender of a message"
    },
    "to": {
        "message": "ເຖີງ",
        "description": "Label for the receiver of a message"
    },
    "toJoiner": {
        "message": "ເຖິງ",
        "description": "Joiner for message search results - like 'Jon' to 'Friends Group'"
    },
    "sent": {
        "message": "ສົ່ງ",
        "description": "Label for the time a message was sent"
    },
    "received": {
        "message": "ໄດ້ຮັບ",
        "description": "Label for the time a message was received"
    },
    "sendMessage": {
        "message": "ສົ່ງຂໍ້ຄວາມ",
        "description": "Placeholder text in the message entry field"
    },
    "groupMembers": {
        "message": "ສະມາຊິກກຸ່ມ",
        "description": ""
    },
    "showMembers": {
        "message": "ສະແດງສະມາຊິກ",
        "description": ""
    },
    "resetSession": {
        "message": "ກຳນົດການຕັ້ງຄ່າໄໝ່",
        "description": "This is a menu item for resetting the session, using the imperative case, as in a command."
    },
    "showSafetyNumber": {
        "message": "ເບີງຄືນເລັກທີເໝາະສົມ",
        "description": ""
    },
    "viewRecentMedia": {
        "message": "ເບິງຮູບພາບວີດີໂອທີຜ່ານມາ",
        "description": "This is a menu item for viewing all media (images + video) in a conversation, using the imperative case, as in a command."
    },
    "verifyHelp": {
        "message": "If you wish to verify the security of your end-to-end encryption with $name$, compare the numbers above with the numbers on their device.",
        "description": "",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "theirIdentityUnknown": {
        "message": "You haven't exchanged any messages with this contact yet. Your safety number with them will be available after the first message.",
        "description": ""
    },
    "back": {
        "message": "ກັບຫຼັງ",
        "description": "Generic label for back"
    },
    "goBack": {
        "message": "ຍ້ອນກັບ",
        "description": "Label for back button in a conversation"
    },
    "moreInfo": {
        "message": "ຂໍ້ມູນເພີ່ມເຕີມ",
        "description": "Shown on the drop-down menu for an individual message, takes you to message detail screen"
    },
    "retrySend": {
        "message": "ລອງສົ່ງໄໝ່",
        "description": "Shown on the drop-down menu for an individual message, but only if it is an outgoing message that failed to send"
    },
    "forwardMessage": {
        "message": "Forward message",
        "description": "Shown on the drop-down menu for an individual message, forwards a message"
    },
    "deleteMessage": {
        "message": "ລົບຂໍ້ຄວາມສຳລັບຂ້ອຍ",
        "description": "Shown on the drop-down menu for an individual message, deletes single message"
    },
    "deleteMessageForEveryone": {
        "message": "ລົບຂໍ້ຄວາມສຳລັບທຸກຄົນ",
        "description": "Shown on the drop-down menu for an individual message, deletes single message for everyone"
    },
    "deleteMessages": {
        "message": "ລົບ",
        "description": "Menu item for deleting messages, title case."
    },
    "deleteConversationConfirmation": {
        "message": "ລົບການສົນທະນາແບບຖາວອນບໍ່",
        "description": "Confirmation dialog text that asks the user if they really wish to delete the conversation. Answer buttons use the strings 'ok' and 'cancel'. The deletion is permanent, i.e. it cannot be undone."
    },
    "sessionEnded": {
        "message": "ການຕັ້ງຄ່າຄືນໄໝ່ທີ່ປອດໄພ",
        "description": "This is a past tense, informational message. In other words, your secure session has been reset."
    },
    "ChatRefresh--notification": {
        "message": "Chat session refreshed",
        "description": "Shown in timeline when a error happened, and the session was automatically reset."
    },
    "ChatRefresh--learnMore": {
        "message": "ຮຽນຮູ້ເພີມເຕິມ",
        "description": "Shown in timeline when session is automatically reset, to provide access to a popup info dialog"
    },
    "ChatRefresh--summary": {
        "message": "Signal uses end-to-end encryption and it may need to refresh your chat session sometimes. This doesn’t affect your chat’s security but you may have missed a message from this contact and you can ask them to resend it.",
        "description": "Shown on explainer dialog available from chat session refreshed timeline events"
    },
    "ChatRefresh--contactSupport": {
        "message": "Contact Support",
        "description": "Shown on explainer dialog available from chat session refreshed timeline events"
    },
    "DeliveryIssue--preview": {
        "message": "Delivery issue",
        "description": "Shown in left pane preview when message delivery issue happens"
    },
    "DeliveryIssue--notification": {
        "message": "A message from $sender$ couldn’t be delivered",
        "description": "Shown in timeline when message delivery issue happens",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "DeliveryIssue--learnMore": {
        "message": "ຮຽນຮູ້ເພີມເຕິມ",
        "description": "Shown in timeline when message delivery issue happens, to provide access to a popup info dialog"
    },
    "DeliveryIssue--title": {
        "message": "Delivery Issue",
        "description": "Shown on explainer dialog available from delivery issue timeline events"
    },
    "DeliveryIssue--summary": {
        "message": "A message, sticker, reaction, read receipt or media couldn’t be delivered to you from $sender$. They may have tried sending it to you directly, or in a group.",
        "description": "Shown on explainer dialog available from delivery issue timeline events",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "quoteThumbnailAlt": {
        "message": "Thumbnail of image from quoted message",
        "description": "Used in alt tag of thumbnail images inside of an embedded message quote"
    },
    "imageAttachmentAlt": {
        "message": "ຂໍ້ຄວາມຕິດກັບຮູບພາບ",
        "description": "Used in alt tag of image attachment"
    },
    "videoAttachmentAlt": {
        "message": "ຂໍ້ຄວາມຕິດກັບພາບໝ້າຈໍວີດີໂອ",
        "description": "Used in alt tag of video attachment preview"
    },
    "lightboxImageAlt": {
        "message": "ສົ່ງຮູບພາບໄນການສົນທະນາ",
        "description": "Used in the alt tag for the image shown in a full-screen lightbox view"
    },
    "imageCaptionIconAlt": {
        "message": "ກຳລັງສະແດງ ອີຄອນ ຮູບພາບນັ້ນ ທີບໍມີຄຳອະທີບາຍ",
        "description": "Used for the icon layered on top of an image in message bubbles"
    },
    "addACaption": {
        "message": "ເພີມຫົວຂໍ້",
        "description": "Used as the placeholder text in the caption editor text field"
    },
    "save": {
        "message": "ເກັບ",
        "description": "Used as a 'commit changes' button in the Caption Editor for outgoing image attachments"
    },
    "fileIconAlt": {
        "message": "ຮູບສັນຍາລັກເອກະສານ",
        "description": "Used in the media gallery documents tab to visually represent a file"
    },
    "installWelcome": {
        "message": "ຍີນດີຕ້ອນຮັບເຂົ້າຊູສີກຫນໍແດັດທອບ",
        "description": "Welcome title on the install page"
    },
    "installTagline": {
        "message": "ມີຄວາມເປັນສວ່ນໄດ້. ສີກຫນໍໄດ້ໄຫ້ ຄວາມສະໂດກສະບາຍ.",
        "description": "Tagline displayed under 'installWelcome' string on the install page"
    },
    "linkYourPhone": {
        "message": "ລີ່ງໂທລະສັບ ຂອງທ່ານ ໄປທີສີກຫນໍ ແດັດທອບ",
        "description": "Shown on the front page when the application first starts, above the QR code"
    },
    "signalSettings": {
        "message": "ຕັ້ງຄ່າສີກຫນໍ",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "linkedDevices": {
        "message": "ອຸປະກອນເຊື່ອມໂຍງ",
        "description": "Used in the guidance to help people find the 'link new device' area of their Signal mobile app"
    },
    "plusButton": {
        "message": "ປຸ່ມ",
        "description": "The button used in Signal Android to add a new linked device"
    },
    "linkNewDevice": {
        "message": "ອຸປະກອນເຊື່ອມໂຍງໄໝ່",
        "description": "The menu option shown in Signal iOS to add a new linked device"
    },
    "deviceName": {
        "message": "ຊື່ອຸປະກອນ",
        "description": "The label in settings panel shown for the user-provided name for this desktop instance"
    },
    "chooseDeviceName": {
        "message": "ເລຶອກຊື່ອຸປະກອນນີ້",
        "description": "The header shown on the 'choose device name' screen in the device linking process"
    },
    "finishLinkingPhone": {
        "message": "ສຳເລັດການເຊື່ອມຕໍ່ໂທລະສັບ",
        "description": "The text on the button to finish the linking process, after choosing the device name"
    },
    "initialSync": {
        "message": "ການຕິດຕໍ່ພົວພັນແລະກຸ່ມ",
        "description": "Shown during initial link while contacts and groups are being pulled from mobile device"
    },
    "installConnectionFailed": {
        "message": "ການເຊື່ອມຕໍ່ກັບເຊີບເວີລົ້ມເຫລວ",
        "description": "Displayed when we can't connect to the server."
    },
    "installTooManyDevices": {
        "message": "ຂໍໂທດ ທີເຈົ້າມີການເຊື່ອມຕໍ່ຢູ່ແລ້ວ ທີຕ້ອງຍ້າຍບາງສ່ວນອອກ",
        "description": ""
    },
    "installTooOld": {
        "message": "ອຸປະກອນອັບເດດສີກຫນໍລີງທີໂທລະສັບຂອງເຈົ້າ",
        "description": ""
    },
    "installErrorHeader": {
        "message": "ບາງຢາງມີບັນຫາ",
        "description": ""
    },
    "installTryAgain": {
        "message": "ລອງໄໝ່ອີກຄັ້ງ",
        "description": ""
    },
    "theme": {
        "message": "ຫົວຂໍ້",
        "description": "Header for theme settings"
    },
    "calling": {
        "message": "ກຳລັງໂທ",
        "description": "Header for calling options on the settings screen"
    },
    "calling__start": {
        "message": "ເລີມໂທ",
        "description": "Button label in the call lobby for starting a call"
    },
    "calling__join": {
        "message": "ເຂົ້າຮ່ວມການໂທ",
        "description": "Button label in the call lobby for joining a call"
    },
    "calling__return": {
        "message": "ໂທກັບຄືນ",
        "description": "Button label in the call lobby for returning to a call"
    },
    "calling__call-is-full": {
        "message": "ໂທບໍ່ຫວ່າງ",
        "description": "Button label in the call lobby when you can't join because the call is full"
    },
    "calling__button--video-disabled": {
        "message": "ກ້ອງຖ່າຍຮູບຖືກປິດໄຊ້ງານ",
        "description": "Button tooltip label when the camera is disabled"
    },
    "calling__button--video-off": {
        "message": "ປິດກ້ອງຖ່າຍຮູບ",
        "description": "Button tooltip label for turning off the camera"
    },
    "calling__button--video-on": {
        "message": "ເປີດກ້ອງຖ່າຍຮູບ",
        "description": "Button tooltip label for turning on the camera"
    },
    "calling__button--audio-disabled": {
        "message": "ໄມໂຄຣໂຟນມີບັນຫາ",
        "description": "Button tooltip label when the microphone is disabled"
    },
    "calling__button--audio-off": {
        "message": "ໄມບໍ່ມີສຽງ",
        "description": "Button tooltip label for turning off the microphone"
    },
    "calling__button--audio-on": {
        "message": "ປິດສຽງໄມ",
        "description": "Button tooltip label for turning on the microphone"
    },
    "calling__button--presenting-disabled": {
        "message": "Presenting disabled",
        "description": "Button tooltip label for when screen sharing is disabled"
    },
    "calling__button--presenting-on": {
        "message": "Start presenting",
        "description": "Button tooltip label for starting to share screen"
    },
    "calling__button--presenting-off": {
        "message": "Stop presenting",
        "description": "Button tooltip label for stopping screen sharing"
    },
    "calling__your-video-is-off": {
        "message": "ກ້ອງຖ່າຍຮູບຂອງເຈົ້າປິດ",
        "description": "Label in the calling lobby indicating that your camera is off"
    },
    "calling__lobby-summary--zero": {
        "message": "ບໍ່ ມີໄພຈັກຄົນຢູ່ທີນີ້",
        "description": "Shown in the calling lobby to describe who is in the call"
    },
    "calling__lobby-summary--single": {
        "message": "$first$ໄນການໂທນີ້",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            }
        }
    },
    "calling__lobby-summary--self": {
        "message": "ໝື່ງໃນອຸປະກອນອື່ນໆຂອງທ່ານແມ່ນຢູ່ໄນການໂທນີ້",
        "description": "Shown in the calling lobby to describe when it is just you"
    },
    "calling__lobby-summary--double": {
        "message": "$first$ ແລະ $second$ ແມ່ນຢູ່ໄນການໂທນີ້",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            }
        }
    },
    "calling__lobby-summary--triple": {
        "message": "$first$, $second$,ແລະ $third$ ແມ່ນຢູ່ໄນການໂທນີ້",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            },
            "third": {
                "content": "$3",
                "example": "April"
            }
        }
    },
    "calling__lobby-summary--many": {
        "message": "$first$, $second$,ແລະ $others$ ແມ່ນຢູ່ໄນການໂທອື່ນໆ",
        "description": "Shown in the calling lobby to describe who is in the call",
        "placeholders": {
            "first": {
                "content": "$1",
                "example": "Sam"
            },
            "second": {
                "content": "$2",
                "example": "Cayce"
            },
            "others": {
                "content": "$3",
                "example": "5"
            }
        }
    },
    "calling__in-this-call--zero": {
        "message": "ບໍ່ ມີໄພຈັກຄົນຢູ່ທີນີ້",
        "description": "Shown in the participants list to describe how many people are in the call"
    },
    "calling__in-this-call--one": {
        "message": "ມີ1 ຄົນໄນການໂທນີ້",
        "description": "Shown in the participants list to describe how many people are in the call"
    },
    "calling__in-this-call--many": {
        "message": "ມີ $people$ ໄນການໂທນີ້",
        "description": "Shown in the participants list to describe how many people are in the call",
        "placeholders": {
            "people": {
                "content": "$1",
                "example": "15"
            }
        }
    },
    "calling__you-have-blocked": {
        "message": "ທ່ານໄດ້ຖືກບລັອກ $name$",
        "description": "when you block someone and cannot view their video",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Henry Richard"
            }
        }
    },
    "calling__block-info": {
        "message": "ວິດີໂອຫຼືສຽງທີພວກເຈົ້າຫຍັງບໍ່ທັນໄດ້ຮັບ ແລະ ພວກເຂົາກະບໍ່ໄດ້ຮັບຈາກເຈົ້າ",
        "description": "Shown in the modal dialog to describe how blocking works in a gorup call"
    },
    "calling__overflow__scroll-up": {
        "message": "ເລື່ອນຂື້ນ",
        "description": "Label for the \"scroll up\" button in a call's overflow area"
    },
    "calling__overflow__scroll-down": {
        "message": "ເລື່ອນລົງ",
        "description": "Label for the \"scroll down\" button in a call's overflow area"
    },
    "calling__presenting--notification-title": {
        "message": "You're presenting to everyone.",
        "description": "Title for the share screen notification"
    },
    "calling__presenting--notification-body": {
        "message": "Click here to return to the call when you're ready to stop presenting.",
        "description": "Body text for the share screen notification"
    },
    "calling__presenting--info": {
        "message": "Signal is sharing $window$.",
        "description": "Text that appears in the screen sharing controller to inform person that they are presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Application"
            }
        }
    },
    "calling__presenting--stop": {
        "message": "Stop sharing",
        "description": "Button for stopping screen sharing"
    },
    "calling__presenting--you-stopped": {
        "message": "You stopped presenting",
        "description": "Toast that appears when someone stops presenting"
    },
    "calling__presenting--person-ongoing": {
        "message": "$name$ is presenting",
        "description": "Title of call when someone is presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Maddie"
            }
        }
    },
    "calling__presenting--person-stopped": {
        "message": "$name$ stopped presenting",
        "description": "Toast that appears when someone stops presenting",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Maddie"
            }
        }
    },
    "calling__presenting--permission-title": {
        "message": "Permission needed",
        "description": "Shown as the title for the modal that requests screen recording permissions"
    },
    "calling__presenting--macos-permission-description": {
        "message": "Signal needs permission to access your computer's screen recording.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step1": {
        "message": "Go to System Preferences.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step2": {
        "message": "Click on the lock icon on the bottom left and enter your computer’s password.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-instruction-step3": {
        "message": "On the right, check the box next to Signal. If you don’t see Signal in the list, click the + to add it.",
        "description": "Shown as the description for the modal that requests screen recording permissions"
    },
    "calling__presenting--permission-open": {
        "message": "Open System Preferences",
        "description": "The button that opens your system preferences for the needs screen record permissions modal"
    },
    "calling__presenting--permission-cancel": {
        "message": "Dismiss",
        "description": "The cancel button for the needs screen record permissions modal"
    },
    "alwaysRelayCallsDescription": {
        "message": "ການໂທຈະມີການປຽ່ນແປງຕະຫຼອດເວລາ",
        "description": "Description of the always relay calls setting"
    },
    "alwaysRelayCallsDetail": {
        "message": "Relay all calls through the Signal server to avoid revealing your IP address to your contact. Enabling will reduce call quality.",
        "description": "Details describing the always relay calls setting"
    },
    "permissions": {
        "message": "ການຮັບອະນຸຍາດ",
        "description": "Header for permissions section of settings"
    },
    "mediaPermissionsDescription": {
        "message": "ອະນຸຍາດໄຫ້ເຂົ້າໄຊ້ໄມໂຄໂຟນໄດ້",
        "description": "Description of the media permission description"
    },
    "mediaCameraPermissionsDescription": {
        "message": "ອະນຸຍາດໄຫ້ເຂົ້າໄຊ້ກ້ອງຖ່າຍຮູບໄດ້",
        "description": "Description of the media permission description"
    },
    "general": {
        "message": "ທົ່່ວໄປ",
        "description": "Header for general options on the settings screen"
    },
    "spellCheckDescription": {
        "message": "Enable spell check",
        "description": "Description of the spell check setting"
    },
    "spellCheckWillBeEnabled": {
        "message": "ກວດກາ ການສະແປວ ເພືອຈະບໍມີບັນຫາ ໂອການຫນ້າ ເມື່ອສີກຫນໍເລີມທຳງານ.",
        "description": "Shown when the user enables spellcheck to indicate that they must restart Signal."
    },
    "spellCheckWillBeDisabled": {
        "message": "ການກວດສອບ ການສະກົດຄຳຈະຖືກປິດໄຊ້ງານ ເວລາສີກຫນໍເລີມມີການເຊື່ອມຕໍ່",
        "description": "Shown when the user disables spellcheck to indicate that they must restart Signal."
    },
    "autoLaunchDescription": {
        "message": "Open at computer login",
        "description": "Description for the automatic launch setting"
    },
    "clearDataHeader": {
        "message": "ຈັດແຈ້ງຂໍ້ມູນດາຕ່າ",
        "description": "Header in the settings dialog for the section dealing with data deletion"
    },
    "clearDataExplanation": {
        "message": "This will clear all data in the application, removing all messages and saved account information.",
        "description": "Text describing what the clear data button will do."
    },
    "clearDataButton": {
        "message": "ຈັດແຈ້ງຂໍ້ມູນດາຕ່າ",
        "description": "Button in the settings dialog starting process to delete all data"
    },
    "deleteAllDataHeader": {
        "message": "ລົບຂໍ້ມູນດາຕ່າທັງໝົດບໍ?",
        "description": "Header of the full-screen delete data confirmation screen"
    },
    "deleteAllDataBody": {
        "message": "You are about to delete all of this application's saved account information, including all contacts and all messages. You can always link with your mobile device again, but that will not restore deleted messages.",
        "description": "Text describing what exactly will happen if the user clicks the button to delete all data"
    },
    "deleteAllDataButton": {
        "message": "ລົບຂໍ້ມູນດາຕ່າທັງໝົດ",
        "description": "Text of the button that deletes all data"
    },
    "deleteAllDataProgress": {
        "message": "ຈະບໍມີການເຊື່ອມຕໍ່ ແລະ ຂໍ້ມູນຈະຖືກລົບທັງໝົດ",
        "description": "Message shown to user when app is disconnected and data deleted"
    },
    "deleteOldIndexedDBData": {
        "message": "You have obsolete data from a prior installation of Signal Desktop. If you choose to continue, it will be deleted and you will start from scratch.",
        "description": "Shown if user last ran Signal Desktop before October 2018"
    },
    "deleteOldData": {
        "message": "ລົບຂໍ້ມູນດາຕ່າເກົ່າ",
        "description": "Button to make the delete happen"
    },
    "notifications": {
        "message": "ການແຈ້ງເຕືອນ",
        "description": "Header for notification settings"
    },
    "notificationSettingsDialog": {
        "message": "ເມືອມີຂໍ້ຄວາມເຂົ້າມາ ຈະສະແດງໄຫ້ເຫັນການແຈ້ງເຕືອນນັ້ນ",
        "description": "Explain the purpose of the notification settings"
    },
    "disableNotifications": {
        "message": "ປິດການແຈ້ງເຕືອນ",
        "description": "Label for disabling notifications"
    },
    "nameAndMessage": {
        "message": "ຊື່, ເນື້ອຫາ, ແລະ ການປະຕິບັດ",
        "description": "Label for setting notifications to display name and message text"
    },
    "noNameOrMessage": {
        "message": "ບໍ່ມີຊື່ ຫຼື ເນື້ອຫາ",
        "description": "Label for setting notifications to display no name and no message text"
    },
    "nameOnly": {
        "message": "ຊື່ເທົ່່ານັນ",
        "description": "Label for setting notifications to display sender name only"
    },
    "newMessage": {
        "message": "ຂໍ້ຄວາມໄໝ່",
        "description": "Displayed in notifications for only 1 message"
    },
    "notificationSenderInGroup": {
        "message": "$sender$ ໃນ $group$",
        "description": "Displayed in notifications for messages in a group",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "group": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            }
        }
    },
    "notificationReaction": {
        "message": "$sender$ ໂຕ້ຕອບ $emoji$ ໄນຂໍ້ຄວາມຂອງເຈົ້າ",
        "description": "",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "emoji": {
                "content": "$2",
                "example": "👍"
            }
        }
    },
    "notificationReactionMessage": {
        "message": "$sender$ ໂຕ້ຕອບ $emoji$ ເຖິງ $message$",
        "description": "",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "John"
            },
            "emoji": {
                "content": "$2",
                "example": "👍"
            },
            "message": {
                "content": "$3",
                "example": "Sounds good."
            }
        }
    },
    "sendFailed": {
        "message": "ການສົ່ງລົ້ມເຫລວ",
        "description": "Shown on outgoing message if it fails to send"
    },
    "sendPaused": {
        "message": "Send paused",
        "description": "Shown on outgoing message if it cannot be sent immediately"
    },
    "partiallySent": {
        "message": "ກົດສົ່ງບາງສວ່ນ ສຳລັບລາຍລະອຽດ",
        "description": "Shown on outgoing message if it is partially sent"
    },
    "showMore": {
        "message": "ລາຍອະອຽດ",
        "description": "Displays the details of a key change"
    },
    "showLess": {
        "message": "ຊ່ອນ ລາຍອະອຽດ",
        "description": "Hides the details of a key change"
    },
    "learnMore": {
        "message": "ຮຽນຮູ້ເພີມເຕີມ ກຽ່ວກັບ ການກວດສອບຄວາມປອດໄພ ຂອງເບີໂທ.",
        "description": "Text that links to a support article on verifying safety numbers"
    },
    "expiredWarning": {
        "message": "This version of Signal Desktop has expired. Please upgrade to the latest version to continue messaging.",
        "description": "Warning notification that this version of the app has expired"
    },
    "upgrade": {
        "message": "ການເພີມລະອັບ",
        "description": "Label text for button to upgrade the app to the latest version"
    },
    "mediaMessage": {
        "message": "ຂ່າວສານສື່ມວນຊົນ",
        "description": "Description of a message that has an attachment and no text, displayed in the conversation list as a preview."
    },
    "unregisteredUser": {
        "message": "ເບີບໍ່ໄດ້ລົງທະບຽນ",
        "description": "Error message displayed when sending to an unregistered user."
    },
    "sync": {
        "message": "ຕິດຕໍ່",
        "description": "Label for contact and group sync settings"
    },
    "syncExplanation": {
        "message": "ນຳເຂົ້າທັງໝົດ ກຸ່ມສີກຫນໍ ແລະ ການຕິດຕໍ່ ຈາກໂທລະສັບ ຂອງທ່ານ.",
        "description": "Explanatory text for sync settings"
    },
    "lastSynced": {
        "message": "ນຳເຂົ້າຜາຍຫຼັງ",
        "description": "Label for date and time of last sync operation"
    },
    "syncNow": {
        "message": "ນຳເຂົ້າດຽ່ວນີ",
        "description": "Label for a button that syncs contacts and groups from your phone"
    },
    "syncing": {
        "message": "ກຳລັງນຳເຂົ້າ...",
        "description": "Label for a disabled sync button while sync is in progress."
    },
    "syncFailed": {
        "message": "ການນຳເຂົ້າມີບັນຫາ. ຕ້ອງແນ່ໄຈວາ ຄອມພີວເຕີຂອງທ່ານ ແລະ ໂທລະສັບ ຂອງທ່ານໄດ້ ເຊື່ອມຕໍ່ກັບ ອີນເຕີເນັດ.",
        "description": "Informational text displayed if a sync operation times out."
    },
    "timestamp_s": {
        "message": "ດຽວນີ້",
        "description": "Brief timestamp for messages sent less than a minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_m": {
        "message": "ນາທີ 1",
        "description": "Brief timestamp for messages sent about one minute ago. Displayed in the conversation list and message bubble."
    },
    "timestamp_h": {
        "message": "ຊົ່ວໂມງ 1",
        "description": "Brief timestamp for messages sent about one hour ago. Displayed in the conversation list and message bubble."
    },
    "hoursAgo": {
        "message": "ຊົ່ວໂມງ 1$hours$",
        "description": "Contracted form of 'X hours ago' which works both for singular and plural",
        "placeholders": {
            "hours": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "minutesAgo": {
        "message": "ນາທີ $minutes$",
        "description": "Contracted form of 'X minutes ago' which works both for singular and plural",
        "placeholders": {
            "minutes": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "justNow": {
        "message": "ດຽວນີ້",
        "description": "Shown if a message is very recent, less than 60 seconds old"
    },
    "timestampFormat_M": {
        "message": "ວັນທີ ເດືອນ ປີ",
        "description": "Timestamp format string for displaying month and day (but not the year) of a date within the current year, ex: use 'MMM D' for 'Aug 8', or 'D MMM' for '8 Aug'."
    },
    "messageBodyTooLong": {
        "message": "ໂຄງຮ່າງຂໍ້ຄວາມຍາວເກີນໄປ",
        "description": "Shown if the user tries to send more than 64kb of text"
    },
    "unblockToSend": {
        "message": "ຂໍ້ຄວາມທີຕິດຕໍ່ສົ່ງນີ້ບໍຕ້ອງລອ໋ກ",
        "description": "Brief message shown when trying to message a blocked number"
    },
    "unblockGroupToSend": {
        "message": "ກຸ່ມຂໍ້ຄວາມທີສົ່ງນີ້ບໍຕ້ອງລອ໋ກ",
        "description": "Brief message shown when trying to message a blocked group"
    },
    "youChangedTheTimer": {
        "message": "$time$ ເວລາທີເຈົ້າຕິດຕັ້ງຂໍ້ຄວາມກຳລັງຫາຍໄປ",
        "description": "Message displayed when you change the message expiration timer in a conversation.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetOnSync": {
        "message": "$time$ ເວລາທີແກ້ໄຂຂໍ້ຄວາມທີກຳລັງຫາຍໄປ",
        "description": "Message displayed when timer is set on initial link of desktop device.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "timerSetByMember": {
        "message": "$time$ ເວລາທີແກ້ໄຂຂໍ້ຄວາມການຕິດຕັ້ງສຳມະຊິກທີກຳລັງຫາຍໄປ",
        "description": "Message displayed when timer is by an unknown group member.",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "10m"
            }
        }
    },
    "theyChangedTheTimer": {
        "message": "$name$ ເວລາການຕິດຕັ້ງຂໍ້ຄວາມກຳລັງຫາຍໄປ $time$",
        "description": "Message displayed when someone else changes the message expiration timer in a conversation.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            },
            "time": {
                "content": "$2",
                "example": "10m"
            }
        }
    },
    "disappearingMessages__off": {
        "message": "ປິດ",
        "description": "Label for option to turn off message expiration in the timer menu"
    },
    "disappearingMessages": {
        "message": "ຂໍ້ຄວາມທີຫາຍໄປ",
        "description": "Conversation menu option to enable disappearing messages. Title of the settings section for Disappearing Messages"
    },
    "disappearingMessagesDisabled": {
        "message": "ປີດການໄຊ້ງານຂໍ້ຄວາມທີຫາຍໄປ",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disappearingMessagesDisabledByMember": {
        "message": "ປິດການໄຊ້ງານຂໍ້ຄວາມສຳມະຊີກທີຫາຍໄປ",
        "description": "Displayed in the left pane when the timer is turned off"
    },
    "disabledDisappearingMessages": {
        "message": "1$name$ ປິດການໄຊ້ງານຂໍ້ຄວາມທີຫາຍໄປ",
        "description": "Displayed in the conversation list when the timer is turned off",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "youDisabledDisappearingMessages": {
        "message": "ປີດການໄຊ້ງານຂໍ້ຄວາມຂອງທ່ານທີຫາຍໄປ",
        "description": "Displayed in the conversation list when the timer is turned off"
    },
    "timerSetTo": {
        "message": "ຕິດຕັ້ງກຳຫນົດເວລາ $time$",
        "description": "Displayed in the conversation list when the timer is updated by some automatic action, or in the left pane",
        "placeholders": {
            "time": {
                "content": "$1",
                "example": "1w"
            }
        }
    },
    "audioNotificationDescription": {
        "message": "ແຈ້ງເຕືອນການຫລີ່ນສຽງ",
        "description": "Description for audio notification setting"
    },
    "callRingtoneNotificationDescription": {
        "message": "ຫລີ່ນສຽງທີກຳລັງໂທ",
        "description": "Description for call ringtone notification setting"
    },
    "callSystemNotificationDescription": {
        "message": "ສະແດງການແຈ້ງເຕືອນສຳລັບໂທ",
        "description": "Description for call notification setting"
    },
    "incomingCallNotificationDescription": {
        "message": "ເປີດໄຊ້ການໂທຫາລາຍໄດ້",
        "description": "Description for incoming calls setting"
    },
    "contactChangedProfileName": {
        "message": "$sender$ ຈາກການປຽ່ນຊື່ຮູບຫນ້າປົກຂອງເຂົາເຈົ້າ $oldProfile$ ເຖິງ $newProfile$",
        "description": "Description for incoming calls setting",
        "placeholders": {
            "sender": {
                "content": "$1",
                "example": "Bob"
            },
            "oldProfile": {
                "content": "$2",
                "example": ".x8Skillz8x."
            },
            "newProfile": {
                "content": "$3",
                "example": "Bob Smith"
            }
        }
    },
    "changedProfileName": {
        "message": " $oldProfile$ ປຽ່ນຊື່ຮູບຫນ້າປົກຂອງເຂົາເຈົ້າເຖີງ $newProfile$",
        "description": "Shown when a contact not in your address book changes their profile name",
        "placeholders": {
            "oldProfile": {
                "content": "$2",
                "example": ".x8Skillz8x."
            },
            "newProfile": {
                "content": "$3",
                "example": "Bob Smith"
            }
        }
    },
    "safetyNumberChanged": {
        "message": "ການປຽ່ນເບີຈະມີຄວາມປອດໄພ",
        "description": "A notification shown in the conversation when a contact reinstalls"
    },
    "safetyNumberChanges": {
        "message": "ເບີທີປຽ່ນໄດ້ຮັບຄວາມປອດໄພ",
        "description": "Title for safety number changed modal"
    },
    "safetyNumberChangedGroup": {
        "message": "ມີການປຽ່ນແປງ $name$ ກັບເບີມີຄວາມປອດໄພ ",
        "description": "A notification shown in a group conversation when a contact reinstalls, showing the contact name",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "verifyNewNumber": {
        "message": "ທົດລອງຄວາມປອດໄພຂອງເບີ",
        "description": "Label on button included with safety number change notification in the conversation"
    },
    "cannotGenerateSafetyNumber": {
        "message": "This user can't be verified until you've exchanged messages with them.",
        "description": "Shown on the safety number screen if you have never exchanged messages with that contact"
    },
    "yourSafetyNumberWith": {
        "message": "ເບີຂອງທ່ານມີຄວາມປອດກັບ $name1$",
        "description": "Heading for safety number view",
        "placeholders": {
            "name1": {
                "content": "$1",
                "example": "John"
            }
        }
    },
    "themeLight": {
        "message": "ແສງສະວ່າງ",
        "description": "Label text for light theme (normal)"
    },
    "themeDark": {
        "message": "ມືດດຳ",
        "description": "Label text for dark theme"
    },
    "themeSystem": {
        "message": "ລະບົບ",
        "description": "Label text for system theme"
    },
    "noteToSelf": {
        "message": "ບັນທຶກສວ່ນຕົວ",
        "description": "Name for the conversation with your own phone number"
    },
    "noteToSelfHero": {
        "message": "You can add notes for yourself in this conversation. If your account has any linked devices, new notes will be synced.",
        "description": "Description for the Note to Self conversation"
    },
    "notificationDrawAttention": {
        "message": "Draw attention to this window when a notification arrives",
        "description": "Label text for the setting that controls whether new notifications draw attention to the window"
    },
    "hideMenuBar": {
        "message": "ເຊື່ອງເມນູບາ",
        "description": "Label text for menu bar visibility setting"
    },
    "startConversation": {
        "message": "ເລີມການສົນທະນາໄໝ່",
        "description": "Label underneath number a user enters that is not an existing contact"
    },
    "newConversation": {
        "message": "New conversation",
        "description": "Label for header when starting a new conversation"
    },
    "contactSearchPlaceholder": {
        "message": "Search by name or phone number",
        "description": "Placeholder to use when searching for contacts in the composer"
    },
    "noContactsFound": {
        "message": "No contacts found",
        "description": "Label shown when there are no contacts to compose to"
    },
    "noConversationsFound": {
        "message": "No conversations found",
        "description": "Label shown when there are no conversations to compose to"
    },
    "chooseGroupMembers__title": {
        "message": "Choose members",
        "description": "The title for the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__back-button": {
        "message": "ກັບຫຼັງ",
        "description": "Used as alt-text of the back button on the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__skip": {
        "message": "Skip",
        "description": "The 'skip' button text in the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__next": {
        "message": "ຕໍ່ໄປ",
        "description": "The 'next' button text in the 'choose group members' left pane screen"
    },
    "chooseGroupMembers__maximum-group-size__title": {
        "message": "Maximum group size reached",
        "description": "Shown in the alert when you add the maximum number of group members"
    },
    "chooseGroupMembers__maximum-group-size__body": {
        "message": "Signal groups can have a maximum of $max$ members.",
        "description": "Shown in the alert when you add the maximum number of group members",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "1000"
            }
        }
    },
    "chooseGroupMembers__maximum-recommended-group-size__title": {
        "message": "Recommended member limit reached",
        "description": "Shown in the alert when you add the maximum recommended number of group members"
    },
    "chooseGroupMembers__maximum-recommended-group-size__body": {
        "message": "Signal groups perform best with $max$ members or less. Adding more members will cause delays sending and receiving messages.",
        "description": "Shown in the alert when you add the maximum recommended number of group members",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "150"
            }
        }
    },
    "chooseGroupMembers__cant-add-member__title": {
        "message": "Can’t add member",
        "description": "Shown in the alert when you try to add someone who can't be added to a group"
    },
    "chooseGroupMembers__cant-add-member__body": {
        "message": "\"$name$\" can’t be added to the group because they’re using an old version of Signal. You can add them to the group after they’ve updated Signal.",
        "description": "Shown in the alert when you try to add someone who can't be added to a group",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "setGroupMetadata__title": {
        "message": "Name this group",
        "description": "The title for the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__back-button": {
        "message": "Back to member selection",
        "description": "Used as alt-text of the back button on the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__group-name-placeholder": {
        "message": "Group name (required)",
        "description": "The placeholder for the group name placeholder"
    },
    "setGroupMetadata__group-description-placeholder": {
        "message": "Description",
        "description": "The placeholder for the group description"
    },
    "setGroupMetadata__create-group": {
        "message": "Create",
        "description": "The 'create group' button text in the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__members-header": {
        "message": "Members",
        "description": "The header for the members list in the 'set group metadata' left pane screen"
    },
    "setGroupMetadata__error-message": {
        "message": "This group couldn’t be created. Check your connection and try again.",
        "description": "Shown in the modal when we can't create a group"
    },
    "updateGroupAttributes__title": {
        "message": "Edit group",
        "description": "Shown in the modal when we want to update a group"
    },
    "updateGroupAttributes__error-message": {
        "message": "Failed to update the group. Check your connection and try again.",
        "description": "Shown in the modal when we can't update a group"
    },
    "notSupportedSMS": {
        "message": "SMS/MMS ບໍ່ໄດ້ສະຫນັບສະຫນູນຂໍ້ຄວາມ.",
        "description": "Label underneath number informing user that SMS is not supported on desktop"
    },
    "newPhoneNumber": {
        "message": "ຕິດຕໍ່ເພີມຂໍ້ມູນເຕີມເຂົ້າໄປໝາຍເລກໂທສັບ",
        "description": "Placeholder for adding a new number to a contact"
    },
    "invalidNumberError": {
        "message": "ເບີບໍ່ຖືກຕ້ອງ",
        "description": "When a person inputs a number that is invalid"
    },
    "unlinkedWarning": {
        "message": "ກັບຄືນລີ້ງ ສີກຫນໍແດັດທັອບ ມືຖືຂອງທ່ານ ແບ່ງສ່ວນ ທີສືບຕໍ່ຂໍ້ຄວາມ.",
        "description": ""
    },
    "unlinked": {
        "message": "ບໍ່ເຊື່ອມໂຍງ",
        "description": ""
    },
    "relink": {
        "message": "ກັບຄືນ",
        "description": ""
    },
    "autoUpdateNewVersionTitle": {
        "message": "ສີກຫນໍມີການອັບເດດ",
        "description": ""
    },
    "autoUpdateNewVersionMessage": {
        "message": "ສີກຫນໍມີສັນຍາລັກລຸ້ນໄໝ່ທີ່ມີຢູ່",
        "description": ""
    },
    "autoUpdateNewVersionInstructions": {
        "message": "ກົດປິດເປີດ ການຕອບຮັບ ສີກຫນໍ ເພືອການອັບແດັດ.",
        "description": ""
    },
    "autoUpdateRestartButtonLabel": {
        "message": "ປິດເປິດເຄືອງສີກຫນໍໄໝ່",
        "description": ""
    },
    "autoUpdateLaterButtonLabel": {
        "message": "ທີຫຼັງ",
        "description": ""
    },
    "leftTheGroup": {
        "message": "$name$ ອອກຈາກກຸ່ມ",
        "description": "Shown in the conversation history when a single person leaves the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "multipleLeftTheGroup": {
        "message": "$name$ ອອກຈາກກຸ່ມ",
        "description": "Shown in the conversation history when multiple people leave the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "updatedTheGroup": {
        "message": "$name$ ອັບເດດກຸ່ມ",
        "description": "Shown in the conversation history when someone updates the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "youUpdatedTheGroup": {
        "message": "ອັບເດດກຸ່ມຂອງທ່ານ",
        "description": "Shown in the conversation history when you update a group"
    },
    "updatedGroupAvatar": {
        "message": "ອັບເດດເມືອມີບາງຄົນໄນກຸ່ມ",
        "description": "Shown in the conversation history when someone updates the group"
    },
    "titleIsNow": {
        "message": "ຊື່ກຸ່ມປະຈຸບັນ $name$",
        "description": "Shown in the conversation history when someone changes the title of the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Book Club"
            }
        }
    },
    "youJoinedTheGroup": {
        "message": "ທ່ານໄດ້ເຂົ້າຮ່ວມກຸ່ມ",
        "description": "Shown in the conversation history when you are added to a group."
    },
    "joinedTheGroup": {
        "message": "$name$ ເຂົ້າຮ່ວມກຸ່ມ",
        "description": "Shown in the conversation history when a single person joins the group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "multipleJoinedTheGroup": {
        "message": "$names$ ເຂົ້າຮ່ວມກຸ່ມ",
        "description": "Shown in the conversation history when more than one person joins the group",
        "placeholders": {
            "names": {
                "content": "$1",
                "example": "Alice, Bob"
            }
        }
    },
    "ConversationListItem--message-request": {
        "message": "ການຮຽກຮ້ອງຂໍ້ຄວາມ",
        "description": "Preview shown for conversation if the user has not yet accepted an incoming message request"
    },
    "ConversationListItem--draft-prefix": {
        "message": "ຊອງວ່າງ",
        "description": "Prefix shown in italic in conversation view when a draft is saved"
    },
    "message--getNotificationText--gif": {
        "message": "ພາບເຄືອນໄຫວ",
        "description": "Shown in notifications and in the left pane when a GIF is received."
    },
    "message--getNotificationText--photo": {
        "message": "ຮູບພາບ",
        "description": "Shown in notifications and in the left pane when a photo is received."
    },
    "message--getNotificationText--video": {
        "message": "ວີດີໂອ",
        "description": "Shown in notifications and in the left pane when a video is received."
    },
    "message--getNotificationText--voice-message": {
        "message": "ຂໍ້ຄວາມສຽງ",
        "description": "Shown in notifications and in the left pane when a voice message is received."
    },
    "message--getNotificationText--audio-message": {
        "message": "ສຽງຂໍ້ຄວາມ",
        "description": "Shown in notifications and in the left pane when an audio message is received."
    },
    "message--getNotificationText--file": {
        "message": "ແຟ້ມ",
        "description": "Shown in notifications and in the left pane when a generic file is received."
    },
    "message--getNotificationText--stickers": {
        "message": "ຂໍ້ຄວາມສະຕີກເກີ",
        "description": "Shown in notifications and in the left pane instead of sticker image."
    },
    "message--getNotificationText--text-with-emoji": {
        "message": "$emoji$ $text$",
        "description": "Shown in notifications and in the left pane when text has an emoji. Probably always [emoji] [text] on LTR languages and [text] [emoji] on RTL languages.",
        "placeholders": {
            "emoji": {
                "content": "$1",
                "example": "📷"
            },
            "text": {
                "content": "$2",
                "example": "Photo"
            }
        }
    },
    "message--getDescription--unsupported-message": {
        "message": "ຂໍ້ຄວາມບໍໄດ້ຮັບຮ້ອງການສະນັບສະຫນູນ",
        "description": "Shown in notifications and in the left pane when a message has features too new for this signal install."
    },
    "message--getDescription--disappearing-media": {
        "message": "ເບິງສື່ມວນຊົນຄືນອີກຄັ້ງຫນື່ງ",
        "description": "Shown in notifications and in the left pane after view-once message is deleted. Also shown when quoting a view once media."
    },
    "message--getDescription--disappearing-photo": {
        "message": "ເບີງຮູບພາບຄືນອີກຄັ້ງຫນື່ງ",
        "description": "Shown in notifications and in the left pane when a message is a view once photo. Also shown when quoting a view once photo."
    },
    "message--getDescription--disappearing-video": {
        "message": "ເບີງວິດີໂອຄືນອີກຄັ້ງຫນື່ງ",
        "description": "Shown in notifications and in the left pane when a message is a view once video. Also shown when quoting a view once video."
    },
    "message--deletedForEveryone": {
        "message": "ຂໍ້ຄວາມນີ້ຖືກລົບແລ້ວ",
        "description": "Shown in a message's bubble when the message has been deleted for everyone."
    },
    "stickers--toast--InstallFailed": {
        "message": "ບໍສາມາດຕິດຕັ້ງ ຊອງສະຕິກເກີໄດ້",
        "description": "Shown in a toast if the user attempts to install a sticker pack and it fails"
    },
    "stickers--StickerManager--InstalledPacks": {
        "message": "ການຕິດຕັ້ງສະຕິກເກີ",
        "description": "Shown in the sticker pack manager above your installed sticker packs."
    },
    "stickers--StickerManager--InstalledPacks--Empty": {
        "message": "ບໍ່ມີການຕິດຕັ້ງສະຕິກເກີ",
        "description": "Shown in the sticker pack manager when you don't have any installed sticker packs."
    },
    "stickers--StickerManager--BlessedPacks": {
        "message": "ຊຸດສີລະປີນຂອງສີກຫນໍ",
        "description": "Shown in the sticker pack manager above the default sticker packs."
    },
    "stickers--StickerManager--BlessedPacks--Empty": {
        "message": "ບໍມີນັກສ້າງພາບສະຕີກເກີຂອງສີກຫນໍ",
        "description": "Shown in the sticker pack manager when there are no blessed sticker packs available."
    },
    "stickers--StickerManager--ReceivedPacks": {
        "message": "ສະຕີກເກີທີທ່ານໄດ້ຮັບ",
        "description": "Shown in the sticker pack manager above sticker packs which you have received in messages."
    },
    "stickers--StickerManager--ReceivedPacks--Empty": {
        "message": "ລາຍໄດ້ຈາກ ຂໍ້ຄວາມສະເຕິເກີ ຈະຕອບກັບຢູ່ທີນີ້",
        "description": "Shown in the sticker pack manager when you have not received any sticker packs in messages."
    },
    "stickers--StickerManager--Install": {
        "message": "ຕິດຕັ້ງ",
        "description": "Shown in the sticker pack manager next to sticker packs which can be installed."
    },
    "stickers--StickerManager--Uninstall": {
        "message": "ບໍມີການຕິດຕັ້ງ",
        "description": "Shown in the sticker pack manager next to sticker packs which are already installed."
    },
    "stickers--StickerManager--UninstallWarning": {
        "message": "You may not be able to re-install this sticker pack if you no longer have the source message.",
        "description": "Shown in the sticker pack manager next to sticker packs which are already installed."
    },
    "stickers--StickerManager--Introduction--Image": {
        "message": "ແນະນຳສະຕີກເກີ; ແບນດິດ ແມ້ວ",
        "description": "Alt text on a tooltip image when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerManager--Introduction--Title": {
        "message": "ກຳລັງແນະນຳສະຕີກເກີ",
        "description": "Shown as the title on a tooltip when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerManager--Introduction--Body": {
        "message": "ເປັນຫຍັງຈື່ງໄຊ້ຄຳເມືອທ່ານນຳໄຊ້ສະຕີກເກີ ?",
        "description": "Shown as the body on a tooltip when the user upgrades to a version of Signal supporting stickers."
    },
    "stickers--StickerPicker--Open": {
        "message": "ເປີດນຳໄຊ້ສະຕິກເກີ",
        "description": "Label for the open button for the sticker picker"
    },
    "stickers--StickerPicker--AddPack": {
        "message": "ເພີມຊອງສະຕີກເກີ",
        "description": "Label for the add pack button in the sticker picker"
    },
    "stickers--StickerPicker--NextPage": {
        "message": "ຫນ້າຕໍ່ໄປ",
        "description": "Label for the next page button in the sticker picker"
    },
    "stickers--StickerPicker--PrevPage": {
        "message": "ຫນ້າກ່ອນຫນ້ານີ້",
        "description": "Label for the previous page button in the sticker picker"
    },
    "stickers--StickerPicker--Recents": {
        "message": "ສະຕີກເກີທີ່ຜ່ານມາ",
        "description": "Label for the recent stickers button in the sticker picker"
    },
    "stickers--StickerPicker--DownloadError": {
        "message": "ສະຕີກເກີບາງອັນຈະບໍໄດ້ດາວໂລດ",
        "description": "Shown in the sticker picker when one or more stickers could not be downloaded."
    },
    "stickers--StickerPicker--DownloadPending": {
        "message": "ກຳລັງຕິດຕັ້ງຊອງສະຕິກເກີ...",
        "description": "Shown in the sticker picker when one or more stickers are still downloading."
    },
    "stickers--StickerPicker--Empty": {
        "message": "ບໍ່ພົບສະຕີກເກີ",
        "description": "Shown in the sticker picker when there are no stickers to show."
    },
    "stickers--StickerPicker--Hint": {
        "message": "ຊອງສະຕີກເກີຂອງທ່ານໄດ້ມີການຕິດຕັ້ງໄໝ່",
        "description": "Shown in the sticker picker the first time you have received new packs you can install."
    },
    "stickers--StickerPicker--NoPacks": {
        "message": "ບໍ່ພົບຊອງສະຕີກເກີ",
        "description": "Shown in the sticker picker when there are no installed sticker packs."
    },
    "stickers--StickerPicker--NoRecents": {
        "message": "ສະຕິກເກີໄຊ້ ທີຜ່ານມາ ຈະປະກົດຢູ່ບ່ອນນີ້.",
        "description": "Shown in the sticker picker when there are no recent stickers to show."
    },
    "stickers--StickerPreview--Title": {
        "message": "ຊອງສະຕີກເກີ",
        "description": "The title that appears in the sticker pack preview modal."
    },
    "stickers--StickerPreview--Error": {
        "message": "ເປິດຊອງສະຕິກເກີ ມີຄວາມຜີດພາດ. ກວດເບີງການເຊືອມຕໍ່ ອີນເຕີເນັດ ແລະ ລອງໄຫມ່ອີກຄັ້ງ. ",
        "description": "The message that appears in the sticker preview modal when there is an error."
    },
    "EmojiPicker--empty": {
        "message": "ບໍ່ພົບກະຕູນອີໂມຈິ",
        "description": "Shown in the emoji picker when a search yields 0 results."
    },
    "EmojiPicker--search-placeholder": {
        "message": "ຄົ້ນຫາສະຕູນອີໂມຈິ",
        "description": "Shown as a placeholder inside the emoji picker search field."
    },
    "EmojiPicker--skin-tone": {
        "message": "ໂຕນສຳຜັດຫນ້າປຸ່ມ $tone$",
        "description": "Shown as a tooltip over the emoji tone buttons.",
        "placeholders": {
            "status": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "EmojiPicker__button--recents": {
        "message": "ປຸ່ມກົດ ອີໂມຈີ",
        "description": "Label for recents emoji picker button"
    },
    "EmojiPicker__button--emoji": {
        "message": "ກະຕູນອີໂມຈີ",
        "description": "Label for emoji emoji picker button"
    },
    "EmojiPicker__button--animal": {
        "message": "ສັດ",
        "description": "Label for animal emoji picker button"
    },
    "EmojiPicker__button--food": {
        "message": "ອານຫານ",
        "description": "Label for food emoji picker button"
    },
    "EmojiPicker__button--activity": {
        "message": "ກິດຈະກຳ",
        "description": "Label for activity emoji picker button"
    },
    "EmojiPicker__button--travel": {
        "message": "ທ່ອງທຽ່ວ",
        "description": "Label for travel emoji picker button"
    },
    "EmojiPicker__button--object": {
        "message": "ຈຸປະສົ່ງ",
        "description": "Label for object emoji picker button"
    },
    "EmojiPicker__button--symbol": {
        "message": "ສັນຍາລັກ",
        "description": "Label for symbol emoji picker button"
    },
    "EmojiPicker__button--flag": {
        "message": "ທຸງ",
        "description": "Label for flag emoji picker button"
    },
    "confirmation-dialog--Cancel": {
        "message": "ຍົກເລີກ",
        "description": "Appears on the cancel button in confirmation dialogs."
    },
    "Message--unsupported-message": {
        "message": "$contact$ sent you a message that can't be processed or displayed because it uses a new Signal feature.",
        "description": "",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "Message--unsupported-message-ask-to-resend": {
        "message": "ທ່ານສາມາສອບຖາມ $contact$ ໄນການສົ່ງຕໍ່ ຂໍ້ຄວາມນີ້ ທ່າານສາມາດໄຊ້ ການອັບເດດ ສະບັບ ຂອງສີກຫນໍ.",
        "description": "",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "Message--from-me-unsupported-message": {
        "message": "One of your devices sent a message that can't be processed or displayed because it uses a new Signal feature.",
        "description": ""
    },
    "Message--from-me-unsupported-message-ask-to-resend": {
        "message": "Future messages like this will be synchronized now that you are using an up-to-date version of Signal.",
        "description": ""
    },
    "Message--update-signal": {
        "message": "ອັບເດດສິກຫນໍ",
        "description": "Text for a button which will take user to Signal download page"
    },
    "Message--tap-to-view-expired": {
        "message": "ເບີງແລ້ວ",
        "description": "Text shown on messages with with individual timers, after user has viewed it"
    },
    "Message--tap-to-view--outgoing": {
        "message": "ຫ້ອງອັດສຽງ",
        "description": "Text shown on outgoing messages with with individual timers (inaccessible)"
    },
    "Message--tap-to-view--incoming--expired-toast": {
        "message": "ທ່ານໄດ້ອ່ານຂໍ້ຄວາມນີ້ແລ້ວ",
        "description": "Shown when user clicks on an expired incoming view-once bubble"
    },
    "Message--tap-to-view--outgoing--expired-toast": {
        "message": "ເບີ່ງຂໍ້ຄວາມຄັ້ງດຽ່ວ ບໍ່ແມ່ນເລື່ອງທີຢູ່ໄນ ການສົນທະນາ ຂອງທ່ານ ທີເປັນປະຫວັດສາດ.",
        "description": "Shown when user clicks on an expired outgoing view-once bubble"
    },
    "Message--tap-to-view--incoming": {
        "message": "ເບີງຮູບພາບ",
        "description": "Text shown on photo messages with with individual timers, before user has viewed it"
    },
    "Message--tap-to-view--incoming-video": {
        "message": "ເບີງວີດີໂອ",
        "description": "Text shown on video messages with with individual timers, before user has viewed it"
    },
    "Conversation--getDraftPreview--attachment": {
        "message": "ການຕີດຕັ້ງ",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Conversation--getDraftPreview--quote": {
        "message": "ອ້າງອີງ",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Conversation--getDraftPreview--draft": {
        "message": "ຊອງວ່າງ",
        "description": "Text shown in left pane as preview for conversation with saved a saved draft message"
    },
    "Keyboard--navigate-by-section": {
        "message": "ຫານເສັ້ນທາງ ຂອງແຕ່ລະສ່ວນ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--previous-conversation": {
        "message": "ການສົນທະນາທີຜ່ານມາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--next-conversation": {
        "message": "ການສົນທະນາຕໍ່ໄປ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--previous-unread-conversation": {
        "message": "ບໍ່ໄດ້ອ່ານການສົນທະນາທີຜ່ານມາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--next-unread-conversation": {
        "message": "ບໍ່ອ່ານການສົນທະນາຕໍ່ໄປ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--preferences": {
        "message": "ການຕັ້ງຄ່າ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-conversation-menu": {
        "message": "ເປີດເມຫນູສົນທະນາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--new-conversation": {
        "message": "Start new conversation",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--archive-conversation": {
        "message": "ຮອບຮ່ວມການສົນທະນາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--unarchive-conversation": {
        "message": "ບໍ່ຮອບຮ່ວມການສົນທະນາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--search": {
        "message": "ຄົ້ນຫາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--search-in-conversation": {
        "message": "ຄົ້ນຫາໄນການສົນທະນາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--focus-composer": {
        "message": "ສຸມໄສ່ ຂີ່ລັດ ສອດຄາດ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-all-media-view": {
        "message": "ເປີດເບີງສື່ທັງໝົດ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-emoji-chooser": {
        "message": "ເປີດເລືອກກະຕູນອີໂມຈີ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--open-sticker-chooser": {
        "message": "ເປີດເລືອກສະຕິກເກີ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--begin-recording-voice-note": {
        "message": "ເລີ່ມຕົ້ນການບັນທຶກສຽງ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--default-message-action": {
        "message": "ເລືອກຂໍ້ຄວາມ ການປະຕິບັດ ໄນເບືອງຕົນ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--view-details-for-selected-message": {
        "message": "ເລືອກເບີງຂໍ້ຄວາມທີມີເນື້ອຫາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-reply": {
        "message": "ເລືອກສະຫຼັບການຕອບຂໍ້ຄວາມ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-reaction-picker": {
        "message": "Toggle emoji-ການຈັບຫົວຂໍ ຂໍ້ຄວາມທີເລືອກ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--save-attachment": {
        "message": "ເລືອກເຊັບ ຂໍ້ຄວາມຈາກ ການພູກພັນ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--delete-message": {
        "message": "ເລືອກລົບຂໍ້ຄວາມ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--add-newline": {
        "message": "ເພີມເນື້ອທີຂໍ້ຄວາມໄໝ່",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--expand-composer": {
        "message": "ຂະຫຍາຍ ຂີ່ລັດ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--send-in-expanded-composer": {
        "message": "ສົ່ງ(ໄນການຂະຫຍາຍ ຂີ່ລັດ)",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--attach-file": {
        "message": "ຕີດຕັ້ງໄຟຮ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--remove-draft-link-preview": {
        "message": "ຍ້າຍຮູບຮ່າງລີງ ທີເປັນຕົວຢ່າງ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--remove-draft-attachments": {
        "message": "ຍ້າຍຮູບຮ່າງ ທັງໝົດ ທີສະແດງໄນ ສອດຄາດ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--conversation-by-index": {
        "message": "ຂ້າມໄປ ການສົນທະນາ",
        "description": "A shortcut allowing direct navigation to conversations 1 to 9 in list"
    },
    "Keyboard--Key--ctrl": {
        "message": "ຄອນໂທຣ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--option": {
        "message": "ທາງເລືອກ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--alt": {
        "message": "ຂີ່ສະແດງໄນ ສອດຄາດ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--shift": {
        "message": "ປຸມຊິບທ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--enter": {
        "message": "ປຸມອີນເຕິ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--tab": {
        "message": "ປຸມເທບ",
        "description": "Key shown in shortcut combination in shortcuts guide"
    },
    "Keyboard--Key--one-to-nine-range": {
        "message": "1 ເຖີງ 9",
        "description": "Expresses that 1, 2, 3, up to 9 are available shortcut keys"
    },
    "Keyboard--header": {
        "message": "ຂີ່ບອດທາງລັດ",
        "description": "Title header of the keyboard shortcuts guide"
    },
    "Keyboard--navigation-header": {
        "message": "ແນວທາງ",
        "description": "Header of the keyboard shortcuts guide - navigation section"
    },
    "Keyboard--messages-header": {
        "message": "ຂໍ້ຄວາມ",
        "description": "Header of the keyboard shortcuts guide - messages section"
    },
    "Keyboard--composer-header": {
        "message": "ຂີ່ລັດ ສອດຄາດ",
        "description": "Header of the keyboard shortcuts guide - composer section"
    },
    "Keyboard--scroll-to-top": {
        "message": "ເລື່ອນຂື້ນທາງ ເທີງຂອງລາຍຊື່",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--scroll-to-bottom": {
        "message": "ເລື່ອນລົງທາງ ລຸ່ມຂອງລາຍຊື່",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--close-curent-conversation": {
        "message": "ປິດກະແສ ການສົນທະນາ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--calling-header": {
        "message": "ກຳລັງໂທ",
        "description": "Header of the keyboard shortcuts guide - calling section"
    },
    "Keyboard--toggle-audio": {
        "message": "ປິດເປິດແລະປິດ",
        "description": "Shown in the shortcuts guide"
    },
    "Keyboard--toggle-video": {
        "message": "ປິດເປິດ ວິດີໂອ ແລະ ປິດ",
        "description": "Shown in the shortcuts guide"
    },
    "close-popup": {
        "message": "ປິດການເດັ້ງຂື້ນ",
        "description": "Used as alt text for any button closing a popup"
    },
    "add-image-attachment": {
        "message": "ເພີ່ມການ ຕີດຕັ້ງຮູບພາບ",
        "description": "Used in draft attachment list for the big 'add new attachment' button"
    },
    "remove-attachment": {
        "message": "ຍ້າຍການ ການຕິດຕັ້ງ",
        "description": "Used in draft attachment list to remove an individual attachment"
    },
    "backToInbox": {
        "message": "ກັບໄປທີ ອີນບອ໋ກ",
        "description": "Used as alt-text of button on archived conversations screen"
    },
    "conversationArchived": {
        "message": "ການສົນທະນາ ທີເຂົ້າມາ",
        "description": "A toast that shows up when user archives a conversation"
    },
    "conversationReturnedToInbox": {
        "message": "ສົງການສົນທະນາ ໄປທີອີນບອ໋ກ",
        "description": "A toast that shows up when the user unarchives a conversation"
    },
    "conversationMarkedUnread": {
        "message": "ການສົນທະນາ ໝາຍ ວ່າຍັງບໍ່ໄດ້ອ່ານ",
        "description": "A toast that shows up when user marks a conversation as unread"
    },
    "StickerCreator--title": {
        "message": "ການສ້າງສະຕີກເກີພິເສດ",
        "description": "The title of the Sticker Pack Creator window"
    },
    "StickerCreator--DropZone--staticText": {
        "message": "ກົດເພີ່ມຫລືລົງ ຮູບພາບຢູ່ບ່ອນນີ້",
        "description": "Text which appears on the Sticker Creator drop zone when there is no active drag"
    },
    "StickerCreator--DropZone--activeText": {
        "message": "ວາງພາບລົງທີນີ້",
        "description": "Text which appears on the Sticker Creator drop zone when there is an active drag"
    },
    "StickerCreator--Preview--title": {
        "message": "ຊອງສະຕີກເກີ",
        "description": "The 'title' of the sticker pack preview 'modal'"
    },
    "StickerCreator--ConfirmDialog--cancel": {
        "message": "ຍົກເລີກ",
        "description": "The default text for the confirm dialog cancel button"
    },
    "StickerCreator--CopyText--button": {
        "message": "ກອບປີ້",
        "description": "The text which appears on the copy button for the sticker creator share screen"
    },
    "StickerCreator--ShareButtons--facebook": {
        "message": "ເຟດບຸກ",
        "description": "Title for Facebook button"
    },
    "StickerCreator--ShareButtons--twitter": {
        "message": "ທະວິດເຕີ",
        "description": "Title for Twitter button"
    },
    "StickerCreator--ShareButtons--pinterest": {
        "message": "ປີນເຕີເລຣທ",
        "description": "Title for Pinterest button"
    },
    "StickerCreator--ShareButtons--whatsapp": {
        "message": "ວ໋ອດເອັບ",
        "description": "Title for WhatsApp button"
    },
    "StickerCreator--AppStage--next": {
        "message": "ຕໍ່ໄປ",
        "description": "Default text for the next button on all stages of the sticker creator"
    },
    "StickerCreator--AppStage--prev": {
        "message": "ກັບຫຼັງ",
        "description": "Default text for the previous button on all stages of the sticker creator"
    },
    "StickerCreator--DropStage--title": {
        "message": "ເພີມສະຕີກເກີຂອງທ່ານ",
        "description": "Title for the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--help": {
        "message": "Stickers must be in PNG, APNG, or WebP format with a transparent background and 512x512 pixels. Recommended margin is 16px.",
        "description": "Help text for the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--showMargins": {
        "message": "ສະແດງຂອບ",
        "description": "Text for the show margins toggle on the drop stage of the sticker creator"
    },
    "StickerCreator--DropStage--addMore": {
        "message": "ເພີ່ມ $count$ ຫລື ຕື່ມອີກ",
        "description": "Text to show user how many more stickers they must add",
        "placeholders": {
            "hashtag": {
                "content": "$1",
                "example": "4"
            }
        }
    },
    "StickerCreator--EmojiStage--title": {
        "message": "ເພີ່ມກະຕູນອີໂມຈີ ແຕ່ລະສະຕີກເກີ",
        "description": "Title for the drop stage of the sticker creator"
    },
    "StickerCreator--EmojiStage--help": {
        "message": "ນີ້ຈະອານຸຍາດ ໄຫ້ພວກເຮົາ ແນະນຳສະຕີກເກີ ໄຫ້ທ່ານຕາມທີ ທ່ານກຳລັງຂໍ້ຄວາມ.",
        "description": "Help text for the drop stage of the sticker creator"
    },
    "StickerCreator--MetaStage--title": {
        "message": "ພຽງແຕ່ເພີ່ມເຕີມ ລາຍລະອຽດອີກ...",
        "description": "Title for the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--title": {
        "message": "ຫົວຂໍ້",
        "description": "Label for the title input of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--author": {
        "message": "ຜູ້ຂຽນ",
        "description": "Label for the author input of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--cover": {
        "message": "ກວມເອົາຮູບພາບ",
        "description": "Label for the cover image picker of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--Field--cover--help": {
        "message": "ຮູບພາບນີ້ ຈະສະແດງຂື້ນ ເມື່ອທ່ານໄດ້ ແບ່ງປັນຊອງ ສະຕິກເກີຂອງທ່ານ",
        "description": "Help text for the cover image picker of the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--title": {
        "message": "ທ່ານແນ່ໄຈແລ້ວບໍ ທີທາ່ນຕ້ອງການອັບໂລດ ຊອງສະຕີກເກີຂອງທ່ານ?",
        "description": "Title for the confirm dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--confirm": {
        "message": "ອັບໂລດ",
        "description": "Text for the upload button in the confirmation dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--MetaStage--ConfirmDialog--text": {
        "message": "ການດັດແກ້ ຂອງທ່ານຈະບໍສາມາດ ນຳໄຊ້ໄດ້ດົນ ຫຼື ຫຼັງຈາກໄດ້ລົບ ຊອງສະຕີກເກີ ທີສ້າງຂື້ນ.",
        "description": "The text inside the confirmation dialog on the meta stage of the sticker creator"
    },
    "StickerCreator--UploadStage--title": {
        "message": "ສ້າງຊອງສະຕີກເກີຂອງທ່ານ",
        "description": "Title for the upload stage of the sticker creator"
    },
    "StickerCreator--UploadStage-uploaded": {
        "message": "$count$ ຂອງ $total$ ການອັບໂລດ",
        "description": "Title for the upload stage of the sticker creator",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            },
            "total": {
                "content": "$2",
                "example": "20"
            }
        }
    },
    "StickerCreator--ShareStage--title": {
        "message": "ຍີນດີນຳເດີ ! ທີທ່ານໄດ້ ສ້າງຊອງສະຕີກເກີ",
        "description": "Title for the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--help": {
        "message": "ສະຕີກເກີໄໝ່ຂອງທ່ານ ໄດ້ເຂົ້າເຖີງ ສະຕີກເກີອີຄອນ, ຫຼື ທ່ານສາມາດໄຊ້ລີ່ງທາງລຸ່ມນີ້ ແຊຣກັບຫມູ່ເພືອນ. ",
        "description": "Help text for the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--callToAction": {
        "message": "Use the hashtag $hashtag$ to help other people find the URLs for any custom sticker packs that you would like to make publicly accessible.",
        "description": "Call to action text for the share stage of the sticker creator",
        "placeholders": {
            "hashtag": {
                "content": "$1",
                "example": "<strong>#makeprivacystick</strong>"
            }
        }
    },
    "StickerCreator--ShareStage--copyTitle": {
        "message": "ຊອງສະຕີກເກີ ຢູອາແອວ",
        "description": "Title for the copy button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--close": {
        "message": "ປິດ",
        "description": "Text for the close button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--createAnother": {
        "message": "ສ້າງຊອງສະຕີກເກີຕົວອື່ນ",
        "description": "Text for the create another sticker pack button on the share stage of the sticker creator"
    },
    "StickerCreator--ShareStage--socialMessage": {
        "message": "ກວດເບີງ ຊອງສະຕີກເກີໄໝ່ນີ້ ຂ້າພະເຈົ້າ ໄດ້ສ້າງສຳລັບ ສີກຫນໍ. #makeprivacystick",
        "description": "Text which is shared to social media platforms for sticker packs"
    },
    "StickerCreator--Toasts--imagesAdded": {
        "message": "$count$ ເພີ່ມຮູບພາບ",
        "description": "Text for the toast when images are added to the sticker creator",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "StickerCreator--Toasts--animated": {
        "message": "ຮູບເງົາສະຕິກເກີ ບໍຕອບສະໜອງ ໄນປັດຈຸບັນ",
        "description": "Text for the toast when an image that is animated was dropped on the sticker creator"
    },
    "StickerCreator--Toasts--tooLarge": {
        "message": "ຮູບພາບທີເອົາໄສ່ ຂະໜານຂອງຮູບໄຫຍ່ ເກີນໄປ",
        "description": "Text for the toast when an image that is too large was dropped on the sticker creator"
    },
    "StickerCreator--Toasts--errorProcessing": {
        "message": "ການປັບປຽ່ນ ຮູບ ມີຄວາມຜິດພາດ",
        "description": "Text for the toast when an image cannot be processed was dropped on the sticker creator with a generic error"
    },
    "StickerCreator--Toasts--APNG--notSquare": {
        "message": "ຮູບເງົາ PNG ທີມີຊີວິດຊີວາ ຕ້ອງເປັນຮູບ ສີ່ຫຼຽ່ມມົນ",
        "description": "Text for the toast when someone tries to upload a non-square APNG"
    },
    "StickerCreator--Toasts--mustLoopForever": {
        "message": "ຮູບເງົາ ຕ້ອງເປັນວົງກົມ ຕະຫລອດໄປ",
        "description": "Text for the toast when an image in the sticker creator does not animate forever"
    },
    "StickerCreator--Toasts--APNG--dimensionsTooLarge": {
        "message": "ຮູບເງົາ PNG ມິຕິ ມີຂະໜາດໄຫຍ່ເກີນໄປ",
        "description": "Text for the toast when an APNG image in the sticker creator is too large"
    },
    "StickerCreator--Toasts--APNG--dimensionsTooSmall": {
        "message": "ຮູບເງົາ PNG ມິຕິ ມີຂະໜາດ ນ້ອຍເກີນໄປ",
        "description": "Text for the toast when an APNG image in the sticker creator is too small"
    },
    "StickerCreator--Toasts--errorUploading": {
        "message": "ການອັບໂລດ ສະຕີກເກີ ມີຄວາມຜິດພາດ $message$",
        "description": "Text for the toast when a sticker pack cannot be uploaded",
        "placeholders": {
            "message": {
                "content": "$1",
                "example": "Not connected"
            }
        }
    },
    "StickerCreator--Toasts--linkedCopied": {
        "message": "ລີ່ງການກອບປີ້",
        "description": "Text for the toast when a link for sharing is copied from the Sticker Creator"
    },
    "StickerCreator--StickerPreview--light": {
        "message": "ສະຕີກເກີ  ຂອງຂ້ອຍໄນ ຫົວຂໍ້ມີແສງສະຫວ່າງ",
        "description": "Text for the sticker preview for the light theme"
    },
    "StickerCreator--StickerPreview--dark": {
        "message": "ສະຕີກເກີ ຂອງຂ້ອຍໄນ ຫົວຂໍ້ມີຄວາມມືດ",
        "description": "Text for the sticker preview for the dark theme"
    },
    "StickerCreator--Authentication--error": {
        "message": "ກະລຸນາ ປິດສິກຫນໍ ທີໂທລະສັບຂອງທ່ານ ແລະ ແດັດທອບ ທີໄຊ້ໄນຊອງສະຕີກເກີ ທີສັາງຂື້ນ.",
        "description": "The error message which appears when the user has not linked their account and attempts to use the Sticker Creator"
    },
    "Reactions--error": {
        "message": "ການສົ່ງການເຊື່ອມຕໍ່ ມີບັນຫາ. ກະລຸນາລອງ ໄໝ່ອີກຄັ້ງ",
        "description": "Shown when a reaction fails to send"
    },
    "ReactionsViewer--more": {
        "message": "ຕື່ມ",
        "description": "Use in the reaction picker as the alt text for the 'more' button"
    },
    "ReactionsViewer--all": {
        "message": "ທັງໝົດ",
        "description": "Shown in reaction viewer as the title for the 'all' category"
    },
    "MessageRequests--message-direct": {
        "message": "ອານຸຍາດໄຫ້ $name$ ຂໍ້ຄວາມຂອງທ່ານ ແລະ ການ ແບ່ງປັນຊື່ຂອງທ່ານ ແລະ ຮູບ ກັບພວກເຂົາ? ພວກເຂົາ ບໍສາມາດຮູ້ ເຫັນຂໍ້ຄວາມຂອງ ທ່ານຈົນກວ່າ ພວກເຂົາ ຈະຍ້ອມຮັບທ່ານ.",
        "description": "Shown as the message for a message request in a direct message",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce"
            }
        }
    },
    "MessageRequests--message-direct-blocked": {
        "message": "ອານຸຍາດໄຫ້ $name$ ຂໍ້ຄວາມຂອງທ່ານ ແລະ ການແບ່ງປັນຊື່ຂອງທ່ານ ແລະ ຮູບ ກັບພວກເຂົາເຈົ້າ? ທ່ານບໍສາມາດຮັບ ຂໍ້ຄວາມໃດຈົນກວ່າ ທ່ານບໍໄດ້ບ໋ອກ ພວກເຂົາເຈົ້າ.",
        "description": "Shown as the message for a message request in a direct message with a blocked account",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce"
            }
        }
    },
    "MessageRequests--message-group": {
        "message": "ເຂົ້າຮ່ວມກຸ່ມນີ້ ແລະ ແບ່ງປັນຊື່ຂອງທ່ານ ແລະ ຮູບ ກັບສະມາຊີກນີ້ບໍ? ພວກເຂົາ ບໍສາມາດຮູ້ ເຫັນຂໍ້ຄວາມຂອງທ່ານ ຈົນກວ່າພວກເຂົາ ຈະຍ້ອມຮັບທ່ານ.",
        "description": "Shown as the message for a message request in a group",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--message-group-blocked": {
        "message": "ບໍຕ້ອງບ໋ອກ ກຸ່ມນີ້ ແລະ ແບ່ງປັນຊື່ຂອງທ່ານ ແລະ ຮູບ ກັບສະມາຊີກນີ້ບໍ? ທ່ານບໍສາມາດຮັບ ຂໍ້ຄວາມໃດຈົນກວ່າ ທ່ານ ບໍໄດ້ບ໋ອກ ພວກເຂົາເຈົ້າ.",
        "description": "Shown as the message for a message request in a blocked group"
    },
    "MessageRequests--block": {
        "message": "ບ໋ອກ",
        "description": "Shown as a button to let the user block a message request"
    },
    "MessageRequests--unblock": {
        "message": "ບໍ່ບ໋ອກ",
        "description": "Shown as a button to let the user unblock a message request"
    },
    "MessageRequests--unblock-confirm-title": {
        "message": "ບໍ່ບ໋ອກ $name$ ?",
        "description": "Shown as a button to let the user unblock a message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--unblock-direct-confirm-body": {
        "message": "ທ່ານຈະສາມາດ ສົ່ງຂໍ້ຄວາມ ແລະ ໂທຫາ ກັນ ແລະ ກັນ. ",
        "description": "Shown as the body in the confirmation modal for unblocking a private message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--unblock-group-confirm-body": {
        "message": "ສະມາຊີກກຸ່ມ ຈະສາມາດ ເພີ່ມທ່ານເຂົ້າໄນ ກຸ່ມນີ້ອີກຄັ້ງ.",
        "description": "Shown as the body in the confirmation modal for unblocking a group message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--block-and-report-spam": {
        "message": "Report Spam and Block",
        "description": "Shown as a button to let the user block a message request and report spam"
    },
    "MessageRequests--block-and-report-spam-success-toast": {
        "message": "Reported as spam and blocked.",
        "description": "Shown in a toast when you successfully block a user and report them as spam"
    },
    "MessageRequests--block-direct-confirm-title": {
        "message": "ບ໋ອກ $name$ ?",
        "description": "Shown as the title in the confirmation modal for blocking a private message request",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Cayce Pollard"
            }
        }
    },
    "MessageRequests--block-direct-confirm-body": {
        "message": "ບ໋ອກຄົນ ຈະບໍ່ສາມາດໂທຫາທ່ານ ຫຼື ສົ່ງຂໍ້ຄວາມຫານທ່ານໄດ້.",
        "description": "Shown as the body in the confirmation modal for blocking a private message request"
    },
    "MessageRequests--block-group-confirm-title": {
        "message": "ບ໋ອກ ແລະ ອອກຈາກ $group$ ?",
        "description": "Shown as the title in the confirmation modal for blocking a group message request",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "Friends 🌿"
            }
        }
    },
    "MessageRequests--block-group-confirm-body": {
        "message": "ຂໍ້ຄວາມທີ ທ່ານໄດ້ຮັບ ຈະຢູ່ບໍໄດ້ດົນ ຫຼື ການອັບເດດຈາກກຸ່ມນີ້ ແລະ ສະມາຊີກ ບໍສາມາດ ເພີມ ທ່ານເຂົ້າໄນກຸ່ມນີ້ໄດ້ອີກ. ",
        "description": "Shown as the body in the confirmation modal for blocking a group message request"
    },
    "MessageRequests--delete": {
        "message": "ລົບ",
        "description": "Shown as a button to let the user delete any message request"
    },
    "MessageRequests--delete-direct-confirm-title": {
        "message": "ລົບການສົນທະນາບໍ່ ?",
        "description": "Shown as the title in the confirmation modal for deleting a private message request"
    },
    "MessageRequests--delete-direct-confirm-body": {
        "message": "ທ່ານຈະລົບການໄຊ້ ອຸປະກອນທັງໝົດ ຂອງການສົນທະນາ",
        "description": "Shown as the body in the confirmation modal for deleting a private message request"
    },
    "MessageRequests--delete-group-confirm-title": {
        "message": "ລົບ ແລະ ອອກຈາກ $group$ ?",
        "description": "Shown as the title in the confirmation modal for deleting a group message request",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "Friends 🌿"
            }
        }
    },
    "MessageRequests--delete-direct": {
        "message": "ລົບ",
        "description": "Shown as a button to let the user delete a direct message request"
    },
    "MessageRequests--delete-group": {
        "message": "ລົບ ແລະ ອອກຈາກ",
        "description": "Shown as a button to let the user delete a group message request"
    },
    "MessageRequests--delete-group-confirm-body": {
        "message": "ທ່ານຈະອອກຈາກກຸ່ມນີ້ ແລະ ອຸປະກອນທັງໝົດຂອງທ່ານຈະຖືກລົບ",
        "description": "Shown as the body in the confirmation modal for deleting a group message request"
    },
    "MessageRequests--accept": {
        "message": "ຍ້ອມຮັບ",
        "description": "Shown as a button to let the user accept a message request"
    },
    "MessageRequests--continue": {
        "message": "ສືບຕໍ່",
        "description": "Shown as a button to share your profile, necessary to continue messaging in a conversation"
    },
    "MessageRequests--profile-sharing--group": {
        "message": "ສຶບຕໍ່ການສົນທະນາ ຂອງທ່ານ ກັບກຸ່ມນີ້ ແລະ ແບ່ງປັນຊື່ຂອງທ່ານ ແລະ ຮູບພາບ ກັບສະມາຊີກນີ້ບໍ? $learnMore$",
        "description": "Shown when user hasn't shared their profile in a group yet",
        "placeholders": {
            "learnMore": {
                "content": "$1",
                "example": "Learn More."
            }
        }
    },
    "MessageRequests--profile-sharing--direct": {
        "message": "ສືບຕໍ່ການສົນທະນານີ້ ກັບ $firstName$ ແລະການແບ່ງປັນຊື່ຂອງ ແລະ ຮູ້ພາບ ກັບພວກເຂົາ? $learnMore$",
        "description": "Shown when user hasn't shared their profile in a 1:1 conversation yet",
        "placeholders": {
            "firstName": {
                "content": "$1",
                "example": "Alice"
            },
            "learnMore": {
                "content": "$2",
                "example": "Learn More."
            }
        }
    },
    "MessageRequests--learn-more": {
        "message": "ຮຽນຮູ້ເພີມຕື່ມ",
        "description": "Shown at the end of profile sharing messages as a link."
    },
    "ConversationHero--members": {
        "message": "$count$ ສຳມະຊີກ",
        "description": "Specifies the number of members in a group conversation",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "22"
            }
        }
    },
    "ConversationHero--members-1": {
        "message": "1 ສຳມະຊີກ",
        "description": "Specifies the number of members in a group conversation when there is one member",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "22"
            }
        }
    },
    "member-of-1-group": {
        "message": "ສຳມະຊີກຂອງ  $group$",
        "description": "Shown in the conversation hero to indicate this user is a member of a mutual group",
        "placeholders": {
            "group": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            }
        }
    },
    "member-of-2-groups": {
        "message": "ສຳມະຊີກຂອງ $group1$ ແລະ $group2$",
        "description": "Shown in the conversation hero to indicate this user is a member of at least two mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            }
        }
    },
    "member-of-3-groups": {
        "message": "ສຳມະຊີກຂອງ $group1$, $group2$, ແລະ $group3$",
        "description": "Shown in the conversation hero to indicate this user is a member of at least three mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            },
            "group3": {
                "content": "$3",
                "example": "Friends 🌿"
            }
        }
    },
    "member-of-more-than-3-groups": {
        "message": "ສຳມະຊີກຂອງ $group1$, $group2$, $group3$ ແລະ $remainingCount$ ຕື່ມອີກ",
        "description": "Shown in the conversation hero to indicate this user is a member of at least three mutual groups",
        "placeholders": {
            "group1": {
                "content": "$1",
                "example": "NYC Rock Climbers"
            },
            "group2": {
                "content": "$2",
                "example": "Dinner Party"
            },
            "group3": {
                "content": "$3",
                "example": "Friends 🌿"
            },
            "remainingCount": {
                "content": "$4",
                "example": "3"
            }
        }
    },
    "ConversationHero--membership-added": {
        "message": "$name$ ເພີມກຸ່ມຂອງທ່ານ",
        "description": "Shown Indicates that you were added to a group by a given individual.",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jeff Smith"
            }
        }
    },
    "no-groups-in-common": {
        "message": "No groups in common",
        "description": "Shown to indicate this user is not a member of any groups"
    },
    "no-groups-in-common-warning": {
        "message": "No groups in common. Review requests carefully.",
        "description": "When a user has no common groups, show this warning"
    },
    "acceptCall": {
        "message": "ຄຳຕອບ",
        "description": "Shown in tooltip for the button to accept a call (audio or video)"
    },
    "acceptCallWithoutVideo": {
        "message": "ຕອບ ໂດຍບໍ່ມີ ວິດີໂອ",
        "description": "Shown in tooltip for the button to accept a video call without video"
    },
    "declineCall": {
        "message": "ຫຼຸດລົງ",
        "description": "Shown in tooltip for the button to decline a call (audio or video)"
    },
    "declinedIncomingAudioCall": {
        "message": "ການໂທສຽງ ຂອງທ່ານໄດ້ ຫຼຸດລົງ",
        "description": "Shown in conversation history when you declined an incoming audio call"
    },
    "declinedIncomingVideoCall": {
        "message": "ການໂທວິດີໂອ ຂອງທ່ານ ໄດ້ຫຼຸດລົງ",
        "description": "Shown in conversation history when you declined an incoming video call"
    },
    "acceptedIncomingAudioCall": {
        "message": "ການໂທສຽງ ມີລາຍໄດ້ເຂົ້າມາ",
        "description": "Shown in conversation history when you accepted an incoming audio call"
    },
    "acceptedIncomingVideoCall": {
        "message": "ການໂທວິດີໂອ ມີລາຍໄດ້ເຂົ້າມາ",
        "description": "Shown in conversation history when you accepted an incoming video call"
    },
    "missedIncomingAudioCall": {
        "message": "ສາຍໂທສຽງ ທີບໍ່ໄດ້ຮັບ",
        "description": "Shown in conversation history when you missed an incoming audio call"
    },
    "missedIncomingVideoCall": {
        "message": "ສາຍໂທວິດີໂອ ທີບໍ່ໄດ້ຮັບ",
        "description": "Shown in conversation history when you missed an incoming video call"
    },
    "acceptedOutgoingAudioCall": {
        "message": "ການໂທອອກສຽງ",
        "description": "Shown in conversation history when you made an outgoing audio call"
    },
    "acceptedOutgoingVideoCall": {
        "message": "ການໂທອອກ ທາງວິດີໂອ",
        "description": "Shown in conversation history when you made an outgoing video call"
    },
    "missedOrDeclinedOutgoingAudioCall": {
        "message": "ບໍ່ຮັບສາຍ ການໂທສຽງ",
        "description": "Shown in conversation history when your audio call is missed or declined"
    },
    "missedOrDeclinedOutgoingVideoCall": {
        "message": "ບໍ່ຮັບສາຍ ການໂທວິດີໂອ",
        "description": "Shown in conversation history when your video call is missed or declined"
    },
    "incomingAudioCall": {
        "message": "ສາຍໂທສຽງເຂົ້າມາ...",
        "description": "Shown in both the incoming call bar and notification for an incoming audio call"
    },
    "incomingVideoCall": {
        "message": "ສາຍໂທວິດິໂອເຂົ້າມາ...",
        "description": "Shown in both the incoming call bar and notification for an incoming video call"
    },
    "outgoingCallPrering": {
        "message": "ກຳລັງໂທ...",
        "description": "Shown in the call screen when placing an outgoing call that isn't ringing yet"
    },
    "outgoingCallRinging": {
        "message": "ສຽງຮຽກເຂົ້າ...",
        "description": "Shown in the call screen when placing an outgoing call that is now ringing"
    },
    "makeOutgoingCall": {
        "message": "ເລີມການໂທ",
        "description": "Title for the call button in a conversation"
    },
    "makeOutgoingVideoCall": {
        "message": "ເລີມການ ໂທວິດີໂອ",
        "description": "Title for the video call button in a conversation"
    },
    "joinOngoingCall": {
        "message": "ເຂົ້າຮ່ວມ",
        "description": "Text that appears in a group when a call is active"
    },
    "callNeedPermission": {
        "message": "$title$ ຈະໄດ້ຮັບ ຂໍ້ຄວາມ ຮ້ອງຂໍ້ຈາກທ່ານ. ທ່ານສາມາດໂທ ໄດ້ໝື່ງຄັ້ງ ຈາກຂໍ້ຄວາມທີ ທ່ານໄດ້ຮອ້ງຂໍ ທີໄດ້ມີການຕອບຮັບ.",
        "description": "Shown when a call is rejected because the other party hasn't approved the message/call request",
        "placeholders": {
            "title": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "callReconnecting": {
        "message": "ການເຊື່ອມຕໍ່...",
        "description": "Shown in the call screen when the call is reconnecting due to network issues"
    },
    "callDuration": {
        "message": "ສິກຫນໍ $duration$",
        "description": "Shown in the call screen to indicate how long the call has been connected",
        "placeholders": {
            "duration": {
                "content": "$1",
                "example": "00:01"
            }
        }
    },
    "callingDeviceSelection__settings": {
        "message": "ຕັ້ງຄ່າ",
        "description": "Title for device selection settings"
    },
    "calling__participants": {
        "message": "$people$ ໄນການໂທ",
        "description": "Title for participants list toggle",
        "placeholders": {
            "people": {
                "content": "$1",
                "example": "16"
            }
        }
    },
    "calling__call-notification__ended": {
        "message": "ການໂທກຸ່ມ ໄດ້ສີນສຸດລົງ",
        "description": "Notification message when a group call has ended"
    },
    "calling__call-notification__started-by-someone": {
        "message": "ກຸ່ມໄດ້ ເລີມການໂທ",
        "description": "Notification message when a group call has started, but we don't know who started it"
    },
    "calling__call-notification__started-by-you": {
        "message": "່ເລີມການໂທ ກຸ່ມຂອງທ່ານ",
        "description": "Notification message when a group call has started by you"
    },
    "calling__call-notification__started": {
        "message": "$name$ ເລີມການໂທກຸ່ມ",
        "description": "Notification message when a group call has started",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "calling__call-notification__button__in-another-call-tooltip": {
        "message": "ທ່ານໄດ້ຢູ່ໄນ ການໂທແລ້ວ",
        "description": "Tooltip in disabled notification button when you're on another call"
    },
    "calling__call-notification__button__call-full-tooltip": {
        "message": "ການໂທໄດ້ ມີຜົນຕອບຮັບ $max$ ຂອງຜູ້ເຂົ້າຮ່ວມ",
        "description": "Tooltip in disabled notification button when the call is full",
        "placeholders": {
            "max": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "calling__pip--on": {
        "message": "ຫຼຸດຜ່ອນການໂທ",
        "description": "Title for picture-in-picture toggle"
    },
    "calling__pip--off": {
        "message": "ໂທເຕັມຈໍ",
        "description": "Title for picture-in-picture toggle"
    },
    "calling__switch-view--to-grid": {
        "message": "ປຽ່ນມູນມອງ ການເບີງ ຕະຂ່າຍ",
        "description": "Title for grid/speaker view toggle when on a call"
    },
    "calling__switch-view--to-speaker": {
        "message": "ປຽ່ນໄປເບີງແບບ ລຳໂພງ",
        "description": "Title for grid/speaker view toggle when on a call"
    },
    "calling__hangup": {
        "message": "ອອກຈາກການໂທ",
        "description": "Title for hang up button"
    },
    "calling__SelectPresentingSourcesModal--title": {
        "message": "Share your screen",
        "description": "Title for the select your screen sharing sources modal"
    },
    "calling__SelectPresentingSourcesModal--confirm": {
        "message": "Share screen",
        "description": "Confirm button for sharing screen modal"
    },
    "calling__SelectPresentingSourcesModal--entireScreen": {
        "message": "Entire screen",
        "description": "Title for the select your screen sharing sources modal and 'Entire Screen' source"
    },
    "calling__SelectPresentingSourcesModal--screen": {
        "message": "Screen $id$",
        "description": "Title for `Screen #N` source in screen sharing sources modal and overlay",
        "placeholders": {
            "id": {
                "content": "$1",
                "example": "1"
            }
        }
    },
    "calling__SelectPresentingSourcesModal--window": {
        "message": "A window",
        "description": "Title for the select your screen sharing sources modal"
    },
    "callingDeviceSelection__label--video": {
        "message": "ວີດີໂອ",
        "description": "Label for video input selector"
    },
    "callingDeviceSelection__label--audio-input": {
        "message": "ໄມໂຄຣໂຟນ",
        "description": "Label for audio input selector"
    },
    "callingDeviceSelection__label--audio-output": {
        "message": "ລຳໂພງ",
        "description": "Label for audio output selector"
    },
    "callingDeviceSelection__select--no-device": {
        "message": "ບໍມີອຸປະກອນ",
        "description": "Message for when there are no available devices to select for input/output audio or video"
    },
    "callingDeviceSelection__select--default": {
        "message": "ຄ່າເລີ່ມຕົ້ນ",
        "description": "Shown when the device is the default device"
    },
    "muteNotificationsTitle": {
        "message": "ແຈ້ງການປິດສຽງ",
        "description": "Label for the mute notifications drop-down selector"
    },
    "muteHour": {
        "message": "ປິດເປັນເວລາ ໝື່ງ ຊົ່ວໂມງ",
        "description": "Label for muting the conversation"
    },
    "muteEightHours": {
        "message": "Mute for eight hours",
        "description": "Label for muting the conversation"
    },
    "muteDay": {
        "message": "ປິດເປັນ ເວລາໝື່ງ ມື້",
        "description": "Label for muting the conversation"
    },
    "muteWeek": {
        "message": "ປິດເປັນ ເວລາ ໝື່ງອາທິດ",
        "description": "Label for muting the conversation"
    },
    "muteAlways": {
        "message": "Mute always",
        "description": "Label for muting the conversation"
    },
    "unmute": {
        "message": "ບໍ່ປິດສຽງ",
        "description": "Label for unmuting the conversation"
    },
    "muteExpirationLabelAlways": {
        "message": "Muted always",
        "description": "Shown in the mute notifications submenu whenever a conversation has been muted"
    },
    "muteExpirationLabel": {
        "message": "ປິດສຽງ ຈົນກວ່າ $duration$",
        "description": "Shown in the mute notifications submenu whenever a conversation has been muted",
        "placeholders": {
            "duration": {
                "content": "$1",
                "example": "10/23/2023, 7:10 PM"
            }
        }
    },
    "EmojiButton__label": {
        "message": "ກະຕູນອີໂມຈີ",
        "description": "Label for emoji button"
    },
    "ErrorModal--title": {
        "message": "ບາງຢາງມີບັນຫາ",
        "description": "Title of pop-up dialog when user-initiated task has gone wrong"
    },
    "ErrorModal--description": {
        "message": "ກະລຸນາ ລອງໄໝ່ອີກຄັ້ງ ຫຼື ຕິດຕໍ່ບໍລິການ.",
        "description": "Description text in pop-up dialog when user-initiated task has gone wrong"
    },
    "Confirmation--confirm": {
        "message": "ໂອເຄ",
        "description": "Button to dismiss pop-up dialog when user-initiated task has gone wrong"
    },
    "unknown-sgnl-link": {
        "message": "ຂໍໂທດ, sgnl:// link ນັນບໍມີຄວາມໝາຍ!",
        "description": "Shown if you click on a sgnl:// link not currently supported by Desktop"
    },
    "GroupV2--join--invalid-link--title": {
        "message": "ລີ່ງບໍຖືກຕ້ອງ",
        "description": "Shown if we are unable to parse a group link"
    },
    "GroupV2--join--invalid-link": {
        "message": "This is not a valid group link. Make sure the entire link is intact and correct before attempting to join.",
        "description": "Shown if we are unable to parse a group link"
    },
    "GroupV2--join--prompt": {
        "message": "ທ່ານຕ້ອງການ ຈະເຂົ້າຮ່ວມກຸ່ມນີ້ ແລະ ແຊຣຊື່ ແລະ ຮູບຂອງທ່ານ ກັບສາມະຊີກນີບໍ?",
        "description": "Shown when you click on a group link to confirm"
    },
    "GroupV2--join--already-in-group": {
        "message": "ທ່ານຢູ່ໄນກຸ່ມນີ້ແລ້ວ.",
        "description": "Shown if you click a group link for a group where you're already a member"
    },
    "GroupV2--join--already-awaiting-approval": {
        "message": "ທ່ານໄດ້ຮັບ ອານຸຍາດ ເຂົ້າຮ່ວມກຸ່ມນີ້ແລ້ວ.",
        "description": "Shown if you click a group link for a group where you've already requested approval'"
    },
    "GroupV2--join--unknown-link-version--title": {
        "message": "ບໍຮູ້ຮຸ່ນ ຂອງລີ່ງ",
        "description": "This group link is no longer valid."
    },
    "GroupV2--join--unknown-link-version": {
        "message": "ລີ້ງນີ ບໍ່ສະນັບສະໜູນ ຈາກສະບັບ ຂອງສີກຫນໍ ແດັດທັອບ",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--link-revoked--title": {
        "message": "ບໍ່ສາມາດ ເຂົ້າຮ່ວມກຸ່ມ",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--link-revoked": {
        "message": "ລີ່ງກຸ່ມນີ້ ບໍຖືກຕ້ອງອີກໄປ.",
        "description": "Shown if you click a group link and we can't get information about it"
    },
    "GroupV2--join--prompt-with-approval": {
        "message": "An admin of this group must approve your request before you can join this group. If approved, your name and photo will be shared with its members.",
        "description": "Shown when you click on a group link to confirm, if it requires admin approval"
    },
    "GroupV2--join--join-button": {
        "message": "ເຂົ້າຮ່ວມ",
        "description": "The button to join the group"
    },
    "GroupV2--join--request-to-join-button": {
        "message": "ຄຳຂໍຮ້ອງ ເຂົ້າຮ່ວມ",
        "description": "The button to join the group, if approval is required"
    },
    "GroupV2--join--cancel-request-to-join": {
        "message": "ຍົກເລີກ ຄຳຂໍຮ້ອງ",
        "description": "The button to cancel request to join the group"
    },
    "GroupV2--join--cancel-request-to-join--confirmation": {
        "message": "ທ່ານຈະຍົກເລີກ ຄຳຂໍຮ້ອງ ການເຂົ້າຮ່ວມ ກຸ່ມນີ້ບໍ?",
        "description": "A confirmation message that shows after you click the button"
    },
    "GroupV2--join--cancel-request-to-join--yes": {
        "message": "ຕົກລົງ",
        "description": "Choosing to continue in the cancel join confirmation dialog"
    },
    "GroupV2--join--cancel-request-to-join--no": {
        "message": "ບໍ່ຕົກລົງ",
        "description": "Choosing not to continue in the cancel join confirmation dialog"
    },
    "GroupV2--join--member-count--single": {
        "message": "1 ສຳມະຊີກ",
        "description": "Shown in the metadata section if group has just one member"
    },
    "GroupV2--join--member-count--multiple": {
        "message": "$count$ ສຳມະຊີກ",
        "description": "Shown in the metadata section if group has more than one member",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "12"
            }
        }
    },
    "GroupV2--join--group-metadata": {
        "message": "ກຸ່ມ. $memberCount$",
        "description": "A holder for two pieces of information - the type of conversation, and the member count",
        "placeholders": {
            "memberCount": {
                "content": "$1",
                "example": "12 members"
            }
        }
    },
    "GroupV2--join--requested": {
        "message": "Your request to join has been sent to the group admin. You’ll be notified when they take action.",
        "description": "Shown in composition area when you've requested to join a group"
    },
    "GroupV2--join--general-join-failure--title": {
        "message": "ລິ່ງມີການ ຜິດພາດ",
        "description": "Shown if something went wrong when you try to join via a group link"
    },
    "GroupV2--join--general-join-failure": {
        "message": "ທາງລີ່ງມີບັນຫາ ການເຂົ້າຮ່ວມ. ກາລຸນາ ລອງໄໝ່ອີກຄັ້ງ.",
        "description": "Shown if something went wrong when you try to join via a group link"
    },
    "GroupV2--admin": {
        "message": "ບໍລີຫານ",
        "description": "Label for a group administrator"
    },
    "GroupV2--only-admins": {
        "message": "Only Admins",
        "description": "Label for group administrators -- used in drop-downs to select permissions that apply to admins"
    },
    "GroupV2--all-members": {
        "message": "ສະມາຊິກ ທັງຫມົດ",
        "description": "Label for describing the general non-privileged members of a group"
    },
    "updating": {
        "message": "ກຳລັງອັບເດດ...",
        "description": "Shown along with a spinner when an update operation takes longer than one second"
    },
    "GroupV2--create--you": {
        "message": "ສ້າງກຸ່ມ ຂອງທ່ານ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--create--other": {
        "message": "$memberName$ ສ້າງກຸມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--create--unknown": {
        "message": "ກຸ່ມທີ ສ້າງຂື້ນ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--title--change--other": {
        "message": "$memberName$ ປຽ່ນຊື່ກຸ່ມເຖີງ \"$newTitle$\".",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            },
            "newTitle": {
                "content": "$2",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--change--you": {
        "message": "ທ່ານປຽ່ນຊື່ກຸ່ມຂອງທ່ານເຖີງ \" $newTitle$\".",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "newTitle": {
                "content": "$1",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--change--unknown": {
        "message": "ປຽ່ນຊື່ ສຳມະຊີກກຸ່ມເຖີງ \" $newTitle$\".",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "newTitle": {
                "content": "$1",
                "example": "Saturday Hiking"
            }
        }
    },
    "GroupV2--title--remove--other": {
        "message": "$memberName$ ຍ້າຍຊື່ກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--title--remove--you": {
        "message": "ຍ້າຍຊື່ກຸ່ມ ຂອງທ່ານ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--title--remove--unknown": {
        "message": "ຍ້າຍຊື່ ສຳມະຊີກກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--change--other": {
        "message": "$memberName$ ໄດ້ປຽ່ນເປັນກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--avatar--change--you": {
        "message": "ທ່ານໄດ້ປຽ່ນ ເປັນກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--change--unknown": {
        "message": "ສະມາຊີກ ໄດ້ປຽ່ນ ເປັນກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--remove--other": {
        "message": "$memberName$ ຍ້າຍໄປທີ ກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--avatar--remove--you": {
        "message": "ທ່ານໄດ້ຍ້າຍ ໄປທີກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--avatar--remove--unknown": {
        "message": "ສະມາຊີກໄດ້ ຍ້າຍໄປທີ ກຸ່ມອາວຕາຣ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--admins--other": {
        "message": "$adminName$ ໄດ້ປຽ່ນ ໄຜສາມາດ ແກ້ໄຂຂໍ້ມູນກຸ່ມໄປ \"ສະເພາະຜູ້ບໍລິຫານເທົ່ານັນ.\"",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-attributes--admins--you": {
        "message": "ທ່ານໄດ້ປຽ່ນ ໄຜທີສາມາດ ແກ້ໄຂຂໍ້ມູນກຸ່ມໄປ \"ສະເພາະຜູ້ບໍລິຫານເທົ່ານັນ.\"",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--admins--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ປຽ່ນ ໄຜທີສາມາດແກ້ໄຂ ຂໍ້ມູນກຸ່ມໄປ \"ສະເພາະຜູ້ບໍລິຫານເທົ່ານັນ.\"",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--all--other": {
        "message": "$adminName$ ໄດ້ປຽ່ນ ໄຜສາມາດ ແກ້ໄຂຂໍ້ມູນກຸ່ມໄປ \"ເປັນສະມາຊີກທັງໝົດ.\"",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-attributes--all--you": {
        "message": "ທ່ານໄດ້ປຽ່ນ ໄຜທີສາມາດ ແກ້ໄຂຂໍ້ມູນກຸ່ມໄປ '' ເປັນສະມາຊີກທັງໝົດ. ''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-attributes--all--unknown": {
        "message": "ຜູ້ບໍລີຫານ ໄດ້ປຽ່ນ ໄຜທີສາມາດແກ້ໄຂ ຂໍ້ມູນກຸ່ມໃປ ''ເປັນສະມາຊີກທັງໝົດ. ''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--admins--other": {
        "message": "$adminName$ ໄຜທີສາມາດແກ້ໄຂ ປຽ່ນແປງກຸ່ມ ສະມາຊີກເປັນ '' ສະເພາະຜູ້ບໍລີຫານເທົ່ານັນ. ''",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-members--admins--you": {
        "message": "ທ່ານໄດ້ປຽ່ນ ໄຜທີສາມາດ ແກ້ໄຂກຸ່ມ ການເປັນສະມາຊີກໄປ '' ສະເພາະຜູ້ບໍລີຫານເທົ່ານັນ. ''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--admins--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ປຽ່ນ ໄຜທີສາມາດແກ້ໄຂ ກຸ່ມການເປັນສະມາຊີກໄປ ''ສະເພາະຜູ້ບໍລີຫານເທົ່ານັນ.''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--all--other": {
        "message": " $adminName$ ໄຜທີສາມາດແກ້ໄຂ ປຽ່ນແປງກຸ່ມ ສະມາຊີກໄປ '' ເປັນສະມາຊີກທັງໝົດ. ''",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--access-members--all--you": {
        "message": "ທ່ານໄດ້ປຽ່ນ ໄຜທີສາມາດແກ້ໄຂ ກຸ່ມການເປັນສະມາຊີກໄປ '' ເປັນສະມາຊີກທັງໝົດ.''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-members--all--unknown": {
        "message": "ຜູ້ບໍລີຫານ ໄດ້ປຽ່ນ ໄຜທີສາດແກ້ໄຂ ກຸ່ມການເປັນສະມາຊີກໄປ ''ເປັນສະມາຊີກທັງໝົດ.''",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--disabled--you": {
        "message": "ຜູ້ບໍລິຫານ ບໍອານຸຍາດທ່ານ ສຳລັບລີ່ງຂອງກຸ່ມນີ້. ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--disabled--other": {
        "message": "$adminName$ ຜູ້ບໍລິຫານ ບໍອານຸຍາດ ສຳລັບລີ່ງຂອງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--access-invite-link--disabled--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ອານຸຍາດ ສຳລັບລີ່ງຂອງກຸ່ມ ບໍ່ສາມາດ ນຳໄຊ້.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--enabled--you": {
        "message": "ທ່ານໄດ້ຮັບ ອານຸຍາດ ຈາກຜູ້ບໍລິຫານ ສຳລັບລີ່ງຂອງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--access-invite-link--enabled--other": {
        "message": "$adminName$ ໄດ້ຮັບອານຸຍາດ ຈາກຜູ້ບໍລິຫານ ສຳລັບລີ່ງຂອງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--access-invite-link--enabled--unknown": {
        "message": "ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ສຳລັບລີ່ງກຸ່ມ ມີການນຳໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--invited--you": {
        "message": "ທ່ານໄດ້ເພີມ ການເຊື້ອເຊີນ ສະມາຊີກ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--invited--other": {
        "message": "$memberName$ ເພີມການເຊື້ອເຊີນ ສະມາຊີກ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Alice"
            },
            "inviteeName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--invited--unknown": {
        "message": "້ເພີມສຳມະຊີກ ເຊື້ອເຊີນ ສະມາຊີກ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--from-invite--other": {
        "message": "$inviteeName$ ການເຊື້ອເຊີນ ໄດ້ຖືກຕອບຮັບ ເຂົ້າໄນກຸ່ມຈາກ $inviterName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            },
            "inviterName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--from-invite--other-no-from": {
        "message": "$inviteeName$ ການເຊື້ອເຊີນ ໄດ້ຖືກຕອບຮັບ ເຂົ້າໄນກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--from-invite--you": {
        "message": "ທ່ານໄດ້ຖືກ ຕອບຮັບ ການເຊື້ອເຊີນ ເຂົ້າໄນກຸ່ມຈາກ $inviterName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--from-invite--you-no-from": {
        "message": "ທ່ານໄດ້ຖືກ ຕອບຮັບ ການເຊື້ອເຊີນ ເຂົ້າໄນກຸ່ມແລ້ວ ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--from-invite--from-you": {
        "message": "$inviteeName$ ທ່ານໄດ້ຕອບຮັບ ການເຊື້ອເຊີນ ເຂົ້າໄນກຸ່ມແລ້ວ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--other--other": {
        "message": "$adderName$ ເພີ່ມ $addeeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adderName": {
                "content": "$1",
                "example": "Bob"
            },
            "addeeName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add--other--you": {
        "message": "ທ່ານໄດ້ເພີ່ມ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--other--unknown": {
        "message": "ສຳມະຊີກເພີ່ມ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--you--other": {
        "message": "$memberName$ ເພີ່ມທ່ານ ເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-add--you--you": {
        "message": "ທ່ານໄດ້ເຂົ້າຮ່ວມກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add--you--unknown": {
        "message": "ທ່ານໄດ້ເພີມເ ຂົ້າໄນກຸ່ມແລ້ວ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-link--you--you": {
        "message": "ທ່ານສາມາດ ເຂົ້າຮ່ວມກຸ່ມ ທາງລີ່ງຂອງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-link--other": {
        "message": "$memberName$ ເຂົ້າຮ່ວມກຸ່ມ ທາງລີ່ງຂອງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--you--other": {
        "message": "$adminName$ ຄຳຂໍຮ້ອງຂອງທ່ານ ໄດ້ຮັບອານຸຍາດ ເຂົ້າຮ່ວມໃນກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--you--unknown": {
        "message": "ຄຳຂໍຮ້ອງຂອງທ່ານ ໄນກຸ່ມ ໄດ້ຮັບອານຸຍາດແລ້ວ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-add-from-admin-approval--other--you": {
        "message": "ຄຳຂໍຮ້ອງຂອງ ທ່ານໄດ້ຮັບອານຸຍາດ ເຂົ້າຮ່ວມກຸ່ມຈາກ $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--other--other": {
        "message": "$adminName$ ຄຳຂໍຮ້ອງ ໄດ້ຮັບອານຸຍາດ ເຂົ້າຮ່ວມກຸ່ມຈາກ $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-add-from-admin-approval--other--unknown": {
        "message": "ຄຳຂໍຮ້ອງ ເຂົ້າຮ່ວມຈາກກຸ່ມ $joinerName$ ໄດ້ຮັບການອານຸຍາດ. ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-remove--other--other": {
        "message": "$adminName$ ຍົກຍ້າຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-remove--other--self": {
        "message": "$memberName$ ອອກຈາກກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--other--you": {
        "message": "ທ່ານຍົກຍ້າຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--other--unknown": {
        "message": "ສຳມະຊີກຍົກຍ້າຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--you--other": {
        "message": " $adminName$ ຍົກຍ້າຍທ່ານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-remove--you--you": {
        "message": "ທ່ານອອກຈາກກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-remove--you--unknown": {
        "message": "ທ່ານໄດ້ຖືກຍ້າຍ ອອກຈາກກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--promote--other--other": {
        "message": "$adminName$ ເຮັດ $memberName$ ຜູ້ບໍລິຫານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-privilege--promote--other--you": {
        "message": "ທ່ານໄດ້ $memberName$ ຜູ້ບໍລີຫານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--other--unknown": {
        "message": "ຜູ້ບໍລິຫານໄດ້ $memberName$ ການບໍລິຫານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--you--other": {
        "message": "$adminName$ ທ່ານໄດ້ບໍລິຫານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--promote--you--unknown": {
        "message": "ຜູ້ບໍລິຫານຂອງ ທ່ານໄດ້ບໍລິຫານ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--demote--other--other": {
        "message": "$adminName$ ຂໍ້ໄດ້ປຽບ ຂອງການຖອນຕົວກັບຄືນມາ ຈາກຜູ້ບໍລິຫານ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--member-privilege--demote--other--you": {
        "message": "ຂໍ້ໄດ້ປຽບ ຂອງທ່ານການ ຖອນຕົວກັບຄືນມາ ຈາກຜູ້ບໍລີຫານ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--demote--other--unknown": {
        "message": "ຂໍ້ໄດ້ປຽບ ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວກັບຄືນມາ ຈາກ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--member-privilege--demote--you--other": {
        "message": "$adminName$ ຂໍ້ໄດ້ປຽບ ຜູ້ບໍລິຫານ ທ່ານໄດ້ຖອນຕົວກັບຄືນມາ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--member-privilege--demote--you--unknown": {
        "message": "ຂໍ້ໄດ້ປຽບ ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວກັບຄືນມາ ຜູ້ບໍລິຫານຂອງທ່ານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-add--one--other--other": {
        "message": " $memberName$ ໄດ້ເຊືອເຊີນ 1 ຄົນເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--other--you": {
        "message": "ທ່ານໄດ້ເຊືອເຊີນ $inviteeName$ ເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--other--unknown": {
        "message": "ຫນື່ງຄົນໄດ້ ເຊືອເຊີນເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--you--other": {
        "message": "$memberName$ ທ່ານໄດ້ເຊືອເຊີນເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-add--one--you--unknown": {
        "message": "ທ່ານໄດ້ຖືກເຊືອເຊີນເ ຂົ້າຮ່ວມໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-add--many--other": {
        "message": " $memberName$ ເຊືອເຊີນ$count$ ຜູ້ຄົນເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-add--many--you": {
        "message": "ທ່ານເຊືອເຊີນ $count$ ຄົນທີຢູ່ໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-add--many--unknown": {
        "message": "$count$ ປະຊາຊົນ ໄດ້ຮັບການເຊືອເຊີນ ເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--decline--other": {
        "message": "1 ຄົນໄດ້ເຊືອເຊີນດ້ວຍ $memberName$ ການປະຕິເສດການເຊືອເຊີນຈາກກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--decline--you": {
        "message": " $inviteeName$ ການເຊືອເຊີນ ໄດ້ຖືກປະຕິເສດ ຈາກກຸ່ມຂອງທ່ານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--decline--from-you": {
        "message": "ທ່ານໄດ້ຖືກປະຕິເສດ ການເຊືອເຊີນເຂົ້າໄນກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-remove--decline--unknown": {
        "message": "1 ຄົນໄດ້ຖືກປະຕິເສດ ການເຊືອເຊີນ ຈາກກຸ່ມຂອງເຂົາເຈົ້າ",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--pending-remove--revoke--one--other": {
        "message": "$memberName$ 1 ຄົນໄດ້ຖອນຕົວ ອອກຈາກເຊືອເຊີນ ຂອງກຸ່ມ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--one--you": {
        "message": "ທ່ານໄດ້ຖອນຕົວ ການເຊືອເຊີນ ເຂົ້າກຸ່ມສຳລັບ 1 ຄົນ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-own--to-you": {
        "message": " $inviterName$ ການຖອນຕົວ ຂອງເຂົາເຈົ້າ ໄດ້ເຊືອເຊີນເຖີງທ່ານ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-own--unknown": {
        "message": "$inviterName$ ການຖອນຕົວ ຂອງເຂົາເຈົ້າໄດ້ເຊືອເຊີນ 1 ຄົນ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviterName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--one--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວ ການເຊືອເຊີນ ອອກຈາກກຸ່ມ ສຳລັບ 1 ຄົນ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--other": {
        "message": " $memberName$ ຖອນຕົວ ຈາກການເຊືອເຊີນ ສຳລັບໄນກຸ່ມ $count$ ຜຸູ້ຄົນ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--you": {
        "message": "ທ່ານໄດ້ຖອນຕົວ ຈາກການເຊືອເຊີນ ໄນກຸ່ມສຳລັບ $count$ ຜູ້ຄົນ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke--many--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວ ຈາກການເຊືອເຊີນ ໄນກຸ່ມ ສຳລັບ $count$ ຜູ້ຄົນ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--other": {
        "message": "$adminName$ ຖອນຕົວກັບຄືນມາ ຈາກການເຊືອເຊີນ ໃນກຸ່ມສຳລັບ 1 ຄົນ ໄດ້ຖືກເຊືອເຊີນດວ້ຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--you": {
        "message": "ທ່ານໄດ້ຖອນຕົວ ຈາກການເຊືອເຊີນ ໃນກຸ່ມສັບລັບ 1 ຄົນໄດ້ຖືກເຊືອເຊີນດ້ວຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--one--unknown": {
        "message": "ການຖອນຕົວກັບຄືນມາ ຂອງຜູ້ບໍລິຫານ ໄດ້ຖືກເຊືອເຊີນ ເຂົ້າໄນກຸ່ມສຳລັບ 1 ຄົນ ໄດ້ຖືກເຊືອເຊີນດ້ວຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "memberName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--other": {
        "message": "$adminName$ ການເຊືອເຊີນ ໄດ້ຖືກຖອນຕົວກັບຄືນມາ ຂອງກຸ່ມທີທ່ານໄດ້ສົ່ງຫາ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--you": {
        "message": "ທ່ານ ໄດ້ຍົກເລີກ ການເຊືອເຊີນ ຂອງທ່ານໄປ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--one--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວຈາກກຸ່ມ ທີທ່ານໄດ້ສົ່ງເຖິງ $inviteeName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "inviteeName": {
                "content": "$1",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--other": {
        "message": "$adminName$ ການເຊືອເຊີນ ໄດ້ຖືກຖອນຕົວກັບຄືນ ສຳລັບກຸ່ມ $count$ ຜູ້ຄົນໄດ້ ຖືກເຊືອເຊີນດ້ວຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "memberName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--you": {
        "message": "ທ່ານໄດ້ຖອນຕົວກັບຄືນ ຈາກການເຊືອເຊີນ ເຂົ້າໃນກຸ່ມສຳລັບ $count$ ຜູ້ຄົນໄດ້ ຖືກເຊືອເຊີນດ້ວຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "memberName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from--many--unknown": {
        "message": "ການຖອນຕົວກັບຄືນມາ ຂອງຜູ້ບໍລິຫານ ໄດ້ເຊືອເຊີນ ເຂົ້າໄນກຸ່ມສຳລັບ $count$ ຜູ້ຄົນໄດ້ ຖືກເຊືອເຊີນດ້ວຍ $memberName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "memberName": {
                "content": "$2",
                "example": "Bob"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--other": {
        "message": "$adminName$ ການເຊືອເຊີນ ໄດ້ຖືກຖອນຕົວກັບຄືນມາ ຂອງກຸ່ມທີທ່ານໄດ້ສົ່ງຫາ $count$ ຜູ້ຄົນ",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "count": {
                "content": "$2",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--you": {
        "message": "ທ່ານ ໄດ້ຍົກເລີກ ການເຊືອເຊີນ ຂອງທ່ານໄປ $count$ ຜູ້ຄົນ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--pending-remove--revoke-invite-from-you--many--unknown": {
        "message": "ຜູ້ບໍລິຫານ ໄດ້ຖອນຕົວກັບຄືນມາ ຈາກກຸ່ມ ທີທ່ານໄດ້ສົ່ງຫາ $count$ ຜູ້ຄົນ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV2--admin-approval-add-one--you": {
        "message": "ທ່ານໄດ້ສົ່ງ ຄຳຂໍຮ້ອງ ເຂົ້າຮ່ວມກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-add-one--other": {
        "message": "$joinerName$ ຄຳຂໍຮ້ອງ ເປັນວີທີທາງ ເຂົ້າຮ່ວມກຸ່ມຂອງລີ່ງ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--you--you": {
        "message": "ທ່ານໄດ້ຍົກເລີກ ຄຳຂໍຮ້ອງ ເຂົ້າຮ່ວມກຸ່ມຂອງທ່ານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-remove-one--you--unknown": {
        "message": "ຄຳຂໍຮ້ອງ ຂອງທ່ານ ເຂົ້າຮ່ວມກຸ່ມ ໄດ້ປະຕິເສດ ຈາກຜູ້ບໍລິຫານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--admin-approval-remove-one--other--you": {
        "message": "ຄຳຂໍຮ້ອງຂອງທ່ານ ໄດ້ປະຕິເສດ ການເຂົ້າຮ່ວມຈາກກຸ່ມ $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--other--own": {
        "message": "$joinerName$ ຄຳຂໍຮ້ອງຂອງເຂົາເຈົ້າ ໄດ້ຖືກຍົກເລີກ ເຂົ້າຮ່ວມກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "joinerName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--admin-approval-remove-one--other--other": {
        "message": "$adminName$ ຄຳຂໍຮ້ອງ ໄດ້ປະຕິເສດ ເຂົ້າຮ່ວມຈາກກຸ່ມ $joinerName$.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Bob"
            },
            "joinerName": {
                "content": "$2",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--disabled--you": {
        "message": "ລີ່ງກຸ່ມຂອງທ່ານ ໄດ້ເປິດໄຊ້ງານ ກັບ ຜູ້ບໍລີຫານ ໄດ້ຮັບອານຸຍາດປີດໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--disabled--other": {
        "message": "$adminName$ ລີ່ງກຸ່ມໄດ້ ເປີດໄຊ້ງານ ກັບ ຜູ້ບໍລິຫານ ໄດ້ອານຸຍາດ ປິດໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--disabled--unknown": {
        "message": "ລີ່ງຂອງກຸ່ມ ໄດ້ມີການເປີດ ນຳໄຊ້ງານ ກັບ ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ປີດໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--enabled--you": {
        "message": "ລີ່ງກຸ່ມຂອງທ່ານ ໄດ້ເປີດໄຊ້ງານ ກັບ ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ນຳໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-add--enabled--other": {
        "message": "$adminName$ ເປີດລີ່ງຂອງກຸ່ມ ກັບ ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ນຳໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-add--enabled--unknown": {
        "message": "ລີ່ງຂອງກຸ່ມ ໄດ້ມີການເປີດ ນຳໄຊ້ງານ ກັບ ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ນຳໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-remove--you": {
        "message": "ທ່ານປິດການ ນຳໄຊ້ລີ່ງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-remove--other": {
        "message": "$adminName$ ປີດການນຳໄຊ້ລີ່ງກຸ່ມ.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-remove--unknown": {
        "message": "ລີ່ງກຸ່ມນີ້ໄດ້ ປີດການນຳໄຊ້ງານ.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-reset--you": {
        "message": "ທ່ານຕິດຕັ້ງເຄືອງ ກຸ່ມລີ່ງໄຫມ່.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--group-link-reset--other": {
        "message": "$adminName$ ຕິດຕັ້ງເຄືອງກຸ່ມລີ່ງໄຫມ່.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--group-link-reset--unknown": {
        "message": "ລີ່ງຂອງກຸ່ມໄດ້ມີການ ຕິດຕັ້ງເຄືອງໄຫມ່.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--remove--you": {
        "message": "You removed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--remove--other": {
        "message": "$memberName$ removed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--description--remove--unknown": {
        "message": "The group description was removed.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--change--you": {
        "message": "You changed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV2--description--change--other": {
        "message": "$memberName$ changed the group description.",
        "description": "Shown in timeline or conversation preview when v2 group changes",
        "placeholders": {
            "adminName": {
                "content": "$1",
                "example": "Alice"
            }
        }
    },
    "GroupV2--description--change--unknown": {
        "message": "The group description was changed.",
        "description": "Shown in timeline or conversation preview when v2 group changes"
    },
    "GroupV1--Migration--disabled": {
        "message": "Upgrade this group to activate new features like @mentions and admins. Members who have not shared their name or photo in this group will be invited to join. $learnMore$",
        "description": "Shown instead of composition area when user is forced to migrate a legacy group (GV1).",
        "placeholders": {
            "learnMore": {
                "content": "$1",
                "example": "Learn more."
            }
        }
    },
    "GroupV1--Migration--was-upgraded": {
        "message": "ກຸ່ມນີ້ ໄດ້ມີການເພີມ ລະດັບກຸ່ມໄຫມ່.",
        "description": "Shown in timeline when a legacy group (GV1) is upgraded to a new group (GV2)"
    },
    "GroupV1--Migration--learn-more": {
        "message": "ຮຽນຮູ້ເພີມເຕິມ",
        "description": "Shown on a bubble below a 'group was migrated' timeline notification, or as button on Migrate dialog"
    },
    "GroupV1--Migration--migrate": {
        "message": "ການເພີມລະອັບ",
        "description": "Shown on Migrate dialog to kick off the process"
    },
    "GroupV1--Migration--info--title": {
        "message": "ກຸ່ມໄຫມ່ແມ່ນຫຍັງ?",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--migrate--title": {
        "message": "ການເພີມລະອັບກຸ່ມໄຫມ່",
        "description": "Shown on Migration popup after choosing to migrate group"
    },
    "GroupV1--Migration--info--summary": {
        "message": "New Groups have features like @mentions and group admins, and will support more features in the future.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--keep-history": {
        "message": "ຂໍ້ຄວາມທັງໝົດ ໄນປະຫວັດສາດ ແລະ ການສື່ສານມວນຊົນ ໄດ້ມີການເກັບໄວ້ ທີຜ່ານມາ ຈະໄດ້ມີ ການອັບກຽດ.",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--migrate--keep-history": {
        "message": "ຂໍ້ຄວາມທັງໝົດ ໃນປະຫວັດສາດ ແລະ ການສື່ສານມວນຊົນ ທີໄດ້ເກັບຮັກໄວ້ ທີຜ່ານມາ ຈະໄດ້ມີການ ອັບກຽດ.",
        "description": "Shown on Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--invited--you": {
        "message": "ທ່ານຕ້ອງການທີຈະຮັບ ຄຳເຊືອເຊີນ ຂອງກຸ່ມນີ້ອີກຄັ້ງ; ແລະ ຈະບໍໄດ້ຍ້ອມຮັບ ຂໍ້ຄວາມຈາກກຸ່ມຈົນກວ່າ ພວກເຂົາເຈົ້າ ຈະຍ້ອມຮັບ.",
        "description": "Shown on Learn More popup after GV1 migration"
    },
    "GroupV1--Migration--info--invited--many": {
        "message": "ສະມາຊີກເຫຼົ່ານີ້ ຕ້ອງການທີຈະຮັບ ຄຳເຊືອເຊີນ ຂອງກຸ່ມນີ້ອີກຄັ້ງ; ແລະ ຈະບໍໄດ້ຍ້ອມຮັບ ຂໍ້ຄວາມຈາກກຸ່ມຈົນກວ່າ ພວກເຂົາເຈົ້າ ຈະຍ້ອມຮັບ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--invited--one": {
        "message": "ສະມາຊີກນີ້ ຕ້ອງການທີຈະຮັບ ຄຳເຊືອເຊີນ ຂອງກຸ່ມນີ້ ອີກຄັ້ງ; ແລະ ຈະບໍໄດ້ຍ້ອມຮັບ ຂໍ້ຄວາມຈາກກຸ່ມຈົນກວ່າ ພວກເຂົາເຈົ້າ ຈະຍ້ອມຮັບ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--before--many": {
        "message": "ສະມາຊີກເຫຼົ່ານີ້ ພວກເຂົາບໍສາມາດ ທີຈະເຂົ້າຮ່ວມກຸ່ມໄຫມ່; ແລະ ຈະຕ້ອງໄດ້ຍ້າຍອອກຈາກກຸ່ມ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--before--one": {
        "message": "ສະມາຊີກນີ້ ບໍສາມາດ ເຂົ້າຮ່ວມ ກຸ່ມໄຫມ່ໄດ້; ແລະ ຈະຕ້ອງໄດ້ຍ້າຍອອກຈາກກຸ່ມ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--after--many": {
        "message": "ສະມາຊີກເຫຼົ່ານີ້ ບໍສາມາດເຂົ້າຮ່ວມ ກຸ່ມໄຫມ່ໄດ້; ແລະ ໄດ້ມີການຍ້າຍອອກຈາກກຸ່ມ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--info--removed--after--one": {
        "message": "ສະມາຊີກນີ້ ບໍສາມາດ ທີຈະເຂົ້າຮ່ວມ ກຸ່ມໄຫມ່ໄດ້; ແລະ ໄດ້ຍ້າຍອອກ ຈາກກຸ່ມ.",
        "description": "Shown on Learn More popup after or Migration popup before GV1 migration"
    },
    "GroupV1--Migration--invited--you": {
        "message": "ທ່ານຍັງ ບໍສາມາດ ທີຈະເພີມກຸ່ມໄຫມ່ໄດ້ ແລະ ມີ ການເຊືອເຊີນ ເຂົ້າຮ່ວມ.",
        "description": "Shown in timeline when a group is upgraded and you were invited instead of added"
    },
    "GroupV1--Migration--invited--one": {
        "message": "$contact$ ບໍສາມາດ ທີຈະເພີມກຸ່ມໄຫມ່ ແລະ ໄດ້ມີການ ເຊືອເຊີນເຂົ້າຮ່ວມ.",
        "description": "Shown in timeline when a group is upgraded and one person was invited, instead of added",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--invited--many": {
        "message": "$count$ ສະມາຊີກ ບໍສາມາດ ທີຈະເພີມກຸ່ມໄຫມ່ ແລະ ໄດ້ມີການ ເຊືອເຊີນເຂົ້າຮ່ວມ.",
        "description": "Shown in timeline when a group is upgraded and some people were invited, instead of added",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--removed--one": {
        "message": "$contact$ ໄດ້ຖືກຍ້າຍ ອອກຈາກກຸ່ມ",
        "description": "Shown in timeline when a group is upgraded and one person was removed entirely during the upgrade",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "GroupV1--Migration--removed--many": {
        "message": "$count$ ສຳມະຊີກກຸ່ມ ໄດ້ຍ້າຍອອກຈາກກຸ່ມ",
        "description": "Shown in timeline when a group is upgraded and some people were removed entirely during the upgrade",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "close": {
        "message": "ປິດ",
        "description": "Generic close label"
    },
    "previous": {
        "message": "ທີ່ຜ່ານມາ",
        "description": "Generic previous label"
    },
    "next": {
        "message": "ຕໍ່ໄປ",
        "description": "Generic next label"
    },
    "CompositionArea--expand": {
        "message": "ຂະຫຍາຍ",
        "description": "Aria label for expanding composition area"
    },
    "CompositionArea--attach-file": {
        "message": "ຕີດຕັ້ງໄຟຮ",
        "description": "Aria label for file attachment button in composition area"
    },
    "CompositionArea--sms-only__title": {
        "message": "This person isn’t using Signal",
        "description": "Title for the composition area for the SMS-only contact"
    },
    "CompositionArea--sms-only__body": {
        "message": "Signal Desktop does not support messaging non-Signal contacts. Ask this person to install Signal for a more secure messaging experience.",
        "description": "Body for the composition area for the SMS-only contact"
    },
    "CompositionArea--sms-only__spinner-label": {
        "message": "Checking contact's registration status",
        "description": "Displayed while checking if the contact is SMS-only"
    },
    "countMutedConversationsDescription": {
        "message": "ນັບການສົນທະນາ ທີ່ຖືກປິດສຽງໄນປ້າຍຊື່",
        "description": "Description for counting muted conversations in badge setting"
    },
    "ContactModal--message": {
        "message": "ຂໍ້ຄວາມ",
        "description": "Button text for send message button in Group Contact Details modal"
    },
    "ContactModal--rm-admin": {
        "message": "ຍ້າຍຜູ້ບໍລິຫານ",
        "description": "Button text for removing as admin button in Group Contact Details modal"
    },
    "ContactModal--make-admin": {
        "message": "ຜຸ້ບໍລິຫານ",
        "description": "Button text for make admin button in Group Contact Details modal"
    },
    "ContactModal--make-admin-info": {
        "message": " $contact$ ຈະສາມາດ ແກ້ໄຂ ກຸ່ມນີ້ ແລະ ສະມາຊີກຂອງມັນ.",
        "description": "Shown in a confirmation dialog when you are about to grant admin privileges to someone",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Homer"
            }
        }
    },
    "ContactModal--rm-admin-info": {
        "message": "ຍ້າຍ $contact$ ກຸ່ມຜູ້ບໍລີຫານ",
        "description": "Shown in a confirmation dialog when you are about to remove admin privileges from someone",
        "placeholders": {
            "contact": {
                "content": "$1",
                "example": "Homer"
            }
        }
    },
    "ContactModal--remove-from-group": {
        "message": "ຍ້າຍອອກຈາກກຸ່ມ",
        "description": "Button text for remove from group button in Group Contact Details modal"
    },
    "showChatColorEditor": {
        "message": "Chat color",
        "description": "This is a button in the conversation context menu to show the chat color editor"
    },
    "showConversationDetails": {
        "message": "ຕິດຕັ້ງກຸ່ມ",
        "description": "This is a button in the conversation context menu to show group settings"
    },
    "ConversationDetails--group-link": {
        "message": "ລີ່ງກຸ່ມ",
        "description": "This is the label for the group link management panel"
    },
    "ConversationDetails--disappearing-messages-label": {
        "message": "ຂໍ້ຄວາມທີຫາຍໄປ",
        "description": "This is the label for the disappearing messages setting panel"
    },
    "ConversationDetails--disappearing-messages-info": {
        "message": "When enabled, messages sent and received in this group will disappear after they've been seen.",
        "description": "This is the info about the disappearing messages setting"
    },
    "ConversationDetails--group-info-label": {
        "message": "ໄຜສາມາດ ແກ້ໄຂ ຂໍ້ມູນກຸ່ມ",
        "description": "This is the label for the 'who can edit the group' panel"
    },
    "ConversationDetails--group-info-info": {
        "message": "Choose who can edit group name, photo, description, and disappearing messages timer.",
        "description": "This is the additional info for the 'who can edit the group' panel"
    },
    "ConversationDetails--add-members-label": {
        "message": "ໄຜສາມາດ ເພີ່ມສະມາຊີກ",
        "description": "This is the label for the 'who can add members' panel"
    },
    "ConversationDetails--add-members-info": {
        "message": "ເລືອກໄຜ ສາມາດເພີ່ມ ສະມາຊີກ ເຂົ້າໄນກຸ່ມນີ້",
        "description": "This is the additional info for the 'who can add members' panel"
    },
    "ConversationDetails--requests-and-invites": {
        "message": "ຄຳຂໍຮ້ອງ ແລະ ການເຊືອເຊີນ",
        "description": "This is a button to display which members have been invited but have not joined yet"
    },
    "ConversationDetailsActions--leave-group": {
        "message": "ອອກຈາກກຸ່ມ",
        "description": "This is a button to leave a group"
    },
    "ConversationDetailsActions--block-group": {
        "message": "ບ໋ອກກຸ່ມ",
        "description": "This is a button to block a group"
    },
    "ConversationDetailsActions--leave-group-must-choose-new-admin": {
        "message": "Before you leave, you must choose at least one new admin for this group.",
        "description": "Shown if, before leaving a group, you need to choose an admin"
    },
    "ConversationDetailsActions--leave-group-modal-title": {
        "message": "ທ່ານຕ້ອງການທີ ຈະອອກຈາກກຸ່ມບໍ່?",
        "description": "This is the modal title for confirming leaving a group"
    },
    "ConversationDetailsActions--leave-group-modal-content": {
        "message": "ທ່ານຈະບໍ່ສາມາດ ສົ່ງ ຫຼື ຈົນກວ່າ ຈະໄດ້ຮັບຂໍ້ຄວາມ ໃນກຸ່ມນີ້.",
        "description": "This is the modal content for confirming leaving a group"
    },
    "ConversationDetailsActions--leave-group-modal-confirm": {
        "message": "ອອກຈາກ",
        "description": "This is the modal button to confirm leaving a group"
    },
    "ConversationDetailsActions--block-group-modal-title": {
        "message": "ບ໋ອກ ແລະ ອອກຈາກ \"$groupName$\" ກຸ່ມ?",
        "description": "This is the modal title for confirming blocking a group",
        "placeholders": {
            "groupName": {
                "content": "$1",
                "example": "Our Conversation"
            }
        }
    },
    "ConversationDetailsActions--block-group-modal-content": {
        "message": "ທ່ານຈະບໍ່ໄດ້ຮັບ ຂໍ້ຄວາມ ຫຼື ການອັບ ຈາກກຸ່ມນີ້.",
        "description": "This is the modal content for confirming blocking a group"
    },
    "ConversationDetailsActions--block-group-modal-confirm": {
        "message": "ບ໋ອກ",
        "description": "This is the modal button to confirm blocking a group"
    },
    "ConversationDetailsHeader--members": {
        "message": "$number$ ສະມາຊີກ",
        "description": "This is the number of members in a group",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "ConversationDetailsMediaList--shared-media": {
        "message": "ການແບ່ງປັນ ຂໍມູນຂາວສານ",
        "description": "Title for the media thumbnails in the conversation details screen"
    },
    "ConversationDetailsMediaList--show-all": {
        "message": "ເຫັນທັງໝົດ",
        "description": "This is a button on the conversation details to show all media"
    },
    "ConversationDetailsMembershipList--title": {
        "message": "$number$ ສະມາຊີກ",
        "description": "The title of the membership list panel",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "10"
            }
        }
    },
    "ConversationDetailsMembershipList--add-members": {
        "message": "Add members",
        "description": "The button that you can click to add new members"
    },
    "ConversationDetailsMembershipList--show-all": {
        "message": "ເຫັນທັງໝົດ",
        "description": "This is a button on the conversation details to show all members"
    },
    "GroupLinkManagement--clipboard": {
        "message": "ກ໋ອບປີ້ ລີ່ງກຸ່ມ",
        "description": "Shown in a toast when a user selects to copy group link"
    },
    "GroupLinkManagement--share": {
        "message": "ກ໋ອບປິ້ລີ່ງ",
        "description": "This lets users share their group link"
    },
    "GroupLinkManagement--confirm-reset": {
        "message": "ທ່ານແນ່ໄຈ ແລ້ວບໍວ່າ ທ່ານຕ້ອງການຕັ້ງ ກຸ່ມລີ່ງນີ້ຄືນໄໝ່? ຜູ້ຄົນຈະບໍສາມາດ ເຂົ້າຮ່ວມ ໂດຍການໄຊ້ລີ້ງ ເຊື່ອມຕໍ່",
        "description": "Shown in the confirmation dialog when an admin is about to reset the group link"
    },
    "GroupLinkManagement--reset": {
        "message": "ຕິດຕັ້ງເຄືອງ ລີ່ງໄໝ່",
        "description": "This lets users generate a new group link"
    },
    "GroupLinkManagement--approve-label": {
        "message": "ອານຸຍາດ ໄຫ້ສະມາຊີກໄໝ່",
        "description": "Title for the approve new members select area"
    },
    "GroupLinkManagement--approve-info": {
        "message": "ຜູ້ບໍລີຫານ ໄດ້ອານຸຍາດ ໄຫ້ສຳມະຊີກໄໝ່ ເຂົ້າຮ່ວມທາງ ກຸ່ມຂອງລີ່ງ",
        "description": "Description for the approve new members select area"
    },
    "PendingInvites--tab-requests": {
        "message": "ຄຳຂໍຮ້ອງ ($count$)",
        "description": "Label for the tab to view pending requests",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "4"
            }
        }
    },
    "PendingInvites--tab-invites": {
        "message": "ການເຊືອເຊີນ ($count$)",
        "description": "Label for the tab to view pending invites",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "2"
            }
        }
    },
    "PendingRequests--approve-for": {
        "message": "ຄຳຂໍຮ້ອງ ໄດ້ອານຸຍາດຈາກ \"$name$\"?",
        "description": "This is the modal content when confirming approving a group request to join",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Meowsy Purrington"
            }
        }
    },
    "PendingRequests--deny-for": {
        "message": "ຄຳຂໍຮ້ອງ ໄດ້ປະຕິເສດ ຈາກ\"$name$\"?",
        "description": "This is the modal content when confirming denying a group request to join",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Meowsy Purrington"
            }
        }
    },
    "PendingInvites--invites": {
        "message": "ໄດ້ເຊືອເຊີນ ຈາກທ່ານ",
        "description": "This is the title list of all invites"
    },
    "PendingInvites--invited-by-you": {
        "message": "ໄດ້ເຊືອເຊີນ ຈາກທ່ານ",
        "description": "This is the title for the list of members you have invited"
    },
    "PendingInvites--invited-by-others": {
        "message": "ໄດ້ເຊືອເຊີນ ຈາກຄົນອື່ນ",
        "description": "This is the title for the list of members who have invited other people"
    },
    "PendingInvites--invited-count": {
        "message": "ເຊືອເຊີນ $number$",
        "description": "This is the label for the number of members someone has invited",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "PendingInvites--revoke-for-label": {
        "message": "ຖອນຕົວ ຈາກການເຊືອເຊີນ ກຸ່ມ",
        "description": "This is aria label for revoking a group invite icon"
    },
    "PendingInvites--revoke-for": {
        "message": "ຖອນຕົວຈາກການ ເຊືອເຊີນກຸ່ມ ສຳລັບ \"$name$\"?",
        "description": "This is the modal content when confirming revoking a single invite",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            },
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke-from-singular": {
        "message": "ຖອນຕົວ 1 ການເຊືອເຊີນ ສົ່ງຈາກ \"$name$\"?",
        "description": "This is the modal content when confirming revoking a single invite",
        "placeholders": {
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke-from-plural": {
        "message": "ຖອນຕົວ $number$ ການເຊືອເຊີນຈາກ \"$name$\"",
        "description": "This is the modal content when confirming revoking multiple invites",
        "placeholders": {
            "number": {
                "content": "$1",
                "example": "3"
            },
            "name": {
                "content": "$2",
                "example": "Fred Riley III"
            }
        }
    },
    "PendingInvites--revoke": {
        "message": "ຖອນຕົວ",
        "description": "This is the modal button to confirm revoking invites"
    },
    "PendingRequests--approve": {
        "message": "ຄຳຂໍຮ້ອງ ການອານຸຍາດ ",
        "description": "This is the modal button to approve group request to join"
    },
    "PendingRequests--deny": {
        "message": "ປະຕິເສດ ຄຳຂໍຮ້ອງ",
        "description": "This is the modal button to deny group request to join"
    },
    "PendingRequests--info": {
        "message": "ຜູ້ຢູ່ໄນລາຍຊື່ ແມ່ນພາຍາຍາມ ເຂົ້າຮ່ວມ \" $name$\" ທາງຂອງກຸ່ມລີ່ງ.",
        "description": "Inforamtion shown below the pending admin approval list",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Tahoe List"
            }
        }
    },
    "PendingInvites--info": {
        "message": "Details about people invited to this group aren’t shown until they join. Invitees will only see messages after they join the group.",
        "description": "Information shown below the invite list"
    },
    "AvatarInput--no-photo-label--group": {
        "message": "Add a group photo",
        "description": "The label for the avatar uploader when no group photo is selected"
    },
    "AvatarInput--change-photo-label": {
        "message": "Change photo",
        "description": "The label for the avatar uploader when a photo is selected"
    },
    "AvatarInput--upload-photo-choice": {
        "message": "Upload photo",
        "description": "The button text when you click on an uploaded avatar and want to upload a new one"
    },
    "AvatarInput--remove-photo-choice": {
        "message": "Remove photo",
        "description": "The button text when you click on an uploaded avatar and want to remove it"
    },
    "ContactPill--remove": {
        "message": "Remove contact",
        "description": "The label for the 'remove' button on the contact pill"
    },
    "ComposeErrorDialog--close": {
        "message": "ໂອເຄ",
        "description": "The text on the button when there's an error in the composer"
    },
    "NewlyCreatedGroupInvitedContactsDialog--title--one": {
        "message": "Invitation sent",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--title--many": {
        "message": "$count$ invitations sent",
        "description": "When creating a new group and inviting users, this is shown in the dialog",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            }
        }
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--user-paragraph--one": {
        "message": "$name$ can’t be automatically added to this group by you.",
        "description": "When creating a new group and inviting users, this is shown in the dialog",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--user-paragraph--many": {
        "message": "These users can’t be automatically added to this group by you.",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--info-paragraph": {
        "message": "They’ve been invited to join, and won’t see any group messages until they accept.",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "NewlyCreatedGroupInvitedContactsDialog--body--learn-more": {
        "message": "Learn more",
        "description": "When creating a new group and inviting users, this is shown in the dialog"
    },
    "AddGroupMembersModal--title": {
        "message": "Add members",
        "description": "When adding new members to an existing group, this is shown in the dialog"
    },
    "AddGroupMembersModal--continue-to-confirm": {
        "message": "Update",
        "description": "When adding new members to an existing group, this is shown in the dialog"
    },
    "AddGroupMembersModal--confirm-title--one": {
        "message": "Add $person$ to \"$group$\"?",
        "description": "When adding new members to an existing group, this is shown in the confirmation dialog",
        "placeholders": {
            "person": {
                "content": "$1",
                "example": "Jane Doe"
            },
            "group": {
                "content": "$2",
                "example": "Tahoe Trip"
            }
        }
    },
    "AddGroupMembersModal--confirm-title--many": {
        "message": "Add $count$ members to \"$group$\"?",
        "description": "When adding new members to an existing group, this is shown in the confirmation dialog",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "5"
            },
            "group": {
                "content": "$2",
                "example": "Tahoe Trip"
            }
        }
    },
    "AddGroupMembersModal--confirm-button--one": {
        "message": "Add member",
        "description": "When adding new members to an existing group, this is shown on the confirmation dialog button"
    },
    "AddGroupMembersModal--confirm-button--many": {
        "message": "Add members",
        "description": "When adding new members to an existing group, this is shown on the confirmation dialog button"
    },
    "createNewGroupButton": {
        "message": "New group",
        "description": "The text of the button to create new groups"
    },
    "selectContact": {
        "message": "Select contact",
        "description": "The label for contact checkboxes that are non-selected (clicking them should select the contact)"
    },
    "deselectContact": {
        "message": "De-select contact",
        "description": "The label for contact checkboxes that are selected (clicking them should de-select the contact)"
    },
    "cannotSelectContact": {
        "message": "Cannot select contact",
        "description": "The label for contact checkboxes that are disabled"
    },
    "alreadyAMember": {
        "message": "Already a member",
        "description": "The label for contact checkboxes that are disabled because they're already a member"
    },
    "MessageAudio--play": {
        "message": "Play audio attachment",
        "description": "Aria label for audio attachment's Play button"
    },
    "MessageAudio--pause": {
        "message": "Pause audio attachment",
        "description": "Aria label for audio attachment's Pause button"
    },
    "MessageAudio--download": {
        "message": "Download audio attachment",
        "description": "Aria label for audio attachment's Download button"
    },
    "MessageAudio--pending": {
        "message": "Downloading audio attachment...",
        "description": "Aria label for pending audio attachment spinner"
    },
    "MessageAudio--slider": {
        "message": "Playback time of audio attachment",
        "description": "Aria label for audio attachment's playback time slider"
    },
    "emptyInboxMessage": {
        "message": "Click the $composeIcon$ above and search for your contacts or groups to message.",
        "description": "Shown in the left-pane when the inbox is empty",
        "placeholders": {
            "composeIcon": {
                "content": "$1",
                "example": "compose button"
            }
        }
    },
    "composeIcon": {
        "message": "compose button",
        "description": "Shown in the left-pane when the inbox is empty. Describes the button that composes a new message."
    },
    "ForwardMessageModal--continue": {
        "message": "ສືບຕໍ່",
        "description": "aria-label for the 'next' button in the forward a message modal dialog"
    },
    "MessageRequestWarning__learn-more": {
        "message": "Learn more",
        "description": "Shown on the message request warning. Clicking this button will open a dialog with more information"
    },
    "MessageRequestWarning__dialog__details": {
        "message": "You have no groups in common with this person. Review requests carefully before accepting to avoid unwanted messages.",
        "description": "Shown in the message request warning dialog. Gives more information about message requests"
    },
    "MessageRequestWarning__dialog__learn-even-more": {
        "message": "About Message Requests",
        "description": "Shown in the message request warning dialog. Clicking this button will open a page on Signal's support site"
    },
    "ContactSpoofing__same-name": {
        "message": "Review requests carefully. Signal found another contact with the same name. $link$",
        "description": "Shown in the timeline warning when you have a message request from someone with the same name as someone else",
        "placeholders": {
            "link": {
                "content": "$1",
                "example": "Review request"
            }
        }
    },
    "ContactSpoofing__same-name-in-group": {
        "message": "$count$ group members have the same name. $link$",
        "description": "Shown in the timeline warning when you multiple group members have the same name",
        "placeholders": {
            "count": {
                "content": "$1",
                "example": "3"
            },
            "link": {
                "content": "$2",
                "example": "Tap to review"
            }
        }
    },
    "ContactSpoofing__same-name__link": {
        "message": "Review request",
        "description": "Shown in the timeline warning when you have a message request from someone with the same name as someone else"
    },
    "ContactSpoofing__same-name-in-group__link": {
        "message": "Click to review",
        "description": "Shown in the timeline warning when you multiple group members have the same name"
    },
    "ContactSpoofingReviewDialog__title": {
        "message": "Review request",
        "description": "Title for the contact name spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__description": {
        "message": "If you're not sure who the request is from, review the contacts below and take action.",
        "description": "Description for the contact spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__possibly-unsafe-title": {
        "message": "Request",
        "description": "Header in the contact spoofing review dialog, shown above the potentially-unsafe user"
    },
    "ContactSpoofingReviewDialog__safe-title": {
        "message": "Your contact",
        "description": "Header in the contact spoofing review dialog, shown above the \"safe\" user"
    },
    "ContactSpoofingReviewDialog__group__title": {
        "message": "Review members",
        "description": "Title for the contact name spoofing review dialog in groups"
    },
    "ContactSpoofingReviewDialog__group__description": {
        "message": "$count$ group members have similar names. Review the members below or choose to take action.",
        "description": "Description for the group contact spoofing review dialog"
    },
    "ContactSpoofingReviewDialog__group__members-header": {
        "message": "Members",
        "description": "Header in the group contact spoofing review dialog. After this header, there will be a list of members"
    },
    "ContactSpoofingReviewDialog__group__name-change-info": {
        "message": "Recently changed their profile name from $oldName$ to $newName$",
        "description": "In the group contact spoofing review dialog, this text is shown when someone has changed their name recently",
        "placeholders": {
            "oldName": {
                "content": "$1",
                "example": "Jane Doe"
            },
            "newName": {
                "content": "$2",
                "example": "Doe Jane"
            }
        }
    },
    "RemoveGroupMemberConfirmation__remove-button": {
        "message": "ຍ້າຍອອກຈາກກຸ່ມ",
        "description": "When confirming the removal of a group member, show this text in the button"
    },
    "RemoveGroupMemberConfirmation__description": {
        "message": "Remove \"$name$\" from the group?",
        "description": "When confirming the removal of a group member, show this text in the dialog",
        "placeholders": {
            "name": {
                "content": "$1",
                "example": "Jane Doe"
            }
        }
    },
    "CaptchaDialog__title": {
        "message": "Verify to continue messaging",
        "description": "Header in the captcha dialog"
    },
    "CaptchaDialog__first-paragraph": {
        "message": "To help prevent spam on Signal, please complete verification.",
        "description": "First paragraph in the captcha dialog"
    },
    "CaptchaDialog__second-paragraph": {
        "message": "After verifying, you can continue messaging. Any paused messages will automatically be sent.",
        "description": "First paragraph in the captcha dialog"
    },
    "CaptchaDialog--can-close__title": {
        "message": "Continue Without Verifying?",
        "description": "Header in the captcha dialog that can be closed"
    },
    "CaptchaDialog--can-close__body": {
        "message": "If you choose to skip verification, you may miss messages from other people and your messages may fail to send.",
        "description": "Body of the captcha dialog that can be closed"
    },
    "CaptchaDialog--can_close__skip-verification": {
        "message": "Skip verification",
        "description": "Skip button of the captcha dialog that can be closed"
    },
    "verificationComplete": {
        "message": "Verification complete.",
        "description": "Displayed after successful captcha"
    },
    "verificationFailed": {
        "message": "Verification failed. Please retry later.",
        "description": "Displayed after unsuccessful captcha"
    },
    "deleteForEveryoneFailed": {
        "message": "Failed to delete message for everyone. Please retry later.",
        "description": "Displayed when delete-for-everyone has failed to send to all recepients"
    },
    "ChatColorPicker__delete--title": {
        "message": "Delete color",
        "description": "Confirm title for deleting custom color"
    },
    "ChatColorPicker__delete--message": {
        "message": "This custom color is used in $num$ chats. Do you want to delete it for all chats?",
        "description": "Confirm message for deleting custom color",
        "placeholders": {
            "num": {
                "content": "$1",
                "example": "5"
            }
        }
    },
    "ChatColorPicker__global-chat-color": {
        "message": "Global Chat Color",
        "description": "Modal title for the chat color picker and editor for all conversations"
    },
    "ChatColorPicker__menu-title": {
        "message": "Chat Color",
        "description": "View title for the chat color picker and editor"
    },
    "ChatColorPicker__reset": {
        "message": "Reset chat color",
        "description": "Button label for resetting chat colors"
    },
    "ChatColorPicker__resetDefault": {
        "message": "Reset Chat Colors",
        "description": "Confirmation dialog title for resetting all chat colors or only the global default one"
    },
    "ChatColorPicker__resetAll": {
        "message": "Reset all chat colors",
        "description": "Button label for resetting all chat colors"
    },
    "ChatColorPicker__confirm-reset-default": {
        "message": "Reset default",
        "description": "Button label for resetting only global chat color"
    },
    "ChatColorPicker__confirm-reset": {
        "message": "Reset",
        "description": "Confirm button label for resetting chat colors"
    },
    "ChatColorPicker__confirm-reset-message": {
        "message": "Would you like to override all chat colors?",
        "description": "Modal message text for confirming resetting of chat colors"
    },
    "ChatColorPicker__custom-color--label": {
        "message": "Show custom color editor",
        "description": "aria-label for custom color editor button"
    },
    "ChatColorPicker__sampleBubble1": {
        "message": "Here's a preview of the chat color.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__sampleBubble2": {
        "message": "Another bubble.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__sampleBubble3": {
        "message": "The color is visible to only you.",
        "description": "An example message bubble for selecting the chat color"
    },
    "ChatColorPicker__context--edit": {
        "message": "Edit color",
        "description": "Option in the custom color bubble context menu"
    },
    "ChatColorPicker__context--duplicate": {
        "message": "Duplicate",
        "description": "Option in the custom color bubble context menu"
    },
    "ChatColorPicker__context--delete": {
        "message": "ລົບ",
        "description": "Option in the custom color bubble context menu"
    },
    "CustomColorEditor__solid": {
        "message": "Solid",
        "description": "Tab label for selecting solid colors"
    },
    "CustomColorEditor__gradient": {
        "message": "Gradient",
        "description": "Tab label for selecting a gradient"
    },
    "CustomColorEditor__hue": {
        "message": "Hue",
        "description": "Label for the hue slider"
    },
    "CustomColorEditor__saturation": {
        "message": "Saturation",
        "description": "Label for the saturation slider"
    },
    "CustomColorEditor__title": {
        "message": "Custom Color",
        "description": "Modal title for the custom color editor"
    },
    "customDisappearingTimeOption": {
        "message": "Custom time...",
        "description": "Text for an option in Disappearing Messages menu and Conversation Details Disappearing Messages setting when no user value is available"
    },
    "selectedCustomDisappearingTimeOption": {
        "message": "Custom time",
        "description": "Text for an option in Conversation Details Disappearing Messages setting when user previously selected custom time"
    },
    "DisappearingTimeDialog__title": {
        "message": "Custom Time",
        "description": "Title for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__body": {
        "message": "Choose a custom time for disappearing messages.",
        "description": "Body for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__set": {
        "message": "Set",
        "description": "Text for the dialog button confirming the custom disappearing message timeout"
    },
    "DisappearingTimeDialog__seconds": {
        "message": "Seconds",
        "description": "Name of the 'seconds' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__minutes": {
        "message": "Minutes",
        "description": "Name of the 'minutes' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__hours": {
        "message": "Hours",
        "description": "Name of the 'hours' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__days": {
        "message": "Days",
        "description": "Name of the 'days' unit select for the custom disappearing message timeout dialog"
    },
    "DisappearingTimeDialog__weeks": {
        "message": "Weeks",
        "description": "Name of the 'weeks' unit select for the custom disappearing message timeout dialog"
    },
    "settings__DisappearingMessages__footer": {
        "message": "Set a default disappearing message timer for all new chats started by you.",
        "description": "Footer for the Disappearing Messages settings section"
    },
    "settings__DisappearingMessages__timer__label": {
        "message": "Default timer for new chats",
        "description": "Label for the Disapearring Messages default timer setting"
    },
    "UniversalTimerNotification__text": {
        "message": "The disappearing message time will be set to $timeValue$ when you message them.",
        "description": "A message displayed when default disappearing message timeout is about to be applied",
        "placeholders": {
            "timeValue": {
                "content": "$1",
                "example": "1 week"
            }
        }
    },
    "GroupDescription__read-more": {
        "message": "read more",
        "description": "Button text when the group description is too long"
    },
    "EditConversationAttributesModal__description-warning": {
        "message": "Group descriptions will be visible to members of this group and people who have been invited.",
        "description": "Label text shown when editing group description"
    },
    "ConversationDetailsHeader--add-group-description": {
        "message": "Add group description...",
        "description": "Placeholder text in the details header for those that can edit the group description"
    }
}
